TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:30 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/drivers/gpio/src/32b/f28x/f2806
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.10\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp

    1841              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_EQEP1S"), DW_AT_const_value(0x01)
    1842              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_MCLKXA"), DW_AT_const_value(0x02)
    1843              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_52_Mode_TZ3_NOT"), DW_AT_const_value(0x03)
    1844              $C$DW$366       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1845              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_EQEP1I"), DW_AT_const_value(0x01)
    1846              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_MFSXA"), DW_AT_const_value(0x02)
    1847              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_53_Mode_Rsvd_1"), DW_AT_const_value(0x03)
    1848              $C$DW$370       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1849              $C$DW$371       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_SPISIMOA"), DW_AT_const_value(0x01)
    1850              $C$DW$372       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_EQEP2A"), DW_AT_const_value(0x02)
    1851              $C$DW$373       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_54_Mode_HRCAP1"), DW_AT_const_value(0x03)
    1852              $C$DW$374       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1853              $C$DW$375       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_SPISOMIA"), DW_AT_const_value(0x01)
    1854              $C$DW$376       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_EQEP2B"), DW_AT_const_value(0x02)
    1855              $C$DW$377       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_55_Mode_HRCAP2"), DW_AT_const_value(0x03)
    1856              $C$DW$378       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1857              $C$DW$379       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_SPICLKA"), DW_AT_const_value(0x01)
    1858              $C$DW$380       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_EQEP2I"), DW_AT_const_value(0x02)
    1859              $C$DW$381       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_56_Mode_HRCAP3"), DW_AT_const_value(0x03)
    1860              $C$DW$382       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1861              $C$DW$383       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_SPISTEA_NOT"), DW_AT_const_value(0x01)
    1862              $C$DW$384       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_EQEP2S"), DW_AT_const_value(0x02)
    1863              $C$DW$385       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_57_Mode_HRCAP4"), DW_AT_const_value(0x03)
    1864              $C$DW$386       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1865              $C$DW$387       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_MCLKRA"), DW_AT_const_value(0x01)
    1866              $C$DW$388       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_SCITXDB"), DW_AT_const_value(0x02)
    1867              $C$DW$389       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_58_Mode_EPWM7A"), DW_AT_const_value(0x03)
    1868                      .dwendtag $C$DW$T$45
    1869              
    1870              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
    1871                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1872                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1873              $C$DW$390       .dwtag  DW_TAG_TI_far_type
    1874                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$46)
    1875              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1876                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$390)
    1877              
    1878              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   36

    1879                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1880              $C$DW$391       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
    1881              $C$DW$392       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
    1882              $C$DW$393       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
    1883              $C$DW$394       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
    1884                      .dwendtag $C$DW$T$48
    1885              
    1886              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
    1887                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1888                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1889              $C$DW$395       .dwtag  DW_TAG_TI_far_type
    1890                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$49)
    1891              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1892                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$395)
    1893              
    1894              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1895                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    1896                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    1897              $C$DW$396       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    1899                      .dwattr $C$DW$396, DW_AT_name("GPACTRL")
    1900                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_GPACTRL")
    1901                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$397       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    1905                      .dwattr $C$DW$397, DW_AT_name("GPAQSEL1")
    1906                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_GPAQSEL1")
    1907                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1908                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$398       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    1911                      .dwattr $C$DW$398, DW_AT_name("GPAQSEL2")
    1912                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_GPAQSEL2")
    1913                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1914                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$399       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    1917                      .dwattr $C$DW$399, DW_AT_name("GPAMUX1")
    1918                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_GPAMUX1")
    1919                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1920                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$400       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$20)
    1923                      .dwattr $C$DW$400, DW_AT_name("GPAMUX2")
    1924                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_GPAMUX2")
    1925                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1926                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$401       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$20)
    1929                      .dwattr $C$DW$401, DW_AT_name("GPADIR")
    1930                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_GPADIR")
    1931                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1932                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$402       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   37

    1934                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$20)
    1935                      .dwattr $C$DW$402, DW_AT_name("GPAPUD")
    1936                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_GPAPUD")
    1937                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1938                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$403       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    1941                      .dwattr $C$DW$403, DW_AT_name("rsvd_1")
    1942                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_rsvd_1")
    1943                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1944                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$404       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$20)
    1947                      .dwattr $C$DW$404, DW_AT_name("GPBCTRL")
    1948                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_GPBCTRL")
    1949                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1950                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$405       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    1953                      .dwattr $C$DW$405, DW_AT_name("GPBQSEL1")
    1954                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_GPBQSEL1")
    1955                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1956                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$406       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    1959                      .dwattr $C$DW$406, DW_AT_name("GPBQSEL2")
    1960                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_GPBQSEL2")
    1961                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1962                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$407       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$20)
    1965                      .dwattr $C$DW$407, DW_AT_name("GPBMUX1")
    1966                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_GPBMUX1")
    1967                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1968                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$408       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$20)
    1971                      .dwattr $C$DW$408, DW_AT_name("GPBMUX2")
    1972                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_GPBMUX2")
    1973                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1974                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$409       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$20)
    1977                      .dwattr $C$DW$409, DW_AT_name("GPBDIR")
    1978                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_GPBDIR")
    1979                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1980                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$410       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    1983                      .dwattr $C$DW$410, DW_AT_name("GPBPUD")
    1984                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_GPBPUD")
    1985                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1986                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$411       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   38

    1989                      .dwattr $C$DW$411, DW_AT_name("rsvd_4")
    1990                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_rsvd_4")
    1991                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1992                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$412       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    1995                      .dwattr $C$DW$412, DW_AT_name("AIOMUX1")
    1996                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_AIOMUX1")
    1997                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1998                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$413       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
    2001                      .dwattr $C$DW$413, DW_AT_name("rsvd_5")
    2002                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_rsvd_5")
    2003                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2004                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$414       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$20)
    2007                      .dwattr $C$DW$414, DW_AT_name("AIODIR")
    2008                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_AIODIR")
    2009                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2010                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$415       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$25)
    2013                      .dwattr $C$DW$415, DW_AT_name("rsvd_6")
    2014                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_rsvd_6")
    2015                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2016                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$416       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    2019                      .dwattr $C$DW$416, DW_AT_name("GPADAT")
    2020                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_GPADAT")
    2021                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2022                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$417       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    2025                      .dwattr $C$DW$417, DW_AT_name("GPASET")
    2026                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_GPASET")
    2027                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2028                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$418       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    2031                      .dwattr $C$DW$418, DW_AT_name("GPACLEAR")
    2032                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_GPACLEAR")
    2033                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2034                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$419       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    2037                      .dwattr $C$DW$419, DW_AT_name("GPATOGGLE")
    2038                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_GPATOGGLE")
    2039                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2040                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$420       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    2043                      .dwattr $C$DW$420, DW_AT_name("GPBDAT")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   39

    2044                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_GPBDAT")
    2045                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2046                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$421       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    2049                      .dwattr $C$DW$421, DW_AT_name("GPBSET")
    2050                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_GPBSET")
    2051                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2052                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    2053              $C$DW$422       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    2055                      .dwattr $C$DW$422, DW_AT_name("GPBCLEAR")
    2056                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_GPBCLEAR")
    2057                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2058                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$423       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    2061                      .dwattr $C$DW$423, DW_AT_name("GPBTOGGLE")
    2062                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2063                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2064                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$424       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$26)
    2067                      .dwattr $C$DW$424, DW_AT_name("rsvd_7")
    2068                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd_7")
    2069                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2070                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$425       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    2073                      .dwattr $C$DW$425, DW_AT_name("AIODAT")
    2074                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_AIODAT")
    2075                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2076                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$426       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    2079                      .dwattr $C$DW$426, DW_AT_name("AIOSET")
    2080                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_AIOSET")
    2081                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2082                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    2083              $C$DW$427       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    2085                      .dwattr $C$DW$427, DW_AT_name("AIOCLEAR")
    2086                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_AIOCLEAR")
    2087                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2088                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$428       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    2091                      .dwattr $C$DW$428, DW_AT_name("AIOTOGGLE")
    2092                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2093                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2094                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$429       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$27)
    2097                      .dwattr $C$DW$429, DW_AT_name("GPIOXINTnSEL")
    2098                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   40

    2099                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2100                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$430       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$28)
    2103                      .dwattr $C$DW$430, DW_AT_name("rsvd_8")
    2104                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_rsvd_8")
    2105                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2106                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$431       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    2109                      .dwattr $C$DW$431, DW_AT_name("GPIOLPMSEL")
    2110                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2111                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2112                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2113                      .dwendtag $C$DW$T$29
    2114              
    2115              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Obj")
    2116                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    2117                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2118              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2119                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    2120                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2121              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2122                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2123                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2124              $C$DW$432       .dwtag  DW_TAG_TI_far_type
    2125                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$53)
    2126              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2127                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$432)
    2128              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2129                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2130              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2131                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2132                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2133              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2134                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2135                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2136                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2137              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2138                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2139                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2140                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2141              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2142                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2143                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2144                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2145              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2146                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2147                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2148                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2149              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2150                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2151                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2152                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2153              $C$DW$T$9       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:30 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2560410                            PAGE   41

    2154                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2155                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2156                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2157              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2158                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2159                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2160                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2161              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2162                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2163                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
