TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:31 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("PLL_enableClkDetect")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PLL_enableClkDetect")

   10571              $C$DW$T$308     .dwtag  DW_TAG_enumeration_type
   10572                      .dwattr $C$DW$T$308, DW_AT_byte_size(0x01)
   10573              $C$DW$1952      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
   10574              $C$DW$1953      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
   10575                      .dwendtag $C$DW$T$308
   10576              
   10577              $C$DW$T$309     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
   10578                      .dwattr $C$DW$T$309, DW_AT_type(*$C$DW$T$308)
   10579                      .dwattr $C$DW$T$309, DW_AT_language(DW_LANG_C)
   10580              $C$DW$1954      .dwtag  DW_TAG_TI_far_type
   10581                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$309)
   10582              $C$DW$T$310     .dwtag  DW_TAG_const_type
   10583                      .dwattr $C$DW$T$310, DW_AT_type(*$C$DW$1954)
   10584              
   10585              $C$DW$T$311     .dwtag  DW_TAG_enumeration_type
   10586                      .dwattr $C$DW$T$311, DW_AT_byte_size(0x01)
   10587              $C$DW$1955      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
   10588              $C$DW$1956      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
   10589                      .dwendtag $C$DW$T$311
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  204

   10590              
   10591              $C$DW$T$312     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
   10592                      .dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$311)
   10593                      .dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
   10594              $C$DW$1957      .dwtag  DW_TAG_TI_far_type
   10595                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$312)
   10596              $C$DW$T$313     .dwtag  DW_TAG_const_type
   10597                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$1957)
   10598              
   10599              $C$DW$T$314     .dwtag  DW_TAG_enumeration_type
   10600                      .dwattr $C$DW$T$314, DW_AT_byte_size(0x01)
   10601              $C$DW$1958      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
   10602              $C$DW$1959      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
   10603              $C$DW$1960      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
   10604                      .dwendtag $C$DW$T$314
   10605              
   10606              $C$DW$T$315     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
   10607                      .dwattr $C$DW$T$315, DW_AT_type(*$C$DW$T$314)
   10608                      .dwattr $C$DW$T$315, DW_AT_language(DW_LANG_C)
   10609              $C$DW$1961      .dwtag  DW_TAG_TI_far_type
   10610                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$315)
   10611              $C$DW$T$316     .dwtag  DW_TAG_const_type
   10612                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$1961)
   10613              
   10614              $C$DW$T$317     .dwtag  DW_TAG_enumeration_type
   10615                      .dwattr $C$DW$T$317, DW_AT_byte_size(0x01)
   10616              $C$DW$1962      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
   10617              $C$DW$1963      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
   10618              $C$DW$1964      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
   10619                      .dwendtag $C$DW$T$317
   10620              
   10621              $C$DW$T$318     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
   10622                      .dwattr $C$DW$T$318, DW_AT_type(*$C$DW$T$317)
   10623                      .dwattr $C$DW$T$318, DW_AT_language(DW_LANG_C)
   10624              $C$DW$1965      .dwtag  DW_TAG_TI_far_type
   10625                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$318)
   10626              $C$DW$T$319     .dwtag  DW_TAG_const_type
   10627                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$1965)
   10628              
   10629              $C$DW$T$320     .dwtag  DW_TAG_enumeration_type
   10630                      .dwattr $C$DW$T$320, DW_AT_byte_size(0x01)
   10631              $C$DW$1966      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10632              $C$DW$1967      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10633                      .dwendtag $C$DW$T$320
   10634              
   10635              $C$DW$T$321     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10636                      .dwattr $C$DW$T$321, DW_AT_type(*$C$DW$T$320)
   10637                      .dwattr $C$DW$T$321, DW_AT_language(DW_LANG_C)
   10638              
   10639              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   10640                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   10641                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   10642              $C$DW$1968      .dwtag  DW_TAG_member
   10643                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$23)
   10644                      .dwattr $C$DW$1968, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  205

   10645                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_ADCRESULT")
   10646                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10647                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   10648              $C$DW$1969      .dwtag  DW_TAG_member
   10649                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$24)
   10650                      .dwattr $C$DW$1969, DW_AT_name("resvd_1")
   10651                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_resvd_1")
   10652                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10653                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   10654              $C$DW$1970      .dwtag  DW_TAG_member
   10655                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$22)
   10656                      .dwattr $C$DW$1970, DW_AT_name("ADCCTL1")
   10657                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_ADCCTL1")
   10658                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10659                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   10660              $C$DW$1971      .dwtag  DW_TAG_member
   10661                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$22)
   10662                      .dwattr $C$DW$1971, DW_AT_name("ADCCTL2")
   10663                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_ADCCTL2")
   10664                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10665                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   10666              $C$DW$1972      .dwtag  DW_TAG_member
   10667                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$25)
   10668                      .dwattr $C$DW$1972, DW_AT_name("rsvd_2")
   10669                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_rsvd_2")
   10670                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10671                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   10672              $C$DW$1973      .dwtag  DW_TAG_member
   10673                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$22)
   10674                      .dwattr $C$DW$1973, DW_AT_name("ADCINTFLG")
   10675                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_ADCINTFLG")
   10676                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10677                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   10678              $C$DW$1974      .dwtag  DW_TAG_member
   10679                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$22)
   10680                      .dwattr $C$DW$1974, DW_AT_name("ADCINTFLGCLR")
   10681                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10682                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10683                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   10684              $C$DW$1975      .dwtag  DW_TAG_member
   10685                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$22)
   10686                      .dwattr $C$DW$1975, DW_AT_name("ADCINTOVF")
   10687                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_ADCINTOVF")
   10688                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10689                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   10690              $C$DW$1976      .dwtag  DW_TAG_member
   10691                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$22)
   10692                      .dwattr $C$DW$1976, DW_AT_name("ADCINTOVFCLR")
   10693                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10694                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10695                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   10696              $C$DW$1977      .dwtag  DW_TAG_member
   10697                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$26)
   10698                      .dwattr $C$DW$1977, DW_AT_name("INTSELxNy")
   10699                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  206

   10700                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10701                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   10702              $C$DW$1978      .dwtag  DW_TAG_member
   10703                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$27)
   10704                      .dwattr $C$DW$1978, DW_AT_name("rsvd_3")
   10705                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_rsvd_3")
   10706                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10707                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   10708              $C$DW$1979      .dwtag  DW_TAG_member
   10709                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$22)
   10710                      .dwattr $C$DW$1979, DW_AT_name("SOCPRICTRL")
   10711                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10712                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10713                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   10714              $C$DW$1980      .dwtag  DW_TAG_member
   10715                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$22)
   10716                      .dwattr $C$DW$1980, DW_AT_name("rsvd_4")
   10717                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_rsvd_4")
   10718                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10719                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   10720              $C$DW$1981      .dwtag  DW_TAG_member
   10721                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$22)
   10722                      .dwattr $C$DW$1981, DW_AT_name("ADCSAMPLEMODE")
   10723                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10724                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10725                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   10726              $C$DW$1982      .dwtag  DW_TAG_member
   10727                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$22)
   10728                      .dwattr $C$DW$1982, DW_AT_name("rsvd_5")
   10729                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_rsvd_5")
   10730                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10731                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   10732              $C$DW$1983      .dwtag  DW_TAG_member
   10733                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$22)
   10734                      .dwattr $C$DW$1983, DW_AT_name("ADCINTSOCSEL1")
   10735                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10736                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10737                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   10738              $C$DW$1984      .dwtag  DW_TAG_member
   10739                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$22)
   10740                      .dwattr $C$DW$1984, DW_AT_name("ADCINTSOCSEL2")
   10741                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10742                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10743                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   10744              $C$DW$1985      .dwtag  DW_TAG_member
   10745                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$25)
   10746                      .dwattr $C$DW$1985, DW_AT_name("rsvd_6")
   10747                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_rsvd_6")
   10748                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10749                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   10750              $C$DW$1986      .dwtag  DW_TAG_member
   10751                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$22)
   10752                      .dwattr $C$DW$1986, DW_AT_name("ADCSOCFLG1")
   10753                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10754                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  207

   10755                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   10756              $C$DW$1987      .dwtag  DW_TAG_member
   10757                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$22)
   10758                      .dwattr $C$DW$1987, DW_AT_name("rsvd_7")
   10759                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_rsvd_7")
   10760                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10761                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   10762              $C$DW$1988      .dwtag  DW_TAG_member
   10763                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$22)
   10764                      .dwattr $C$DW$1988, DW_AT_name("ADCSOCFRC1")
   10765                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10766                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10767                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   10768              $C$DW$1989      .dwtag  DW_TAG_member
   10769                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$22)
   10770                      .dwattr $C$DW$1989, DW_AT_name("rsvd_8")
   10771                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_rsvd_8")
   10772                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10773                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   10774              $C$DW$1990      .dwtag  DW_TAG_member
   10775                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$22)
   10776                      .dwattr $C$DW$1990, DW_AT_name("ADCSOCOVF1")
   10777                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10778                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10779                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   10780              $C$DW$1991      .dwtag  DW_TAG_member
   10781                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$22)
   10782                      .dwattr $C$DW$1991, DW_AT_name("rsvd_9")
   10783                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_rsvd_9")
   10784                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10785                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   10786              $C$DW$1992      .dwtag  DW_TAG_member
   10787                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$22)
   10788                      .dwattr $C$DW$1992, DW_AT_name("ADCSOCOVFCLR1")
   10789                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10790                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10791                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   10792              $C$DW$1993      .dwtag  DW_TAG_member
   10793                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$22)
   10794                      .dwattr $C$DW$1993, DW_AT_name("rsvd_10")
   10795                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_rsvd_10")
   10796                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10797                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   10798              $C$DW$1994      .dwtag  DW_TAG_member
   10799                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$23)
   10800                      .dwattr $C$DW$1994, DW_AT_name("ADCSOCxCTL")
   10801                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   10802                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10803                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   10804              $C$DW$1995      .dwtag  DW_TAG_member
   10805                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$23)
   10806                      .dwattr $C$DW$1995, DW_AT_name("rsvd_11")
   10807                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_rsvd_11")
   10808                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10809                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  208

   10810              $C$DW$1996      .dwtag  DW_TAG_member
   10811                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$22)
   10812                      .dwattr $C$DW$1996, DW_AT_name("ADCREFTRIM")
   10813                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10814                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10815                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   10816              $C$DW$1997      .dwtag  DW_TAG_member
   10817                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$22)
   10818                      .dwattr $C$DW$1997, DW_AT_name("ADCOFFTRIM")
   10819                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10820                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10821                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   10822              $C$DW$1998      .dwtag  DW_TAG_member
   10823                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$28)
   10824                      .dwattr $C$DW$1998, DW_AT_name("resvd_12")
   10825                      .dwattr $C$DW$1998, DW_AT_TI_symbol_name("_resvd_12")
   10826                      .dwattr $C$DW$1998, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10827                      .dwattr $C$DW$1998, DW_AT_accessibility(DW_ACCESS_public)
   10828              $C$DW$1999      .dwtag  DW_TAG_member
   10829                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$22)
   10830                      .dwattr $C$DW$1999, DW_AT_name("ADCREV")
   10831                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_ADCREV")
   10832                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10833                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   10834                      .dwendtag $C$DW$T$29
   10835              
   10836              $C$DW$T$323     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10837                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$T$29)
   10838                      .dwattr $C$DW$T$323, DW_AT_language(DW_LANG_C)
   10839              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
   10840                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
   10841                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
   10842              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10843                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
   10844                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10845              
   10846              $C$DW$T$31      .dwtag  DW_TAG_structure_type
   10847                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
   10848                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
   10849              $C$DW$2000      .dwtag  DW_TAG_member
   10850                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$22)
   10851                      .dwattr $C$DW$2000, DW_AT_name("XCLK")
   10852                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_XCLK")
   10853                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10854                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   10855              $C$DW$2001      .dwtag  DW_TAG_member
   10856                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$22)
   10857                      .dwattr $C$DW$2001, DW_AT_name("rsvd_1")
   10858                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_rsvd_1")
   10859                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10860                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   10861              $C$DW$2002      .dwtag  DW_TAG_member
   10862                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$22)
   10863                      .dwattr $C$DW$2002, DW_AT_name("CLKCTL")
   10864                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_CLKCTL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  209

   10865                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10866                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   10867              $C$DW$2003      .dwtag  DW_TAG_member
   10868                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$30)
   10869                      .dwattr $C$DW$2003, DW_AT_name("rsvd_2")
   10870                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_rsvd_2")
   10871                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10872                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   10873              $C$DW$2004      .dwtag  DW_TAG_member
   10874                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$22)
   10875                      .dwattr $C$DW$2004, DW_AT_name("LOSPCP")
   10876                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_LOSPCP")
   10877                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10878                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   10879              $C$DW$2005      .dwtag  DW_TAG_member
   10880                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$22)
   10881                      .dwattr $C$DW$2005, DW_AT_name("PCLKCR0")
   10882                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_PCLKCR0")
   10883                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10884                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   10885              $C$DW$2006      .dwtag  DW_TAG_member
   10886                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$22)
   10887                      .dwattr $C$DW$2006, DW_AT_name("PCLKCR1")
   10888                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_PCLKCR1")
   10889                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10890                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   10891              $C$DW$2007      .dwtag  DW_TAG_member
   10892                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$25)
   10893                      .dwattr $C$DW$2007, DW_AT_name("rsvd_3")
   10894                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_rsvd_3")
   10895                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10896                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   10897              $C$DW$2008      .dwtag  DW_TAG_member
   10898                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$22)
   10899                      .dwattr $C$DW$2008, DW_AT_name("PCLKCR3")
   10900                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_PCLKCR3")
   10901                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10902                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   10903                      .dwendtag $C$DW$T$31
   10904              
   10905              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
   10906                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
   10907                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
   10908              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10909                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
   10910                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10911              
   10912              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   10913                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
   10914                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   10915              $C$DW$2009      .dwtag  DW_TAG_member
   10916                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$32)
   10917                      .dwattr $C$DW$2009, DW_AT_name("tmp")
   10918                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_tmp")
   10919                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  210

   10920                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   10921                      .dwendtag $C$DW$T$33
   10922              
   10923              $C$DW$T$332     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10924                      .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$33)
   10925                      .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   10926              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
   10927                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
   10928                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
   10929              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10930                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
   10931                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
   10932              
   10933              $C$DW$T$41      .dwtag  DW_TAG_structure_type
   10934                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
   10935                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
   10936              $C$DW$2010      .dwtag  DW_TAG_member
   10937                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$35)
   10938                      .dwattr $C$DW$2010, DW_AT_name("spiHandle")
   10939                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_spiHandle")
   10940                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10941                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   10942              $C$DW$2011      .dwtag  DW_TAG_member
   10943                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$37)
   10944                      .dwattr $C$DW$2011, DW_AT_name("gpioHandle")
   10945                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_gpioHandle")
   10946                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10947                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   10948              $C$DW$2012      .dwtag  DW_TAG_member
   10949                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$39)
   10950                      .dwattr $C$DW$2012, DW_AT_name("gpioNumber")
   10951                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_gpioNumber")
   10952                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10953                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   10954              $C$DW$2013      .dwtag  DW_TAG_member
   10955                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$40)
   10956                      .dwattr $C$DW$2013, DW_AT_name("RxTimeOut")
   10957                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_RxTimeOut")
   10958                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10959                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   10960              $C$DW$2014      .dwtag  DW_TAG_member
   10961                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$40)
   10962                      .dwattr $C$DW$2014, DW_AT_name("enableTimeOut")
   10963                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_enableTimeOut")
   10964                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10965                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   10966                      .dwendtag $C$DW$T$41
   10967              
   10968              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   10969                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$41)
   10970                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
   10971              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
   10972                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$41)
   10973                      .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
   10974              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  211

   10975                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
   10976                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   10977              
   10978              $C$DW$T$52      .dwtag  DW_TAG_structure_type
   10979                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10980                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
   10981              $C$DW$2015      .dwtag  DW_TAG_member
   10982                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$43)
   10983                      .dwattr $C$DW$2015, DW_AT_name("DRV8301_CURRENT")
   10984                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10985                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10986                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   10987              $C$DW$2016      .dwtag  DW_TAG_member
   10988                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$45)
   10989                      .dwattr $C$DW$2016, DW_AT_name("DRV8301_RESET")
   10990                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10991                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10992                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   10993              $C$DW$2017      .dwtag  DW_TAG_member
   10994                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$47)
   10995                      .dwattr $C$DW$2017, DW_AT_name("PWM_MODE")
   10996                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_PWM_MODE")
   10997                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10998                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   10999              $C$DW$2018      .dwtag  DW_TAG_member
   11000                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$49)
   11001                      .dwattr $C$DW$2018, DW_AT_name("OC_MODE")
   11002                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_OC_MODE")
   11003                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11004                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   11005              $C$DW$2019      .dwtag  DW_TAG_member
   11006                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$51)
   11007                      .dwattr $C$DW$2019, DW_AT_name("OC_ADJ_SET")
   11008                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   11009                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11010                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   11011                      .dwendtag $C$DW$T$52
   11012              
   11013              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   11014                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
   11015                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
   11016              
   11017              $C$DW$T$61      .dwtag  DW_TAG_structure_type
   11018                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   11019                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
   11020              $C$DW$2020      .dwtag  DW_TAG_member
   11021                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$54)
   11022                      .dwattr $C$DW$2020, DW_AT_name("OCTW_SET")
   11023                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_OCTW_SET")
   11024                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11025                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   11026              $C$DW$2021      .dwtag  DW_TAG_member
   11027                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$56)
   11028                      .dwattr $C$DW$2021, DW_AT_name("GAIN")
   11029                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_GAIN")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  212

   11030                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11031                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   11032              $C$DW$2022      .dwtag  DW_TAG_member
   11033                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$58)
   11034                      .dwattr $C$DW$2022, DW_AT_name("DC_CAL_CH1p2")
   11035                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   11036                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11037                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   11038              $C$DW$2023      .dwtag  DW_TAG_member
   11039                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$60)
   11040                      .dwattr $C$DW$2023, DW_AT_name("OC_TOFF")
   11041                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_OC_TOFF")
   11042                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11043                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   11044                      .dwendtag $C$DW$T$61
   11045              
   11046              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   11047                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
   11048                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
   11049              
   11050              $C$DW$T$62      .dwtag  DW_TAG_structure_type
   11051                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   11052                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
   11053              $C$DW$2024      .dwtag  DW_TAG_member
   11054                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$40)
   11055                      .dwattr $C$DW$2024, DW_AT_name("FAULT")
   11056                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_FAULT")
   11057                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11058                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   11059              $C$DW$2025      .dwtag  DW_TAG_member
   11060                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$40)
   11061                      .dwattr $C$DW$2025, DW_AT_name("GVDD_UV")
   11062                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_GVDD_UV")
   11063                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11064                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   11065              $C$DW$2026      .dwtag  DW_TAG_member
   11066                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$40)
   11067                      .dwattr $C$DW$2026, DW_AT_name("PVDD_UV")
   11068                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_PVDD_UV")
   11069                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11070                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   11071              $C$DW$2027      .dwtag  DW_TAG_member
   11072                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$40)
   11073                      .dwattr $C$DW$2027, DW_AT_name("OTSD")
   11074                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_OTSD")
   11075                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11076                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
   11077              $C$DW$2028      .dwtag  DW_TAG_member
   11078                      .dwattr $C$DW$2028, DW_AT_type(*$C$DW$T$40)
   11079                      .dwattr $C$DW$2028, DW_AT_name("OTW")
   11080                      .dwattr $C$DW$2028, DW_AT_TI_symbol_name("_OTW")
   11081                      .dwattr $C$DW$2028, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11082                      .dwattr $C$DW$2028, DW_AT_accessibility(DW_ACCESS_public)
   11083              $C$DW$2029      .dwtag  DW_TAG_member
   11084                      .dwattr $C$DW$2029, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  213

   11085                      .dwattr $C$DW$2029, DW_AT_name("FETHA_OC")
   11086                      .dwattr $C$DW$2029, DW_AT_TI_symbol_name("_FETHA_OC")
   11087                      .dwattr $C$DW$2029, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11088                      .dwattr $C$DW$2029, DW_AT_accessibility(DW_ACCESS_public)
   11089              $C$DW$2030      .dwtag  DW_TAG_member
   11090                      .dwattr $C$DW$2030, DW_AT_type(*$C$DW$T$40)
   11091                      .dwattr $C$DW$2030, DW_AT_name("FETLA_OC")
   11092                      .dwattr $C$DW$2030, DW_AT_TI_symbol_name("_FETLA_OC")
   11093                      .dwattr $C$DW$2030, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11094                      .dwattr $C$DW$2030, DW_AT_accessibility(DW_ACCESS_public)
   11095              $C$DW$2031      .dwtag  DW_TAG_member
   11096                      .dwattr $C$DW$2031, DW_AT_type(*$C$DW$T$40)
   11097                      .dwattr $C$DW$2031, DW_AT_name("FETHB_OC")
   11098                      .dwattr $C$DW$2031, DW_AT_TI_symbol_name("_FETHB_OC")
   11099                      .dwattr $C$DW$2031, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11100                      .dwattr $C$DW$2031, DW_AT_accessibility(DW_ACCESS_public)
   11101              $C$DW$2032      .dwtag  DW_TAG_member
   11102                      .dwattr $C$DW$2032, DW_AT_type(*$C$DW$T$40)
   11103                      .dwattr $C$DW$2032, DW_AT_name("FETLB_OC")
   11104                      .dwattr $C$DW$2032, DW_AT_TI_symbol_name("_FETLB_OC")
   11105                      .dwattr $C$DW$2032, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11106                      .dwattr $C$DW$2032, DW_AT_accessibility(DW_ACCESS_public)
   11107              $C$DW$2033      .dwtag  DW_TAG_member
   11108                      .dwattr $C$DW$2033, DW_AT_type(*$C$DW$T$40)
   11109                      .dwattr $C$DW$2033, DW_AT_name("FETHC_OC")
   11110                      .dwattr $C$DW$2033, DW_AT_TI_symbol_name("_FETHC_OC")
   11111                      .dwattr $C$DW$2033, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11112                      .dwattr $C$DW$2033, DW_AT_accessibility(DW_ACCESS_public)
   11113              $C$DW$2034      .dwtag  DW_TAG_member
   11114                      .dwattr $C$DW$2034, DW_AT_type(*$C$DW$T$40)
   11115                      .dwattr $C$DW$2034, DW_AT_name("FETLC_OC")
   11116                      .dwattr $C$DW$2034, DW_AT_TI_symbol_name("_FETLC_OC")
   11117                      .dwattr $C$DW$2034, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11118                      .dwattr $C$DW$2034, DW_AT_accessibility(DW_ACCESS_public)
   11119                      .dwendtag $C$DW$T$62
   11120              
   11121              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   11122                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
   11123                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
   11124              
   11125              $C$DW$T$63      .dwtag  DW_TAG_structure_type
   11126                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   11127                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
   11128              $C$DW$2035      .dwtag  DW_TAG_member
   11129                      .dwattr $C$DW$2035, DW_AT_type(*$C$DW$T$40)
   11130                      .dwattr $C$DW$2035, DW_AT_name("GVDD_OV")
   11131                      .dwattr $C$DW$2035, DW_AT_TI_symbol_name("_GVDD_OV")
   11132                      .dwattr $C$DW$2035, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11133                      .dwattr $C$DW$2035, DW_AT_accessibility(DW_ACCESS_public)
   11134              $C$DW$2036      .dwtag  DW_TAG_member
   11135                      .dwattr $C$DW$2036, DW_AT_type(*$C$DW$T$21)
   11136                      .dwattr $C$DW$2036, DW_AT_name("DeviceID")
   11137                      .dwattr $C$DW$2036, DW_AT_TI_symbol_name("_DeviceID")
   11138                      .dwattr $C$DW$2036, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11139                      .dwattr $C$DW$2036, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  214

   11140                      .dwendtag $C$DW$T$63
   11141              
   11142              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   11143                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
   11144                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
   11145              
   11146              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   11147                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   11148                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
   11149              $C$DW$2037      .dwtag  DW_TAG_member
   11150                      .dwattr $C$DW$2037, DW_AT_type(*$C$DW$T$64)
   11151                      .dwattr $C$DW$2037, DW_AT_name("Stat_Reg_1")
   11152                      .dwattr $C$DW$2037, DW_AT_TI_symbol_name("_Stat_Reg_1")
   11153                      .dwattr $C$DW$2037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11154                      .dwattr $C$DW$2037, DW_AT_accessibility(DW_ACCESS_public)
   11155              $C$DW$2038      .dwtag  DW_TAG_member
   11156                      .dwattr $C$DW$2038, DW_AT_type(*$C$DW$T$65)
   11157                      .dwattr $C$DW$2038, DW_AT_name("Stat_Reg_2")
   11158                      .dwattr $C$DW$2038, DW_AT_TI_symbol_name("_Stat_Reg_2")
   11159                      .dwattr $C$DW$2038, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11160                      .dwattr $C$DW$2038, DW_AT_accessibility(DW_ACCESS_public)
   11161              $C$DW$2039      .dwtag  DW_TAG_member
   11162                      .dwattr $C$DW$2039, DW_AT_type(*$C$DW$T$66)
   11163                      .dwattr $C$DW$2039, DW_AT_name("Ctrl_Reg_1")
   11164                      .dwattr $C$DW$2039, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   11165                      .dwattr $C$DW$2039, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11166                      .dwattr $C$DW$2039, DW_AT_accessibility(DW_ACCESS_public)
   11167              $C$DW$2040      .dwtag  DW_TAG_member
   11168                      .dwattr $C$DW$2040, DW_AT_type(*$C$DW$T$67)
   11169                      .dwattr $C$DW$2040, DW_AT_name("Ctrl_Reg_2")
   11170                      .dwattr $C$DW$2040, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   11171                      .dwattr $C$DW$2040, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11172                      .dwattr $C$DW$2040, DW_AT_accessibility(DW_ACCESS_public)
   11173              $C$DW$2041      .dwtag  DW_TAG_member
   11174                      .dwattr $C$DW$2041, DW_AT_type(*$C$DW$T$40)
   11175                      .dwattr $C$DW$2041, DW_AT_name("SndCmd")
   11176                      .dwattr $C$DW$2041, DW_AT_TI_symbol_name("_SndCmd")
   11177                      .dwattr $C$DW$2041, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11178                      .dwattr $C$DW$2041, DW_AT_accessibility(DW_ACCESS_public)
   11179              $C$DW$2042      .dwtag  DW_TAG_member
   11180                      .dwattr $C$DW$2042, DW_AT_type(*$C$DW$T$40)
   11181                      .dwattr $C$DW$2042, DW_AT_name("RcvCmd")
   11182                      .dwattr $C$DW$2042, DW_AT_TI_symbol_name("_RcvCmd")
   11183                      .dwattr $C$DW$2042, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   11184                      .dwattr $C$DW$2042, DW_AT_accessibility(DW_ACCESS_public)
   11185                      .dwendtag $C$DW$T$68
   11186              
   11187              $C$DW$T$339     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   11188                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$68)
   11189                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   11190              $C$DW$T$340     .dwtag  DW_TAG_pointer_type
   11191                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$T$339)
   11192                      .dwattr $C$DW$T$340, DW_AT_address_class(0x20)
   11193              
   11194              $C$DW$T$70      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  215

   11195                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
   11196                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
   11197              $C$DW$2043      .dwtag  DW_TAG_member
   11198                      .dwattr $C$DW$2043, DW_AT_type(*$C$DW$T$69)
   11199                      .dwattr $C$DW$2043, DW_AT_name("a1")
   11200                      .dwattr $C$DW$2043, DW_AT_TI_symbol_name("_a1")
   11201                      .dwattr $C$DW$2043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11202                      .dwattr $C$DW$2043, DW_AT_accessibility(DW_ACCESS_public)
   11203              $C$DW$2044      .dwtag  DW_TAG_member
   11204                      .dwattr $C$DW$2044, DW_AT_type(*$C$DW$T$69)
   11205                      .dwattr $C$DW$2044, DW_AT_name("b0")
   11206                      .dwattr $C$DW$2044, DW_AT_TI_symbol_name("_b0")
   11207                      .dwattr $C$DW$2044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11208                      .dwattr $C$DW$2044, DW_AT_accessibility(DW_ACCESS_public)
   11209              $C$DW$2045      .dwtag  DW_TAG_member
   11210                      .dwattr $C$DW$2045, DW_AT_type(*$C$DW$T$69)
   11211                      .dwattr $C$DW$2045, DW_AT_name("b1")
   11212                      .dwattr $C$DW$2045, DW_AT_TI_symbol_name("_b1")
   11213                      .dwattr $C$DW$2045, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11214                      .dwattr $C$DW$2045, DW_AT_accessibility(DW_ACCESS_public)
   11215              $C$DW$2046      .dwtag  DW_TAG_member
   11216                      .dwattr $C$DW$2046, DW_AT_type(*$C$DW$T$69)
   11217                      .dwattr $C$DW$2046, DW_AT_name("x1")
   11218                      .dwattr $C$DW$2046, DW_AT_TI_symbol_name("_x1")
   11219                      .dwattr $C$DW$2046, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11220                      .dwattr $C$DW$2046, DW_AT_accessibility(DW_ACCESS_public)
   11221              $C$DW$2047      .dwtag  DW_TAG_member
   11222                      .dwattr $C$DW$2047, DW_AT_type(*$C$DW$T$69)
   11223                      .dwattr $C$DW$2047, DW_AT_name("y1")
   11224                      .dwattr $C$DW$2047, DW_AT_TI_symbol_name("_y1")
   11225                      .dwattr $C$DW$2047, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11226                      .dwattr $C$DW$2047, DW_AT_accessibility(DW_ACCESS_public)
   11227                      .dwendtag $C$DW$T$70
   11228              
   11229              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   11230                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$70)
   11231                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
   11232              
   11233              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   11234                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   11235                      .dwattr $C$DW$T$19, DW_AT_declaration
   11236                      .dwendtag $C$DW$T$19
   11237              
   11238              $C$DW$T$116     .dwtag  DW_TAG_pointer_type
   11239                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$19)
   11240                      .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
   11241              $C$DW$T$117     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   11242                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$116)
   11243                      .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
   11244              
   11245              $C$DW$T$71      .dwtag  DW_TAG_structure_type
   11246                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
   11247                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
   11248              $C$DW$2048      .dwtag  DW_TAG_member
   11249                      .dwattr $C$DW$2048, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  216

   11250                      .dwattr $C$DW$2048, DW_AT_name("FOPT")
   11251                      .dwattr $C$DW$2048, DW_AT_TI_symbol_name("_FOPT")
   11252                      .dwattr $C$DW$2048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11253                      .dwattr $C$DW$2048, DW_AT_accessibility(DW_ACCESS_public)
   11254              $C$DW$2049      .dwtag  DW_TAG_member
   11255                      .dwattr $C$DW$2049, DW_AT_type(*$C$DW$T$22)
   11256                      .dwattr $C$DW$2049, DW_AT_name("rsvd_1")
   11257                      .dwattr $C$DW$2049, DW_AT_TI_symbol_name("_rsvd_1")
   11258                      .dwattr $C$DW$2049, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11259                      .dwattr $C$DW$2049, DW_AT_accessibility(DW_ACCESS_public)
   11260              $C$DW$2050      .dwtag  DW_TAG_member
   11261                      .dwattr $C$DW$2050, DW_AT_type(*$C$DW$T$22)
   11262                      .dwattr $C$DW$2050, DW_AT_name("FPWR")
   11263                      .dwattr $C$DW$2050, DW_AT_TI_symbol_name("_FPWR")
   11264                      .dwattr $C$DW$2050, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11265                      .dwattr $C$DW$2050, DW_AT_accessibility(DW_ACCESS_public)
   11266              $C$DW$2051      .dwtag  DW_TAG_member
   11267                      .dwattr $C$DW$2051, DW_AT_type(*$C$DW$T$22)
   11268                      .dwattr $C$DW$2051, DW_AT_name("FSTATUS")
   11269                      .dwattr $C$DW$2051, DW_AT_TI_symbol_name("_FSTATUS")
   11270                      .dwattr $C$DW$2051, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11271                      .dwattr $C$DW$2051, DW_AT_accessibility(DW_ACCESS_public)
   11272              $C$DW$2052      .dwtag  DW_TAG_member
   11273                      .dwattr $C$DW$2052, DW_AT_type(*$C$DW$T$22)
   11274                      .dwattr $C$DW$2052, DW_AT_name("FSTDBYWAIT")
   11275                      .dwattr $C$DW$2052, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   11276                      .dwattr $C$DW$2052, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11277                      .dwattr $C$DW$2052, DW_AT_accessibility(DW_ACCESS_public)
   11278              $C$DW$2053      .dwtag  DW_TAG_member
   11279                      .dwattr $C$DW$2053, DW_AT_type(*$C$DW$T$22)
   11280                      .dwattr $C$DW$2053, DW_AT_name("FACTIVEWAIT")
   11281                      .dwattr $C$DW$2053, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   11282                      .dwattr $C$DW$2053, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11283                      .dwattr $C$DW$2053, DW_AT_accessibility(DW_ACCESS_public)
   11284              $C$DW$2054      .dwtag  DW_TAG_member
   11285                      .dwattr $C$DW$2054, DW_AT_type(*$C$DW$T$22)
   11286                      .dwattr $C$DW$2054, DW_AT_name("FBANKWAIT")
   11287                      .dwattr $C$DW$2054, DW_AT_TI_symbol_name("_FBANKWAIT")
   11288                      .dwattr $C$DW$2054, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11289                      .dwattr $C$DW$2054, DW_AT_accessibility(DW_ACCESS_public)
   11290              $C$DW$2055      .dwtag  DW_TAG_member
   11291                      .dwattr $C$DW$2055, DW_AT_type(*$C$DW$T$22)
   11292                      .dwattr $C$DW$2055, DW_AT_name("FOTPWAIT")
   11293                      .dwattr $C$DW$2055, DW_AT_TI_symbol_name("_FOTPWAIT")
   11294                      .dwattr $C$DW$2055, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11295                      .dwattr $C$DW$2055, DW_AT_accessibility(DW_ACCESS_public)
   11296                      .dwendtag $C$DW$T$71
   11297              
   11298              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   11299                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
   11300                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   11301              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   11302                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   11303                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   11304              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  217

   11305              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   11306                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   11307                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   11308              $C$DW$2056      .dwtag  DW_TAG_member
   11309                      .dwattr $C$DW$2056, DW_AT_type(*$C$DW$T$73)
   11310                      .dwattr $C$DW$2056, DW_AT_name("GPACTRL")
   11311                      .dwattr $C$DW$2056, DW_AT_TI_symbol_name("_GPACTRL")
   11312                      .dwattr $C$DW$2056, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11313                      .dwattr $C$DW$2056, DW_AT_accessibility(DW_ACCESS_public)
   11314              $C$DW$2057      .dwtag  DW_TAG_member
   11315                      .dwattr $C$DW$2057, DW_AT_type(*$C$DW$T$73)
   11316                      .dwattr $C$DW$2057, DW_AT_name("GPAQSEL1")
   11317                      .dwattr $C$DW$2057, DW_AT_TI_symbol_name("_GPAQSEL1")
   11318                      .dwattr $C$DW$2057, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11319                      .dwattr $C$DW$2057, DW_AT_accessibility(DW_ACCESS_public)
   11320              $C$DW$2058      .dwtag  DW_TAG_member
   11321                      .dwattr $C$DW$2058, DW_AT_type(*$C$DW$T$73)
   11322                      .dwattr $C$DW$2058, DW_AT_name("GPAQSEL2")
   11323                      .dwattr $C$DW$2058, DW_AT_TI_symbol_name("_GPAQSEL2")
   11324                      .dwattr $C$DW$2058, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11325                      .dwattr $C$DW$2058, DW_AT_accessibility(DW_ACCESS_public)
   11326              $C$DW$2059      .dwtag  DW_TAG_member
   11327                      .dwattr $C$DW$2059, DW_AT_type(*$C$DW$T$73)
   11328                      .dwattr $C$DW$2059, DW_AT_name("GPAMUX1")
   11329                      .dwattr $C$DW$2059, DW_AT_TI_symbol_name("_GPAMUX1")
   11330                      .dwattr $C$DW$2059, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11331                      .dwattr $C$DW$2059, DW_AT_accessibility(DW_ACCESS_public)
   11332              $C$DW$2060      .dwtag  DW_TAG_member
   11333                      .dwattr $C$DW$2060, DW_AT_type(*$C$DW$T$73)
   11334                      .dwattr $C$DW$2060, DW_AT_name("GPAMUX2")
   11335                      .dwattr $C$DW$2060, DW_AT_TI_symbol_name("_GPAMUX2")
   11336                      .dwattr $C$DW$2060, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11337                      .dwattr $C$DW$2060, DW_AT_accessibility(DW_ACCESS_public)
   11338              $C$DW$2061      .dwtag  DW_TAG_member
   11339                      .dwattr $C$DW$2061, DW_AT_type(*$C$DW$T$73)
   11340                      .dwattr $C$DW$2061, DW_AT_name("GPADIR")
   11341                      .dwattr $C$DW$2061, DW_AT_TI_symbol_name("_GPADIR")
   11342                      .dwattr $C$DW$2061, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11343                      .dwattr $C$DW$2061, DW_AT_accessibility(DW_ACCESS_public)
   11344              $C$DW$2062      .dwtag  DW_TAG_member
   11345                      .dwattr $C$DW$2062, DW_AT_type(*$C$DW$T$73)
   11346                      .dwattr $C$DW$2062, DW_AT_name("GPAPUD")
   11347                      .dwattr $C$DW$2062, DW_AT_TI_symbol_name("_GPAPUD")
   11348                      .dwattr $C$DW$2062, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11349                      .dwattr $C$DW$2062, DW_AT_accessibility(DW_ACCESS_public)
   11350              $C$DW$2063      .dwtag  DW_TAG_member
   11351                      .dwattr $C$DW$2063, DW_AT_type(*$C$DW$T$25)
   11352                      .dwattr $C$DW$2063, DW_AT_name("rsvd_1")
   11353                      .dwattr $C$DW$2063, DW_AT_TI_symbol_name("_rsvd_1")
   11354                      .dwattr $C$DW$2063, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11355                      .dwattr $C$DW$2063, DW_AT_accessibility(DW_ACCESS_public)
   11356              $C$DW$2064      .dwtag  DW_TAG_member
   11357                      .dwattr $C$DW$2064, DW_AT_type(*$C$DW$T$73)
   11358                      .dwattr $C$DW$2064, DW_AT_name("GPBCTRL")
   11359                      .dwattr $C$DW$2064, DW_AT_TI_symbol_name("_GPBCTRL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  218

   11360                      .dwattr $C$DW$2064, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11361                      .dwattr $C$DW$2064, DW_AT_accessibility(DW_ACCESS_public)
   11362              $C$DW$2065      .dwtag  DW_TAG_member
   11363                      .dwattr $C$DW$2065, DW_AT_type(*$C$DW$T$73)
   11364                      .dwattr $C$DW$2065, DW_AT_name("GPBQSEL1")
   11365                      .dwattr $C$DW$2065, DW_AT_TI_symbol_name("_GPBQSEL1")
   11366                      .dwattr $C$DW$2065, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11367                      .dwattr $C$DW$2065, DW_AT_accessibility(DW_ACCESS_public)
   11368              $C$DW$2066      .dwtag  DW_TAG_member
   11369                      .dwattr $C$DW$2066, DW_AT_type(*$C$DW$T$73)
   11370                      .dwattr $C$DW$2066, DW_AT_name("GPBQSEL2")
   11371                      .dwattr $C$DW$2066, DW_AT_TI_symbol_name("_GPBQSEL2")
   11372                      .dwattr $C$DW$2066, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11373                      .dwattr $C$DW$2066, DW_AT_accessibility(DW_ACCESS_public)
   11374              $C$DW$2067      .dwtag  DW_TAG_member
   11375                      .dwattr $C$DW$2067, DW_AT_type(*$C$DW$T$73)
   11376                      .dwattr $C$DW$2067, DW_AT_name("GPBMUX1")
   11377                      .dwattr $C$DW$2067, DW_AT_TI_symbol_name("_GPBMUX1")
   11378                      .dwattr $C$DW$2067, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11379                      .dwattr $C$DW$2067, DW_AT_accessibility(DW_ACCESS_public)
   11380              $C$DW$2068      .dwtag  DW_TAG_member
   11381                      .dwattr $C$DW$2068, DW_AT_type(*$C$DW$T$73)
   11382                      .dwattr $C$DW$2068, DW_AT_name("GPBMUX2")
   11383                      .dwattr $C$DW$2068, DW_AT_TI_symbol_name("_GPBMUX2")
   11384                      .dwattr $C$DW$2068, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11385                      .dwattr $C$DW$2068, DW_AT_accessibility(DW_ACCESS_public)
   11386              $C$DW$2069      .dwtag  DW_TAG_member
   11387                      .dwattr $C$DW$2069, DW_AT_type(*$C$DW$T$73)
   11388                      .dwattr $C$DW$2069, DW_AT_name("GPBDIR")
   11389                      .dwattr $C$DW$2069, DW_AT_TI_symbol_name("_GPBDIR")
   11390                      .dwattr $C$DW$2069, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11391                      .dwattr $C$DW$2069, DW_AT_accessibility(DW_ACCESS_public)
   11392              $C$DW$2070      .dwtag  DW_TAG_member
   11393                      .dwattr $C$DW$2070, DW_AT_type(*$C$DW$T$73)
   11394                      .dwattr $C$DW$2070, DW_AT_name("GPBPUD")
   11395                      .dwattr $C$DW$2070, DW_AT_TI_symbol_name("_GPBPUD")
   11396                      .dwattr $C$DW$2070, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11397                      .dwattr $C$DW$2070, DW_AT_accessibility(DW_ACCESS_public)
   11398              $C$DW$2071      .dwtag  DW_TAG_member
   11399                      .dwattr $C$DW$2071, DW_AT_type(*$C$DW$T$74)
   11400                      .dwattr $C$DW$2071, DW_AT_name("rsvd_4")
   11401                      .dwattr $C$DW$2071, DW_AT_TI_symbol_name("_rsvd_4")
   11402                      .dwattr $C$DW$2071, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11403                      .dwattr $C$DW$2071, DW_AT_accessibility(DW_ACCESS_public)
   11404              $C$DW$2072      .dwtag  DW_TAG_member
   11405                      .dwattr $C$DW$2072, DW_AT_type(*$C$DW$T$73)
   11406                      .dwattr $C$DW$2072, DW_AT_name("AIOMUX1")
   11407                      .dwattr $C$DW$2072, DW_AT_TI_symbol_name("_AIOMUX1")
   11408                      .dwattr $C$DW$2072, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11409                      .dwattr $C$DW$2072, DW_AT_accessibility(DW_ACCESS_public)
   11410              $C$DW$2073      .dwtag  DW_TAG_member
   11411                      .dwattr $C$DW$2073, DW_AT_type(*$C$DW$T$25)
   11412                      .dwattr $C$DW$2073, DW_AT_name("rsvd_5")
   11413                      .dwattr $C$DW$2073, DW_AT_TI_symbol_name("_rsvd_5")
   11414                      .dwattr $C$DW$2073, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  219

   11415                      .dwattr $C$DW$2073, DW_AT_accessibility(DW_ACCESS_public)
   11416              $C$DW$2074      .dwtag  DW_TAG_member
   11417                      .dwattr $C$DW$2074, DW_AT_type(*$C$DW$T$73)
   11418                      .dwattr $C$DW$2074, DW_AT_name("AIODIR")
   11419                      .dwattr $C$DW$2074, DW_AT_TI_symbol_name("_AIODIR")
   11420                      .dwattr $C$DW$2074, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11421                      .dwattr $C$DW$2074, DW_AT_accessibility(DW_ACCESS_public)
   11422              $C$DW$2075      .dwtag  DW_TAG_member
   11423                      .dwattr $C$DW$2075, DW_AT_type(*$C$DW$T$75)
   11424                      .dwattr $C$DW$2075, DW_AT_name("rsvd_6")
   11425                      .dwattr $C$DW$2075, DW_AT_TI_symbol_name("_rsvd_6")
   11426                      .dwattr $C$DW$2075, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   11427                      .dwattr $C$DW$2075, DW_AT_accessibility(DW_ACCESS_public)
   11428              $C$DW$2076      .dwtag  DW_TAG_member
   11429                      .dwattr $C$DW$2076, DW_AT_type(*$C$DW$T$73)
   11430                      .dwattr $C$DW$2076, DW_AT_name("GPADAT")
   11431                      .dwattr $C$DW$2076, DW_AT_TI_symbol_name("_GPADAT")
   11432                      .dwattr $C$DW$2076, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11433                      .dwattr $C$DW$2076, DW_AT_accessibility(DW_ACCESS_public)
   11434              $C$DW$2077      .dwtag  DW_TAG_member
   11435                      .dwattr $C$DW$2077, DW_AT_type(*$C$DW$T$73)
   11436                      .dwattr $C$DW$2077, DW_AT_name("GPASET")
   11437                      .dwattr $C$DW$2077, DW_AT_TI_symbol_name("_GPASET")
   11438                      .dwattr $C$DW$2077, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   11439                      .dwattr $C$DW$2077, DW_AT_accessibility(DW_ACCESS_public)
   11440              $C$DW$2078      .dwtag  DW_TAG_member
   11441                      .dwattr $C$DW$2078, DW_AT_type(*$C$DW$T$73)
   11442                      .dwattr $C$DW$2078, DW_AT_name("GPACLEAR")
   11443                      .dwattr $C$DW$2078, DW_AT_TI_symbol_name("_GPACLEAR")
   11444                      .dwattr $C$DW$2078, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   11445                      .dwattr $C$DW$2078, DW_AT_accessibility(DW_ACCESS_public)
   11446              $C$DW$2079      .dwtag  DW_TAG_member
   11447                      .dwattr $C$DW$2079, DW_AT_type(*$C$DW$T$73)
   11448                      .dwattr $C$DW$2079, DW_AT_name("GPATOGGLE")
   11449                      .dwattr $C$DW$2079, DW_AT_TI_symbol_name("_GPATOGGLE")
   11450                      .dwattr $C$DW$2079, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11451                      .dwattr $C$DW$2079, DW_AT_accessibility(DW_ACCESS_public)
   11452              $C$DW$2080      .dwtag  DW_TAG_member
   11453                      .dwattr $C$DW$2080, DW_AT_type(*$C$DW$T$73)
   11454                      .dwattr $C$DW$2080, DW_AT_name("GPBDAT")
   11455                      .dwattr $C$DW$2080, DW_AT_TI_symbol_name("_GPBDAT")
   11456                      .dwattr $C$DW$2080, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   11457                      .dwattr $C$DW$2080, DW_AT_accessibility(DW_ACCESS_public)
   11458              $C$DW$2081      .dwtag  DW_TAG_member
   11459                      .dwattr $C$DW$2081, DW_AT_type(*$C$DW$T$73)
   11460                      .dwattr $C$DW$2081, DW_AT_name("GPBSET")
   11461                      .dwattr $C$DW$2081, DW_AT_TI_symbol_name("_GPBSET")
   11462                      .dwattr $C$DW$2081, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11463                      .dwattr $C$DW$2081, DW_AT_accessibility(DW_ACCESS_public)
   11464              $C$DW$2082      .dwtag  DW_TAG_member
   11465                      .dwattr $C$DW$2082, DW_AT_type(*$C$DW$T$73)
   11466                      .dwattr $C$DW$2082, DW_AT_name("GPBCLEAR")
   11467                      .dwattr $C$DW$2082, DW_AT_TI_symbol_name("_GPBCLEAR")
   11468                      .dwattr $C$DW$2082, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   11469                      .dwattr $C$DW$2082, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  220

   11470              $C$DW$2083      .dwtag  DW_TAG_member
   11471                      .dwattr $C$DW$2083, DW_AT_type(*$C$DW$T$73)
   11472                      .dwattr $C$DW$2083, DW_AT_name("GPBTOGGLE")
   11473                      .dwattr $C$DW$2083, DW_AT_TI_symbol_name("_GPBTOGGLE")
   11474                      .dwattr $C$DW$2083, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11475                      .dwattr $C$DW$2083, DW_AT_accessibility(DW_ACCESS_public)
   11476              $C$DW$2084      .dwtag  DW_TAG_member
   11477                      .dwattr $C$DW$2084, DW_AT_type(*$C$DW$T$30)
   11478                      .dwattr $C$DW$2084, DW_AT_name("rsvd_7")
   11479                      .dwattr $C$DW$2084, DW_AT_TI_symbol_name("_rsvd_7")
   11480                      .dwattr $C$DW$2084, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   11481                      .dwattr $C$DW$2084, DW_AT_accessibility(DW_ACCESS_public)
   11482              $C$DW$2085      .dwtag  DW_TAG_member
   11483                      .dwattr $C$DW$2085, DW_AT_type(*$C$DW$T$73)
   11484                      .dwattr $C$DW$2085, DW_AT_name("AIODAT")
   11485                      .dwattr $C$DW$2085, DW_AT_TI_symbol_name("_AIODAT")
   11486                      .dwattr $C$DW$2085, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   11487                      .dwattr $C$DW$2085, DW_AT_accessibility(DW_ACCESS_public)
   11488              $C$DW$2086      .dwtag  DW_TAG_member
   11489                      .dwattr $C$DW$2086, DW_AT_type(*$C$DW$T$73)
   11490                      .dwattr $C$DW$2086, DW_AT_name("AIOSET")
   11491                      .dwattr $C$DW$2086, DW_AT_TI_symbol_name("_AIOSET")
   11492                      .dwattr $C$DW$2086, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11493                      .dwattr $C$DW$2086, DW_AT_accessibility(DW_ACCESS_public)
   11494              $C$DW$2087      .dwtag  DW_TAG_member
   11495                      .dwattr $C$DW$2087, DW_AT_type(*$C$DW$T$73)
   11496                      .dwattr $C$DW$2087, DW_AT_name("AIOCLEAR")
   11497                      .dwattr $C$DW$2087, DW_AT_TI_symbol_name("_AIOCLEAR")
   11498                      .dwattr $C$DW$2087, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   11499                      .dwattr $C$DW$2087, DW_AT_accessibility(DW_ACCESS_public)
   11500              $C$DW$2088      .dwtag  DW_TAG_member
   11501                      .dwattr $C$DW$2088, DW_AT_type(*$C$DW$T$73)
   11502                      .dwattr $C$DW$2088, DW_AT_name("AIOTOGGLE")
   11503                      .dwattr $C$DW$2088, DW_AT_TI_symbol_name("_AIOTOGGLE")
   11504                      .dwattr $C$DW$2088, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11505                      .dwattr $C$DW$2088, DW_AT_accessibility(DW_ACCESS_public)
   11506              $C$DW$2089      .dwtag  DW_TAG_member
   11507                      .dwattr $C$DW$2089, DW_AT_type(*$C$DW$T$27)
   11508                      .dwattr $C$DW$2089, DW_AT_name("GPIOXINTnSEL")
   11509                      .dwattr $C$DW$2089, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   11510                      .dwattr $C$DW$2089, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   11511                      .dwattr $C$DW$2089, DW_AT_accessibility(DW_ACCESS_public)
   11512              $C$DW$2090      .dwtag  DW_TAG_member
   11513                      .dwattr $C$DW$2090, DW_AT_type(*$C$DW$T$26)
   11514                      .dwattr $C$DW$2090, DW_AT_name("rsvd_8")
   11515                      .dwattr $C$DW$2090, DW_AT_TI_symbol_name("_rsvd_8")
   11516                      .dwattr $C$DW$2090, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   11517                      .dwattr $C$DW$2090, DW_AT_accessibility(DW_ACCESS_public)
   11518              $C$DW$2091      .dwtag  DW_TAG_member
   11519                      .dwattr $C$DW$2091, DW_AT_type(*$C$DW$T$73)
   11520                      .dwattr $C$DW$2091, DW_AT_name("GPIOLPMSEL")
   11521                      .dwattr $C$DW$2091, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   11522                      .dwattr $C$DW$2091, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   11523                      .dwattr $C$DW$2091, DW_AT_accessibility(DW_ACCESS_public)
   11524                      .dwendtag $C$DW$T$76
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  221

   11525              
   11526              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   11527                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   11528                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   11529              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   11530                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   11531                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   11532              
   11533              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   11534                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   11535                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0e)
   11536              $C$DW$2092      .dwtag  DW_TAG_member
   11537                      .dwattr $C$DW$2092, DW_AT_type(*$C$DW$T$77)
   11538                      .dwattr $C$DW$2092, DW_AT_name("I")
   11539                      .dwattr $C$DW$2092, DW_AT_TI_symbol_name("_I")
   11540                      .dwattr $C$DW$2092, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11541                      .dwattr $C$DW$2092, DW_AT_accessibility(DW_ACCESS_public)
   11542              $C$DW$2093      .dwtag  DW_TAG_member
   11543                      .dwattr $C$DW$2093, DW_AT_type(*$C$DW$T$77)
   11544                      .dwattr $C$DW$2093, DW_AT_name("V")
   11545                      .dwattr $C$DW$2093, DW_AT_TI_symbol_name("_V")
   11546                      .dwattr $C$DW$2093, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11547                      .dwattr $C$DW$2093, DW_AT_accessibility(DW_ACCESS_public)
   11548              $C$DW$2094      .dwtag  DW_TAG_member
   11549                      .dwattr $C$DW$2094, DW_AT_type(*$C$DW$T$69)
   11550                      .dwattr $C$DW$2094, DW_AT_name("dcBus")
   11551                      .dwattr $C$DW$2094, DW_AT_TI_symbol_name("_dcBus")
   11552                      .dwattr $C$DW$2094, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11553                      .dwattr $C$DW$2094, DW_AT_accessibility(DW_ACCESS_public)
   11554                      .dwendtag $C$DW$T$78
   11555              
   11556              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11557                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$78)
   11558                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   11559              
   11560              $C$DW$T$112     .dwtag  DW_TAG_structure_type
   11561                      .dwattr $C$DW$T$112, DW_AT_name("_HAL_Obj_")
   11562                      .dwattr $C$DW$T$112, DW_AT_byte_size(0xa8)
   11563              $C$DW$2095      .dwtag  DW_TAG_member
   11564                      .dwattr $C$DW$2095, DW_AT_type(*$C$DW$T$80)
   11565                      .dwattr $C$DW$2095, DW_AT_name("adcHandle")
   11566                      .dwattr $C$DW$2095, DW_AT_TI_symbol_name("_adcHandle")
   11567                      .dwattr $C$DW$2095, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11568                      .dwattr $C$DW$2095, DW_AT_accessibility(DW_ACCESS_public)
   11569              $C$DW$2096      .dwtag  DW_TAG_member
   11570                      .dwattr $C$DW$2096, DW_AT_type(*$C$DW$T$82)
   11571                      .dwattr $C$DW$2096, DW_AT_name("clkHandle")
   11572                      .dwattr $C$DW$2096, DW_AT_TI_symbol_name("_clkHandle")
   11573                      .dwattr $C$DW$2096, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11574                      .dwattr $C$DW$2096, DW_AT_accessibility(DW_ACCESS_public)
   11575              $C$DW$2097      .dwtag  DW_TAG_member
   11576                      .dwattr $C$DW$2097, DW_AT_type(*$C$DW$T$84)
   11577                      .dwattr $C$DW$2097, DW_AT_name("cpuHandle")
   11578                      .dwattr $C$DW$2097, DW_AT_TI_symbol_name("_cpuHandle")
   11579                      .dwattr $C$DW$2097, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  222

   11580                      .dwattr $C$DW$2097, DW_AT_accessibility(DW_ACCESS_public)
   11581              $C$DW$2098      .dwtag  DW_TAG_member
   11582                      .dwattr $C$DW$2098, DW_AT_type(*$C$DW$T$86)
   11583                      .dwattr $C$DW$2098, DW_AT_name("flashHandle")
   11584                      .dwattr $C$DW$2098, DW_AT_TI_symbol_name("_flashHandle")
   11585                      .dwattr $C$DW$2098, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11586                      .dwattr $C$DW$2098, DW_AT_accessibility(DW_ACCESS_public)
   11587              $C$DW$2099      .dwtag  DW_TAG_member
   11588                      .dwattr $C$DW$2099, DW_AT_type(*$C$DW$T$37)
   11589                      .dwattr $C$DW$2099, DW_AT_name("gpioHandle")
   11590                      .dwattr $C$DW$2099, DW_AT_TI_symbol_name("_gpioHandle")
   11591                      .dwattr $C$DW$2099, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11592                      .dwattr $C$DW$2099, DW_AT_accessibility(DW_ACCESS_public)
   11593              $C$DW$2100      .dwtag  DW_TAG_member
   11594                      .dwattr $C$DW$2100, DW_AT_type(*$C$DW$T$89)
   11595                      .dwattr $C$DW$2100, DW_AT_name("offsetHandle_I")
   11596                      .dwattr $C$DW$2100, DW_AT_TI_symbol_name("_offsetHandle_I")
   11597                      .dwattr $C$DW$2100, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11598                      .dwattr $C$DW$2100, DW_AT_accessibility(DW_ACCESS_public)
   11599              $C$DW$2101      .dwtag  DW_TAG_member
   11600                      .dwattr $C$DW$2101, DW_AT_type(*$C$DW$T$91)
   11601                      .dwattr $C$DW$2101, DW_AT_name("offset_I")
   11602                      .dwattr $C$DW$2101, DW_AT_TI_symbol_name("_offset_I")
   11603                      .dwattr $C$DW$2101, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11604                      .dwattr $C$DW$2101, DW_AT_accessibility(DW_ACCESS_public)
   11605              $C$DW$2102      .dwtag  DW_TAG_member
   11606                      .dwattr $C$DW$2102, DW_AT_type(*$C$DW$T$89)
   11607                      .dwattr $C$DW$2102, DW_AT_name("offsetHandle_V")
   11608                      .dwattr $C$DW$2102, DW_AT_TI_symbol_name("_offsetHandle_V")
   11609                      .dwattr $C$DW$2102, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11610                      .dwattr $C$DW$2102, DW_AT_accessibility(DW_ACCESS_public)
   11611              $C$DW$2103      .dwtag  DW_TAG_member
   11612                      .dwattr $C$DW$2103, DW_AT_type(*$C$DW$T$91)
   11613                      .dwattr $C$DW$2103, DW_AT_name("offset_V")
   11614                      .dwattr $C$DW$2103, DW_AT_TI_symbol_name("_offset_V")
   11615                      .dwattr $C$DW$2103, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11616                      .dwattr $C$DW$2103, DW_AT_accessibility(DW_ACCESS_public)
   11617              $C$DW$2104      .dwtag  DW_TAG_member
   11618                      .dwattr $C$DW$2104, DW_AT_type(*$C$DW$T$93)
   11619                      .dwattr $C$DW$2104, DW_AT_name("oscHandle")
   11620                      .dwattr $C$DW$2104, DW_AT_TI_symbol_name("_oscHandle")
   11621                      .dwattr $C$DW$2104, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
   11622                      .dwattr $C$DW$2104, DW_AT_accessibility(DW_ACCESS_public)
   11623              $C$DW$2105      .dwtag  DW_TAG_member
   11624                      .dwattr $C$DW$2105, DW_AT_type(*$C$DW$T$95)
   11625                      .dwattr $C$DW$2105, DW_AT_name("pieHandle")
   11626                      .dwattr $C$DW$2105, DW_AT_TI_symbol_name("_pieHandle")
   11627                      .dwattr $C$DW$2105, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
   11628                      .dwattr $C$DW$2105, DW_AT_accessibility(DW_ACCESS_public)
   11629              $C$DW$2106      .dwtag  DW_TAG_member
   11630                      .dwattr $C$DW$2106, DW_AT_type(*$C$DW$T$97)
   11631                      .dwattr $C$DW$2106, DW_AT_name("pllHandle")
   11632                      .dwattr $C$DW$2106, DW_AT_TI_symbol_name("_pllHandle")
   11633                      .dwattr $C$DW$2106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
   11634                      .dwattr $C$DW$2106, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  223

   11635              $C$DW$2107      .dwtag  DW_TAG_member
   11636                      .dwattr $C$DW$2107, DW_AT_type(*$C$DW$T$100)
   11637                      .dwattr $C$DW$2107, DW_AT_name("pwmHandle")
   11638                      .dwattr $C$DW$2107, DW_AT_TI_symbol_name("_pwmHandle")
   11639                      .dwattr $C$DW$2107, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
   11640                      .dwattr $C$DW$2107, DW_AT_accessibility(DW_ACCESS_public)
   11641              $C$DW$2108      .dwtag  DW_TAG_member
   11642                      .dwattr $C$DW$2108, DW_AT_type(*$C$DW$T$100)
   11643                      .dwattr $C$DW$2108, DW_AT_name("pwmDacHandle")
   11644                      .dwattr $C$DW$2108, DW_AT_TI_symbol_name("_pwmDacHandle")
   11645                      .dwattr $C$DW$2108, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   11646                      .dwattr $C$DW$2108, DW_AT_accessibility(DW_ACCESS_public)
   11647              $C$DW$2109      .dwtag  DW_TAG_member
   11648                      .dwattr $C$DW$2109, DW_AT_type(*$C$DW$T$102)
   11649                      .dwattr $C$DW$2109, DW_AT_name("pwrHandle")
   11650                      .dwattr $C$DW$2109, DW_AT_TI_symbol_name("_pwrHandle")
   11651                      .dwattr $C$DW$2109, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   11652                      .dwattr $C$DW$2109, DW_AT_accessibility(DW_ACCESS_public)
   11653              $C$DW$2110      .dwtag  DW_TAG_member
   11654                      .dwattr $C$DW$2110, DW_AT_type(*$C$DW$T$105)
   11655                      .dwattr $C$DW$2110, DW_AT_name("timerHandle")
   11656                      .dwattr $C$DW$2110, DW_AT_TI_symbol_name("_timerHandle")
   11657                      .dwattr $C$DW$2110, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
   11658                      .dwattr $C$DW$2110, DW_AT_accessibility(DW_ACCESS_public)
   11659              $C$DW$2111      .dwtag  DW_TAG_member
   11660                      .dwattr $C$DW$2111, DW_AT_type(*$C$DW$T$107)
   11661                      .dwattr $C$DW$2111, DW_AT_name("wdogHandle")
   11662                      .dwattr $C$DW$2111, DW_AT_TI_symbol_name("_wdogHandle")
   11663                      .dwattr $C$DW$2111, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
   11664                      .dwattr $C$DW$2111, DW_AT_accessibility(DW_ACCESS_public)
   11665              $C$DW$2112      .dwtag  DW_TAG_member
   11666                      .dwattr $C$DW$2112, DW_AT_type(*$C$DW$T$108)
   11667                      .dwattr $C$DW$2112, DW_AT_name("adcBias")
   11668                      .dwattr $C$DW$2112, DW_AT_TI_symbol_name("_adcBias")
   11669                      .dwattr $C$DW$2112, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
   11670                      .dwattr $C$DW$2112, DW_AT_accessibility(DW_ACCESS_public)
   11671              $C$DW$2113      .dwtag  DW_TAG_member
   11672                      .dwattr $C$DW$2113, DW_AT_type(*$C$DW$T$69)
   11673                      .dwattr $C$DW$2113, DW_AT_name("current_sf")
   11674                      .dwattr $C$DW$2113, DW_AT_TI_symbol_name("_current_sf")
   11675                      .dwattr $C$DW$2113, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
   11676                      .dwattr $C$DW$2113, DW_AT_accessibility(DW_ACCESS_public)
   11677              $C$DW$2114      .dwtag  DW_TAG_member
   11678                      .dwattr $C$DW$2114, DW_AT_type(*$C$DW$T$69)
   11679                      .dwattr $C$DW$2114, DW_AT_name("voltage_sf")
   11680                      .dwattr $C$DW$2114, DW_AT_TI_symbol_name("_voltage_sf")
   11681                      .dwattr $C$DW$2114, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
   11682                      .dwattr $C$DW$2114, DW_AT_accessibility(DW_ACCESS_public)
   11683              $C$DW$2115      .dwtag  DW_TAG_member
   11684                      .dwattr $C$DW$2115, DW_AT_type(*$C$DW$T$32)
   11685                      .dwattr $C$DW$2115, DW_AT_name("numCurrentSensors")
   11686                      .dwattr $C$DW$2115, DW_AT_TI_symbol_name("_numCurrentSensors")
   11687                      .dwattr $C$DW$2115, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
   11688                      .dwattr $C$DW$2115, DW_AT_accessibility(DW_ACCESS_public)
   11689              $C$DW$2116      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  224

   11690                      .dwattr $C$DW$2116, DW_AT_type(*$C$DW$T$32)
   11691                      .dwattr $C$DW$2116, DW_AT_name("numVoltageSensors")
   11692                      .dwattr $C$DW$2116, DW_AT_TI_symbol_name("_numVoltageSensors")
   11693                      .dwattr $C$DW$2116, DW_AT_data_member_location[DW_OP_plus_uconst 0x99]
   11694                      .dwattr $C$DW$2116, DW_AT_accessibility(DW_ACCESS_public)
   11695              $C$DW$2117      .dwtag  DW_TAG_member
   11696                      .dwattr $C$DW$2117, DW_AT_type(*$C$DW$T$35)
   11697                      .dwattr $C$DW$2117, DW_AT_name("spiAHandle")
   11698                      .dwattr $C$DW$2117, DW_AT_TI_symbol_name("_spiAHandle")
   11699                      .dwattr $C$DW$2117, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
   11700                      .dwattr $C$DW$2117, DW_AT_accessibility(DW_ACCESS_public)
   11701              $C$DW$2118      .dwtag  DW_TAG_member
   11702                      .dwattr $C$DW$2118, DW_AT_type(*$C$DW$T$35)
   11703                      .dwattr $C$DW$2118, DW_AT_name("spiBHandle")
   11704                      .dwattr $C$DW$2118, DW_AT_TI_symbol_name("_spiBHandle")
   11705                      .dwattr $C$DW$2118, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
   11706                      .dwattr $C$DW$2118, DW_AT_accessibility(DW_ACCESS_public)
   11707              $C$DW$2119      .dwtag  DW_TAG_member
   11708                      .dwattr $C$DW$2119, DW_AT_type(*$C$DW$T$110)
   11709                      .dwattr $C$DW$2119, DW_AT_name("drv8301Handle")
   11710                      .dwattr $C$DW$2119, DW_AT_TI_symbol_name("_drv8301Handle")
   11711                      .dwattr $C$DW$2119, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
   11712                      .dwattr $C$DW$2119, DW_AT_accessibility(DW_ACCESS_public)
   11713              $C$DW$2120      .dwtag  DW_TAG_member
   11714                      .dwattr $C$DW$2120, DW_AT_type(*$C$DW$T$111)
   11715                      .dwattr $C$DW$2120, DW_AT_name("drv8301")
   11716                      .dwattr $C$DW$2120, DW_AT_TI_symbol_name("_drv8301")
   11717                      .dwattr $C$DW$2120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
   11718                      .dwattr $C$DW$2120, DW_AT_accessibility(DW_ACCESS_public)
   11719                      .dwendtag $C$DW$T$112
   11720              
   11721              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   11722                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$112)
   11723                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   11724              $C$DW$T$351     .dwtag  DW_TAG_pointer_type
   11725                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
   11726                      .dwattr $C$DW$T$351, DW_AT_address_class(0x20)
   11727              $C$DW$T$352     .dwtag  DW_TAG_pointer_type
   11728                      .dwattr $C$DW$T$352, DW_AT_type(*$C$DW$T$112)
   11729                      .dwattr $C$DW$T$352, DW_AT_address_class(0x20)
   11730              $C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   11731                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
   11732                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
   11733              $C$DW$2121      .dwtag  DW_TAG_TI_far_type
   11734                      .dwattr $C$DW$2121, DW_AT_type(*$C$DW$T$353)
   11735              $C$DW$T$354     .dwtag  DW_TAG_const_type
   11736                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$2121)
   11737              
   11738              $C$DW$T$114     .dwtag  DW_TAG_structure_type
   11739                      .dwattr $C$DW$T$114, DW_AT_name("_MATH_vec3_")
   11740                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x06)
   11741              $C$DW$2122      .dwtag  DW_TAG_member
   11742                      .dwattr $C$DW$2122, DW_AT_type(*$C$DW$T$113)
   11743                      .dwattr $C$DW$2122, DW_AT_name("value")
   11744                      .dwattr $C$DW$2122, DW_AT_TI_symbol_name("_value")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  225

   11745                      .dwattr $C$DW$2122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11746                      .dwattr $C$DW$2122, DW_AT_accessibility(DW_ACCESS_public)
   11747                      .dwendtag $C$DW$T$114
   11748              
   11749              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   11750                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$114)
   11751                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   11752              
   11753              $C$DW$T$118     .dwtag  DW_TAG_structure_type
   11754                      .dwattr $C$DW$T$118, DW_AT_name("_OFFSET_")
   11755                      .dwattr $C$DW$T$118, DW_AT_byte_size(0x0e)
   11756              $C$DW$2123      .dwtag  DW_TAG_member
   11757                      .dwattr $C$DW$2123, DW_AT_type(*$C$DW$T$69)
   11758                      .dwattr $C$DW$2123, DW_AT_name("value")
   11759                      .dwattr $C$DW$2123, DW_AT_TI_symbol_name("_value")
   11760                      .dwattr $C$DW$2123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11761                      .dwattr $C$DW$2123, DW_AT_accessibility(DW_ACCESS_public)
   11762              $C$DW$2124      .dwtag  DW_TAG_member
   11763                      .dwattr $C$DW$2124, DW_AT_type(*$C$DW$T$115)
   11764                      .dwattr $C$DW$2124, DW_AT_name("filter")
   11765                      .dwattr $C$DW$2124, DW_AT_TI_symbol_name("_filter")
   11766                      .dwattr $C$DW$2124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11767                      .dwattr $C$DW$2124, DW_AT_accessibility(DW_ACCESS_public)
   11768              $C$DW$2125      .dwtag  DW_TAG_member
   11769                      .dwattr $C$DW$2125, DW_AT_type(*$C$DW$T$117)
   11770                      .dwattr $C$DW$2125, DW_AT_name("filterHandle")
   11771                      .dwattr $C$DW$2125, DW_AT_TI_symbol_name("_filterHandle")
   11772                      .dwattr $C$DW$2125, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11773                      .dwattr $C$DW$2125, DW_AT_accessibility(DW_ACCESS_public)
   11774                      .dwendtag $C$DW$T$118
   11775              
   11776              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
   11777                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$118)
   11778                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
   11779              
   11780              $C$DW$T$91      .dwtag  DW_TAG_array_type
   11781                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
   11782                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
   11783                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x2a)
   11784              $C$DW$2126      .dwtag  DW_TAG_subrange_type
   11785                      .dwattr $C$DW$2126, DW_AT_upper_bound(0x02)
   11786                      .dwendtag $C$DW$T$91
   11787              
   11788              
   11789              $C$DW$T$20      .dwtag  DW_TAG_structure_type
   11790                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
   11791                      .dwattr $C$DW$T$20, DW_AT_declaration
