TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:36 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    6085              $C$DW$836       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    6086              $C$DW$837       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    6087              $C$DW$838       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    6088              $C$DW$839       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    6089              $C$DW$840       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    6090              $C$DW$841       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    6091              $C$DW$842       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    6092              $C$DW$843       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    6093              $C$DW$844       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    6094              $C$DW$845       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    6095                      .dwendtag $C$DW$T$220
    6096              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  122

    6097              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    6098                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    6099                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    6100              
    6101              $C$DW$T$223     .dwtag  DW_TAG_enumeration_type
    6102                      .dwattr $C$DW$T$223, DW_AT_byte_size(0x01)
    6103              $C$DW$846       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6104              $C$DW$847       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6105              $C$DW$848       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6106                      .dwendtag $C$DW$T$223
    6107              
    6108              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6109                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
    6110                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    6111              
    6112              $C$DW$T$226     .dwtag  DW_TAG_enumeration_type
    6113                      .dwattr $C$DW$T$226, DW_AT_byte_size(0x01)
    6114              $C$DW$849       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    6115              $C$DW$850       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    6116                      .dwendtag $C$DW$T$226
    6117              
    6118              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    6119                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$226)
    6120                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    6121              
    6122              $C$DW$T$25      .dwtag  DW_TAG_union_type
    6123                      .dwattr $C$DW$T$25, DW_AT_name("U3_0")
    6124                      .dwattr $C$DW$T$25, DW_AT_declaration
    6125                      .dwendtag $C$DW$T$25
    6126              
    6127              
    6128              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6129                      .dwattr $C$DW$T$26, DW_AT_name("S3_1")
    6130                      .dwattr $C$DW$T$26, DW_AT_declaration
    6131                      .dwendtag $C$DW$T$26
    6132              
    6133              
    6134              $C$DW$T$27      .dwtag  DW_TAG_union_type
    6135                      .dwattr $C$DW$T$27, DW_AT_name("U4_2")
    6136                      .dwattr $C$DW$T$27, DW_AT_declaration
    6137                      .dwendtag $C$DW$T$27
    6138              
    6139              
    6140              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6141                      .dwattr $C$DW$T$28, DW_AT_name("S4_3")
    6142                      .dwattr $C$DW$T$28, DW_AT_declaration
    6143                      .dwendtag $C$DW$T$28
    6144              
    6145              
    6146              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    6147                      .dwattr $C$DW$T$19, DW_AT_name("IPD_HFI_Obj")
    6148                      .dwattr $C$DW$T$19, DW_AT_declaration
    6149                      .dwendtag $C$DW$T$19
    6150              
    6151              $C$DW$T$230     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  123

    6152                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$19)
    6153                      .dwattr $C$DW$T$230, DW_AT_address_class(0x20)
    6154              $C$DW$T$231     .dwtag  DW_TAG_typedef, DW_AT_name("IPD_HFI_Handle")
    6155                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$230)
    6156                      .dwattr $C$DW$T$231, DW_AT_language(DW_LANG_C)
    6157              
    6158              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6159                      .dwattr $C$DW$T$37, DW_AT_name("_ADC_Obj_")
    6160                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x6650)
    6161              $C$DW$851       .dwtag  DW_TAG_member
    6162                      .dwattr $C$DW$851, DW_AT_type(*$C$DW$T$31)
    6163                      .dwattr $C$DW$851, DW_AT_name("ADCRESULT")
    6164                      .dwattr $C$DW$851, DW_AT_TI_symbol_name("_ADCRESULT")
    6165                      .dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6166                      .dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
    6167              $C$DW$852       .dwtag  DW_TAG_member
    6168                      .dwattr $C$DW$852, DW_AT_type(*$C$DW$T$32)
    6169                      .dwattr $C$DW$852, DW_AT_name("resvd_1")
    6170                      .dwattr $C$DW$852, DW_AT_TI_symbol_name("_resvd_1")
    6171                      .dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6172                      .dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
    6173              $C$DW$853       .dwtag  DW_TAG_member
    6174                      .dwattr $C$DW$853, DW_AT_type(*$C$DW$T$30)
    6175                      .dwattr $C$DW$853, DW_AT_name("ADCCTL1")
    6176                      .dwattr $C$DW$853, DW_AT_TI_symbol_name("_ADCCTL1")
    6177                      .dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6178                      .dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
    6179              $C$DW$854       .dwtag  DW_TAG_member
    6180                      .dwattr $C$DW$854, DW_AT_type(*$C$DW$T$30)
    6181                      .dwattr $C$DW$854, DW_AT_name("ADCCTL2")
    6182                      .dwattr $C$DW$854, DW_AT_TI_symbol_name("_ADCCTL2")
    6183                      .dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6184                      .dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
    6185              $C$DW$855       .dwtag  DW_TAG_member
    6186                      .dwattr $C$DW$855, DW_AT_type(*$C$DW$T$33)
    6187                      .dwattr $C$DW$855, DW_AT_name("rsvd_2")
    6188                      .dwattr $C$DW$855, DW_AT_TI_symbol_name("_rsvd_2")
    6189                      .dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6190                      .dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
    6191              $C$DW$856       .dwtag  DW_TAG_member
    6192                      .dwattr $C$DW$856, DW_AT_type(*$C$DW$T$30)
    6193                      .dwattr $C$DW$856, DW_AT_name("ADCINTFLG")
    6194                      .dwattr $C$DW$856, DW_AT_TI_symbol_name("_ADCINTFLG")
    6195                      .dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6196                      .dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
    6197              $C$DW$857       .dwtag  DW_TAG_member
    6198                      .dwattr $C$DW$857, DW_AT_type(*$C$DW$T$30)
    6199                      .dwattr $C$DW$857, DW_AT_name("ADCINTFLGCLR")
    6200                      .dwattr $C$DW$857, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6201                      .dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6202                      .dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
    6203              $C$DW$858       .dwtag  DW_TAG_member
    6204                      .dwattr $C$DW$858, DW_AT_type(*$C$DW$T$30)
    6205                      .dwattr $C$DW$858, DW_AT_name("ADCINTOVF")
    6206                      .dwattr $C$DW$858, DW_AT_TI_symbol_name("_ADCINTOVF")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  124

    6207                      .dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6208                      .dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
    6209              $C$DW$859       .dwtag  DW_TAG_member
    6210                      .dwattr $C$DW$859, DW_AT_type(*$C$DW$T$30)
    6211                      .dwattr $C$DW$859, DW_AT_name("ADCINTOVFCLR")
    6212                      .dwattr $C$DW$859, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6213                      .dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6214                      .dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
    6215              $C$DW$860       .dwtag  DW_TAG_member
    6216                      .dwattr $C$DW$860, DW_AT_type(*$C$DW$T$34)
    6217                      .dwattr $C$DW$860, DW_AT_name("INTSELxNy")
    6218                      .dwattr $C$DW$860, DW_AT_TI_symbol_name("_INTSELxNy")
    6219                      .dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6220                      .dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
    6221              $C$DW$861       .dwtag  DW_TAG_member
    6222                      .dwattr $C$DW$861, DW_AT_type(*$C$DW$T$35)
    6223                      .dwattr $C$DW$861, DW_AT_name("rsvd_3")
    6224                      .dwattr $C$DW$861, DW_AT_TI_symbol_name("_rsvd_3")
    6225                      .dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6226                      .dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
    6227              $C$DW$862       .dwtag  DW_TAG_member
    6228                      .dwattr $C$DW$862, DW_AT_type(*$C$DW$T$30)
    6229                      .dwattr $C$DW$862, DW_AT_name("SOCPRICTRL")
    6230                      .dwattr $C$DW$862, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6231                      .dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6232                      .dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
    6233              $C$DW$863       .dwtag  DW_TAG_member
    6234                      .dwattr $C$DW$863, DW_AT_type(*$C$DW$T$30)
    6235                      .dwattr $C$DW$863, DW_AT_name("rsvd_4")
    6236                      .dwattr $C$DW$863, DW_AT_TI_symbol_name("_rsvd_4")
    6237                      .dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6238                      .dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
    6239              $C$DW$864       .dwtag  DW_TAG_member
    6240                      .dwattr $C$DW$864, DW_AT_type(*$C$DW$T$30)
    6241                      .dwattr $C$DW$864, DW_AT_name("ADCSAMPLEMODE")
    6242                      .dwattr $C$DW$864, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6243                      .dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6244                      .dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
    6245              $C$DW$865       .dwtag  DW_TAG_member
    6246                      .dwattr $C$DW$865, DW_AT_type(*$C$DW$T$30)
    6247                      .dwattr $C$DW$865, DW_AT_name("rsvd_5")
    6248                      .dwattr $C$DW$865, DW_AT_TI_symbol_name("_rsvd_5")
    6249                      .dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6250                      .dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
    6251              $C$DW$866       .dwtag  DW_TAG_member
    6252                      .dwattr $C$DW$866, DW_AT_type(*$C$DW$T$30)
    6253                      .dwattr $C$DW$866, DW_AT_name("ADCINTSOCSEL1")
    6254                      .dwattr $C$DW$866, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6255                      .dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6256                      .dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
    6257              $C$DW$867       .dwtag  DW_TAG_member
    6258                      .dwattr $C$DW$867, DW_AT_type(*$C$DW$T$30)
    6259                      .dwattr $C$DW$867, DW_AT_name("ADCINTSOCSEL2")
    6260                      .dwattr $C$DW$867, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6261                      .dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  125

    6262                      .dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
    6263              $C$DW$868       .dwtag  DW_TAG_member
    6264                      .dwattr $C$DW$868, DW_AT_type(*$C$DW$T$33)
    6265                      .dwattr $C$DW$868, DW_AT_name("rsvd_6")
    6266                      .dwattr $C$DW$868, DW_AT_TI_symbol_name("_rsvd_6")
    6267                      .dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6268                      .dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
    6269              $C$DW$869       .dwtag  DW_TAG_member
    6270                      .dwattr $C$DW$869, DW_AT_type(*$C$DW$T$30)
    6271                      .dwattr $C$DW$869, DW_AT_name("ADCSOCFLG1")
    6272                      .dwattr $C$DW$869, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6273                      .dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6274                      .dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
    6275              $C$DW$870       .dwtag  DW_TAG_member
    6276                      .dwattr $C$DW$870, DW_AT_type(*$C$DW$T$30)
    6277                      .dwattr $C$DW$870, DW_AT_name("rsvd_7")
    6278                      .dwattr $C$DW$870, DW_AT_TI_symbol_name("_rsvd_7")
    6279                      .dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6280                      .dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
    6281              $C$DW$871       .dwtag  DW_TAG_member
    6282                      .dwattr $C$DW$871, DW_AT_type(*$C$DW$T$30)
    6283                      .dwattr $C$DW$871, DW_AT_name("ADCSOCFRC1")
    6284                      .dwattr $C$DW$871, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6285                      .dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6286                      .dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
    6287              $C$DW$872       .dwtag  DW_TAG_member
    6288                      .dwattr $C$DW$872, DW_AT_type(*$C$DW$T$30)
    6289                      .dwattr $C$DW$872, DW_AT_name("rsvd_8")
    6290                      .dwattr $C$DW$872, DW_AT_TI_symbol_name("_rsvd_8")
    6291                      .dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6292                      .dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
    6293              $C$DW$873       .dwtag  DW_TAG_member
    6294                      .dwattr $C$DW$873, DW_AT_type(*$C$DW$T$30)
    6295                      .dwattr $C$DW$873, DW_AT_name("ADCSOCOVF1")
    6296                      .dwattr $C$DW$873, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6297                      .dwattr $C$DW$873, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6298                      .dwattr $C$DW$873, DW_AT_accessibility(DW_ACCESS_public)
    6299              $C$DW$874       .dwtag  DW_TAG_member
    6300                      .dwattr $C$DW$874, DW_AT_type(*$C$DW$T$30)
    6301                      .dwattr $C$DW$874, DW_AT_name("rsvd_9")
    6302                      .dwattr $C$DW$874, DW_AT_TI_symbol_name("_rsvd_9")
    6303                      .dwattr $C$DW$874, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6304                      .dwattr $C$DW$874, DW_AT_accessibility(DW_ACCESS_public)
    6305              $C$DW$875       .dwtag  DW_TAG_member
    6306                      .dwattr $C$DW$875, DW_AT_type(*$C$DW$T$30)
    6307                      .dwattr $C$DW$875, DW_AT_name("ADCSOCOVFCLR1")
    6308                      .dwattr $C$DW$875, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6309                      .dwattr $C$DW$875, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6310                      .dwattr $C$DW$875, DW_AT_accessibility(DW_ACCESS_public)
    6311              $C$DW$876       .dwtag  DW_TAG_member
    6312                      .dwattr $C$DW$876, DW_AT_type(*$C$DW$T$30)
    6313                      .dwattr $C$DW$876, DW_AT_name("rsvd_10")
    6314                      .dwattr $C$DW$876, DW_AT_TI_symbol_name("_rsvd_10")
    6315                      .dwattr $C$DW$876, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6316                      .dwattr $C$DW$876, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  126

    6317              $C$DW$877       .dwtag  DW_TAG_member
    6318                      .dwattr $C$DW$877, DW_AT_type(*$C$DW$T$31)
    6319                      .dwattr $C$DW$877, DW_AT_name("ADCSOCxCTL")
    6320                      .dwattr $C$DW$877, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6321                      .dwattr $C$DW$877, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6322                      .dwattr $C$DW$877, DW_AT_accessibility(DW_ACCESS_public)
    6323              $C$DW$878       .dwtag  DW_TAG_member
    6324                      .dwattr $C$DW$878, DW_AT_type(*$C$DW$T$31)
    6325                      .dwattr $C$DW$878, DW_AT_name("rsvd_11")
    6326                      .dwattr $C$DW$878, DW_AT_TI_symbol_name("_rsvd_11")
    6327                      .dwattr $C$DW$878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6328                      .dwattr $C$DW$878, DW_AT_accessibility(DW_ACCESS_public)
    6329              $C$DW$879       .dwtag  DW_TAG_member
    6330                      .dwattr $C$DW$879, DW_AT_type(*$C$DW$T$30)
    6331                      .dwattr $C$DW$879, DW_AT_name("ADCREFTRIM")
    6332                      .dwattr $C$DW$879, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6333                      .dwattr $C$DW$879, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6334                      .dwattr $C$DW$879, DW_AT_accessibility(DW_ACCESS_public)
    6335              $C$DW$880       .dwtag  DW_TAG_member
    6336                      .dwattr $C$DW$880, DW_AT_type(*$C$DW$T$30)
    6337                      .dwattr $C$DW$880, DW_AT_name("ADCOFFTRIM")
    6338                      .dwattr $C$DW$880, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6339                      .dwattr $C$DW$880, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6340                      .dwattr $C$DW$880, DW_AT_accessibility(DW_ACCESS_public)
    6341              $C$DW$881       .dwtag  DW_TAG_member
    6342                      .dwattr $C$DW$881, DW_AT_type(*$C$DW$T$36)
    6343                      .dwattr $C$DW$881, DW_AT_name("resvd_12")
    6344                      .dwattr $C$DW$881, DW_AT_TI_symbol_name("_resvd_12")
    6345                      .dwattr $C$DW$881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6346                      .dwattr $C$DW$881, DW_AT_accessibility(DW_ACCESS_public)
    6347              $C$DW$882       .dwtag  DW_TAG_member
    6348                      .dwattr $C$DW$882, DW_AT_type(*$C$DW$T$30)
    6349                      .dwattr $C$DW$882, DW_AT_name("ADCREV")
    6350                      .dwattr $C$DW$882, DW_AT_TI_symbol_name("_ADCREV")
    6351                      .dwattr $C$DW$882, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6352                      .dwattr $C$DW$882, DW_AT_accessibility(DW_ACCESS_public)
    6353                      .dwendtag $C$DW$T$37
    6354              
    6355              $C$DW$T$235     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    6356                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$37)
    6357                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    6358              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    6359                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$37)
    6360                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    6361              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6362                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    6363                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    6364              
    6365              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6366                      .dwattr $C$DW$T$20, DW_AT_name("_AFSEL_Obj_")
    6367                      .dwattr $C$DW$T$20, DW_AT_declaration
    6368                      .dwendtag $C$DW$T$20
    6369              
    6370              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    6371                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  127

    6372                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    6373              $C$DW$T$237     .dwtag  DW_TAG_typedef, DW_AT_name("AFSEL_Handle")
    6374                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    6375                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    6376              
    6377              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6378                      .dwattr $C$DW$T$40, DW_AT_name("_CLARKE_Obj_")
    6379                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x06)
    6380              $C$DW$883       .dwtag  DW_TAG_member
    6381                      .dwattr $C$DW$883, DW_AT_type(*$C$DW$T$38)
    6382                      .dwattr $C$DW$883, DW_AT_name("alpha_sf")
    6383                      .dwattr $C$DW$883, DW_AT_TI_symbol_name("_alpha_sf")
    6384                      .dwattr $C$DW$883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6385                      .dwattr $C$DW$883, DW_AT_accessibility(DW_ACCESS_public)
    6386              $C$DW$884       .dwtag  DW_TAG_member
    6387                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$38)
    6388                      .dwattr $C$DW$884, DW_AT_name("beta_sf")
    6389                      .dwattr $C$DW$884, DW_AT_TI_symbol_name("_beta_sf")
    6390                      .dwattr $C$DW$884, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6391                      .dwattr $C$DW$884, DW_AT_accessibility(DW_ACCESS_public)
    6392              $C$DW$885       .dwtag  DW_TAG_member
    6393                      .dwattr $C$DW$885, DW_AT_type(*$C$DW$T$39)
    6394                      .dwattr $C$DW$885, DW_AT_name("numSensors")
    6395                      .dwattr $C$DW$885, DW_AT_TI_symbol_name("_numSensors")
    6396                      .dwattr $C$DW$885, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6397                      .dwattr $C$DW$885, DW_AT_accessibility(DW_ACCESS_public)
    6398                      .dwendtag $C$DW$T$40
    6399              
    6400              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6401                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$40)
    6402                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    6403              $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6404                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$40)
    6405                      .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    6406              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6407                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    6408                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6409              $C$DW$886       .dwtag  DW_TAG_TI_far_type
    6410                      .dwattr $C$DW$886, DW_AT_type(*$C$DW$T$50)
    6411              $C$DW$T$241     .dwtag  DW_TAG_const_type
    6412                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$886)
    6413              
    6414              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6415                      .dwattr $C$DW$T$42, DW_AT_name("_CLK_Obj_")
    6416                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x11)
    6417              $C$DW$887       .dwtag  DW_TAG_member
    6418                      .dwattr $C$DW$887, DW_AT_type(*$C$DW$T$30)
    6419                      .dwattr $C$DW$887, DW_AT_name("XCLK")
    6420                      .dwattr $C$DW$887, DW_AT_TI_symbol_name("_XCLK")
    6421                      .dwattr $C$DW$887, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6422                      .dwattr $C$DW$887, DW_AT_accessibility(DW_ACCESS_public)
    6423              $C$DW$888       .dwtag  DW_TAG_member
    6424                      .dwattr $C$DW$888, DW_AT_type(*$C$DW$T$30)
    6425                      .dwattr $C$DW$888, DW_AT_name("rsvd_1")
    6426                      .dwattr $C$DW$888, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  128

    6427                      .dwattr $C$DW$888, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6428                      .dwattr $C$DW$888, DW_AT_accessibility(DW_ACCESS_public)
    6429              $C$DW$889       .dwtag  DW_TAG_member
    6430                      .dwattr $C$DW$889, DW_AT_type(*$C$DW$T$30)
    6431                      .dwattr $C$DW$889, DW_AT_name("CLKCTL")
    6432                      .dwattr $C$DW$889, DW_AT_TI_symbol_name("_CLKCTL")
    6433                      .dwattr $C$DW$889, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6434                      .dwattr $C$DW$889, DW_AT_accessibility(DW_ACCESS_public)
    6435              $C$DW$890       .dwtag  DW_TAG_member
    6436                      .dwattr $C$DW$890, DW_AT_type(*$C$DW$T$41)
    6437                      .dwattr $C$DW$890, DW_AT_name("rsvd_2")
    6438                      .dwattr $C$DW$890, DW_AT_TI_symbol_name("_rsvd_2")
    6439                      .dwattr $C$DW$890, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6440                      .dwattr $C$DW$890, DW_AT_accessibility(DW_ACCESS_public)
    6441              $C$DW$891       .dwtag  DW_TAG_member
    6442                      .dwattr $C$DW$891, DW_AT_type(*$C$DW$T$30)
    6443                      .dwattr $C$DW$891, DW_AT_name("LOSPCP")
    6444                      .dwattr $C$DW$891, DW_AT_TI_symbol_name("_LOSPCP")
    6445                      .dwattr $C$DW$891, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6446                      .dwattr $C$DW$891, DW_AT_accessibility(DW_ACCESS_public)
    6447              $C$DW$892       .dwtag  DW_TAG_member
    6448                      .dwattr $C$DW$892, DW_AT_type(*$C$DW$T$30)
    6449                      .dwattr $C$DW$892, DW_AT_name("PCLKCR0")
    6450                      .dwattr $C$DW$892, DW_AT_TI_symbol_name("_PCLKCR0")
    6451                      .dwattr $C$DW$892, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6452                      .dwattr $C$DW$892, DW_AT_accessibility(DW_ACCESS_public)
    6453              $C$DW$893       .dwtag  DW_TAG_member
    6454                      .dwattr $C$DW$893, DW_AT_type(*$C$DW$T$30)
    6455                      .dwattr $C$DW$893, DW_AT_name("PCLKCR1")
    6456                      .dwattr $C$DW$893, DW_AT_TI_symbol_name("_PCLKCR1")
    6457                      .dwattr $C$DW$893, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6458                      .dwattr $C$DW$893, DW_AT_accessibility(DW_ACCESS_public)
    6459              $C$DW$894       .dwtag  DW_TAG_member
    6460                      .dwattr $C$DW$894, DW_AT_type(*$C$DW$T$33)
    6461                      .dwattr $C$DW$894, DW_AT_name("rsvd_3")
    6462                      .dwattr $C$DW$894, DW_AT_TI_symbol_name("_rsvd_3")
    6463                      .dwattr $C$DW$894, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6464                      .dwattr $C$DW$894, DW_AT_accessibility(DW_ACCESS_public)
    6465              $C$DW$895       .dwtag  DW_TAG_member
    6466                      .dwattr $C$DW$895, DW_AT_type(*$C$DW$T$30)
    6467                      .dwattr $C$DW$895, DW_AT_name("PCLKCR3")
    6468                      .dwattr $C$DW$895, DW_AT_TI_symbol_name("_PCLKCR3")
    6469                      .dwattr $C$DW$895, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6470                      .dwattr $C$DW$895, DW_AT_accessibility(DW_ACCESS_public)
    6471                      .dwendtag $C$DW$T$42
    6472              
    6473              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    6474                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$42)
    6475                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    6476              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6477                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    6478                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    6479              
    6480              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6481                      .dwattr $C$DW$T$43, DW_AT_name("_CPU_Obj_")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  129

    6482                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6483              $C$DW$896       .dwtag  DW_TAG_member
    6484                      .dwattr $C$DW$896, DW_AT_type(*$C$DW$T$39)
    6485                      .dwattr $C$DW$896, DW_AT_name("tmp")
    6486                      .dwattr $C$DW$896, DW_AT_TI_symbol_name("_tmp")
    6487                      .dwattr $C$DW$896, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6488                      .dwattr $C$DW$896, DW_AT_accessibility(DW_ACCESS_public)
    6489                      .dwendtag $C$DW$T$43
    6490              
    6491              $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    6492                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$43)
    6493                      .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
    6494              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6495                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$127)
    6496                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    6497              
    6498              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    6499                      .dwattr $C$DW$T$77, DW_AT_name("_CTRL_Obj_")
    6500                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x108)
    6501              $C$DW$897       .dwtag  DW_TAG_member
    6502                      .dwattr $C$DW$897, DW_AT_type(*$C$DW$T$44)
    6503                      .dwattr $C$DW$897, DW_AT_name("version")
    6504                      .dwattr $C$DW$897, DW_AT_TI_symbol_name("_version")
    6505                      .dwattr $C$DW$897, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6506                      .dwattr $C$DW$897, DW_AT_accessibility(DW_ACCESS_public)
    6507              $C$DW$898       .dwtag  DW_TAG_member
    6508                      .dwattr $C$DW$898, DW_AT_type(*$C$DW$T$46)
    6509                      .dwattr $C$DW$898, DW_AT_name("state")
    6510                      .dwattr $C$DW$898, DW_AT_TI_symbol_name("_state")
    6511                      .dwattr $C$DW$898, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6512                      .dwattr $C$DW$898, DW_AT_accessibility(DW_ACCESS_public)
    6513              $C$DW$899       .dwtag  DW_TAG_member
    6514                      .dwattr $C$DW$899, DW_AT_type(*$C$DW$T$46)
    6515                      .dwattr $C$DW$899, DW_AT_name("prevState")
    6516                      .dwattr $C$DW$899, DW_AT_TI_symbol_name("_prevState")
    6517                      .dwattr $C$DW$899, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6518                      .dwattr $C$DW$899, DW_AT_accessibility(DW_ACCESS_public)
    6519              $C$DW$900       .dwtag  DW_TAG_member
    6520                      .dwattr $C$DW$900, DW_AT_type(*$C$DW$T$48)
    6521                      .dwattr $C$DW$900, DW_AT_name("errorCode")
    6522                      .dwattr $C$DW$900, DW_AT_TI_symbol_name("_errorCode")
    6523                      .dwattr $C$DW$900, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6524                      .dwattr $C$DW$900, DW_AT_accessibility(DW_ACCESS_public)
    6525              $C$DW$901       .dwtag  DW_TAG_member
    6526                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$50)
    6527                      .dwattr $C$DW$901, DW_AT_name("clarkeHandle_I")
    6528                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6529                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6530                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    6531              $C$DW$902       .dwtag  DW_TAG_member
    6532                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$51)
    6533                      .dwattr $C$DW$902, DW_AT_name("clarke_I")
    6534                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_clarke_I")
    6535                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6536                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  130

    6537              $C$DW$903       .dwtag  DW_TAG_member
    6538                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$50)
    6539                      .dwattr $C$DW$903, DW_AT_name("clarkeHandle_V")
    6540                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6541                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6542                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    6543              $C$DW$904       .dwtag  DW_TAG_member
    6544                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$51)
    6545                      .dwattr $C$DW$904, DW_AT_name("clarke_V")
    6546                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_clarke_V")
    6547                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6548                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    6549              $C$DW$905       .dwtag  DW_TAG_member
    6550                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$53)
    6551                      .dwattr $C$DW$905, DW_AT_name("estHandle")
    6552                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_estHandle")
    6553                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6554                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    6555              $C$DW$906       .dwtag  DW_TAG_member
    6556                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$55)
    6557                      .dwattr $C$DW$906, DW_AT_name("parkHandle")
    6558                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_parkHandle")
    6559                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6560                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    6561              $C$DW$907       .dwtag  DW_TAG_member
    6562                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$56)
    6563                      .dwattr $C$DW$907, DW_AT_name("park")
    6564                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_park")
    6565                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6566                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    6567              $C$DW$908       .dwtag  DW_TAG_member
    6568                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$58)
    6569                      .dwattr $C$DW$908, DW_AT_name("pidHandle_Id")
    6570                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_pidHandle_Id")
    6571                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6572                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    6573              $C$DW$909       .dwtag  DW_TAG_member
    6574                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$59)
    6575                      .dwattr $C$DW$909, DW_AT_name("pid_Id")
    6576                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_pid_Id")
    6577                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6578                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    6579              $C$DW$910       .dwtag  DW_TAG_member
    6580                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$58)
    6581                      .dwattr $C$DW$910, DW_AT_name("pidHandle_Iq")
    6582                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6583                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6584                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    6585              $C$DW$911       .dwtag  DW_TAG_member
    6586                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$59)
    6587                      .dwattr $C$DW$911, DW_AT_name("pid_Iq")
    6588                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_pid_Iq")
    6589                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6590                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    6591              $C$DW$912       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  131

    6592                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$58)
    6593                      .dwattr $C$DW$912, DW_AT_name("pidHandle_spd")
    6594                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_pidHandle_spd")
    6595                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6596                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    6597              $C$DW$913       .dwtag  DW_TAG_member
    6598                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$59)
    6599                      .dwattr $C$DW$913, DW_AT_name("pid_spd")
    6600                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_pid_spd")
    6601                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6602                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    6603              $C$DW$914       .dwtag  DW_TAG_member
    6604                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$61)
    6605                      .dwattr $C$DW$914, DW_AT_name("iparkHandle")
    6606                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_iparkHandle")
    6607                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6608                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    6609              $C$DW$915       .dwtag  DW_TAG_member
    6610                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$62)
    6611                      .dwattr $C$DW$915, DW_AT_name("ipark")
    6612                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_ipark")
    6613                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6614                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    6615              $C$DW$916       .dwtag  DW_TAG_member
    6616                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$64)
    6617                      .dwattr $C$DW$916, DW_AT_name("svgenHandle")
    6618                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_svgenHandle")
    6619                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6620                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    6621              $C$DW$917       .dwtag  DW_TAG_member
    6622                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$65)
    6623                      .dwattr $C$DW$917, DW_AT_name("svgen")
    6624                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_svgen")
    6625                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6626                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    6627              $C$DW$918       .dwtag  DW_TAG_member
    6628                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$67)
    6629                      .dwattr $C$DW$918, DW_AT_name("trajHandle_Id")
    6630                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_trajHandle_Id")
    6631                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6632                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    6633              $C$DW$919       .dwtag  DW_TAG_member
    6634                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$68)
    6635                      .dwattr $C$DW$919, DW_AT_name("traj_Id")
    6636                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_traj_Id")
    6637                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6638                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    6639              $C$DW$920       .dwtag  DW_TAG_member
    6640                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$67)
    6641                      .dwattr $C$DW$920, DW_AT_name("trajHandle_spd")
    6642                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_trajHandle_spd")
    6643                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6644                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    6645              $C$DW$921       .dwtag  DW_TAG_member
    6646                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  132

    6647                      .dwattr $C$DW$921, DW_AT_name("traj_spd")
    6648                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_traj_spd")
    6649                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6650                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    6651              $C$DW$922       .dwtag  DW_TAG_member
    6652                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$67)
    6653                      .dwattr $C$DW$922, DW_AT_name("trajHandle_spdMax")
    6654                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6655                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6656                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    6657              $C$DW$923       .dwtag  DW_TAG_member
    6658                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$68)
    6659                      .dwattr $C$DW$923, DW_AT_name("traj_spdMax")
    6660                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_traj_spdMax")
    6661                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6662                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    6663              $C$DW$924       .dwtag  DW_TAG_member
    6664                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$69)
    6665                      .dwattr $C$DW$924, DW_AT_name("motorParams")
    6666                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_motorParams")
    6667                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6668                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    6669              $C$DW$925       .dwtag  DW_TAG_member
    6670                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$72)
    6671                      .dwattr $C$DW$925, DW_AT_name("waitTimes")
    6672                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_waitTimes")
    6673                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6674                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    6675              $C$DW$926       .dwtag  DW_TAG_member
    6676                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$71)
    6677                      .dwattr $C$DW$926, DW_AT_name("counter_state")
    6678                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_counter_state")
    6679                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6680                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    6681              $C$DW$927       .dwtag  DW_TAG_member
    6682                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$73)
    6683                      .dwattr $C$DW$927, DW_AT_name("numIsrTicksPerCtrlTick")
    6684                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6685                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6686                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    6687              $C$DW$928       .dwtag  DW_TAG_member
    6688                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$73)
    6689                      .dwattr $C$DW$928, DW_AT_name("numCtrlTicksPerCurrentTick")
    6690                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6691                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6692                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    6693              $C$DW$929       .dwtag  DW_TAG_member
    6694                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$73)
    6695                      .dwattr $C$DW$929, DW_AT_name("numCtrlTicksPerSpeedTick")
    6696                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6697                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6698                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    6699              $C$DW$930       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$73)
    6701                      .dwattr $C$DW$930, DW_AT_name("numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  133

    6702                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6703                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6704                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    6705              $C$DW$931       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$71)
    6707                      .dwattr $C$DW$931, DW_AT_name("ctrlFreq_Hz")
    6708                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6709                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6710                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    6711              $C$DW$932       .dwtag  DW_TAG_member
    6712                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$71)
    6713                      .dwattr $C$DW$932, DW_AT_name("trajFreq_Hz")
    6714                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6715                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6716                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    6717              $C$DW$933       .dwtag  DW_TAG_member
    6718                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$38)
    6719                      .dwattr $C$DW$933, DW_AT_name("trajPeriod_sec")
    6720                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6721                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6722                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    6723              $C$DW$934       .dwtag  DW_TAG_member
    6724                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$74)
    6725                      .dwattr $C$DW$934, DW_AT_name("ctrlPeriod_sec")
    6726                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6727                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6728                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    6729              $C$DW$935       .dwtag  DW_TAG_member
    6730                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$38)
    6731                      .dwattr $C$DW$935, DW_AT_name("maxVsMag_pu")
    6732                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_maxVsMag_pu")
    6733                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6734                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    6735              $C$DW$936       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$75)
    6737                      .dwattr $C$DW$936, DW_AT_name("Iab_in")
    6738                      .dwattr $C$DW$936, DW_AT_TI_symbol_name("_Iab_in")
    6739                      .dwattr $C$DW$936, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    6740                      .dwattr $C$DW$936, DW_AT_accessibility(DW_ACCESS_public)
    6741              $C$DW$937       .dwtag  DW_TAG_member
    6742                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$75)
    6743                      .dwattr $C$DW$937, DW_AT_name("Iab_filt")
    6744                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_Iab_filt")
    6745                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    6746                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    6747              $C$DW$938       .dwtag  DW_TAG_member
    6748                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$75)
    6749                      .dwattr $C$DW$938, DW_AT_name("Idq_in")
    6750                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_Idq_in")
    6751                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    6752                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    6753              $C$DW$939       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$75)
    6755                      .dwattr $C$DW$939, DW_AT_name("Vab_in")
    6756                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_Vab_in")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  134

    6757                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    6758                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    6759              $C$DW$940       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$38)
    6761                      .dwattr $C$DW$940, DW_AT_name("spd_out")
    6762                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_spd_out")
    6763                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    6764                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    6765              $C$DW$941       .dwtag  DW_TAG_member
    6766                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$75)
    6767                      .dwattr $C$DW$941, DW_AT_name("Vab_out")
    6768                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_Vab_out")
    6769                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    6770                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    6771              $C$DW$942       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$75)
    6773                      .dwattr $C$DW$942, DW_AT_name("Vdq_out")
    6774                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_Vdq_out")
    6775                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    6776                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    6777              $C$DW$943       .dwtag  DW_TAG_member
    6778                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$74)
    6779                      .dwattr $C$DW$943, DW_AT_name("Rhf")
    6780                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_Rhf")
    6781                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    6782                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    6783              $C$DW$944       .dwtag  DW_TAG_member
    6784                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$74)
    6785                      .dwattr $C$DW$944, DW_AT_name("Lhf")
    6786                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_Lhf")
    6787                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    6788                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    6789              $C$DW$945       .dwtag  DW_TAG_member
    6790                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$74)
    6791                      .dwattr $C$DW$945, DW_AT_name("RoverL")
    6792                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_RoverL")
    6793                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    6794                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    6795              $C$DW$946       .dwtag  DW_TAG_member
    6796                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$38)
    6797                      .dwattr $C$DW$946, DW_AT_name("Kp_Id")
    6798                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_Kp_Id")
    6799                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    6800                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    6801              $C$DW$947       .dwtag  DW_TAG_member
    6802                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$38)
    6803                      .dwattr $C$DW$947, DW_AT_name("Kp_Iq")
    6804                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_Kp_Iq")
    6805                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6806                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    6807              $C$DW$948       .dwtag  DW_TAG_member
    6808                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$38)
    6809                      .dwattr $C$DW$948, DW_AT_name("Kp_spd")
    6810                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_Kp_spd")
    6811                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  135

    6812                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    6813              $C$DW$949       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$38)
    6815                      .dwattr $C$DW$949, DW_AT_name("Ki_Id")
    6816                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_Ki_Id")
    6817                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    6818                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    6819              $C$DW$950       .dwtag  DW_TAG_member
    6820                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$38)
    6821                      .dwattr $C$DW$950, DW_AT_name("Ki_Iq")
    6822                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_Ki_Iq")
    6823                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    6824                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    6825              $C$DW$951       .dwtag  DW_TAG_member
    6826                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$38)
    6827                      .dwattr $C$DW$951, DW_AT_name("Ki_spd")
    6828                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_Ki_spd")
    6829                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6830                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    6831              $C$DW$952       .dwtag  DW_TAG_member
    6832                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$38)
    6833                      .dwattr $C$DW$952, DW_AT_name("Kd_Id")
    6834                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_Kd_Id")
    6835                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    6836                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    6837              $C$DW$953       .dwtag  DW_TAG_member
    6838                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$38)
    6839                      .dwattr $C$DW$953, DW_AT_name("Kd_Iq")
    6840                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_Kd_Iq")
    6841                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    6842                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    6843              $C$DW$954       .dwtag  DW_TAG_member
    6844                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$38)
    6845                      .dwattr $C$DW$954, DW_AT_name("Kd_spd")
    6846                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_Kd_spd")
    6847                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    6848                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    6849              $C$DW$955       .dwtag  DW_TAG_member
    6850                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$38)
    6851                      .dwattr $C$DW$955, DW_AT_name("Ui_Id")
    6852                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_Ui_Id")
    6853                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6854                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    6855              $C$DW$956       .dwtag  DW_TAG_member
    6856                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$38)
    6857                      .dwattr $C$DW$956, DW_AT_name("Ui_Iq")
    6858                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_Ui_Iq")
    6859                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    6860                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    6861              $C$DW$957       .dwtag  DW_TAG_member
    6862                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$38)
    6863                      .dwattr $C$DW$957, DW_AT_name("Ui_spd")
    6864                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_Ui_spd")
    6865                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    6866                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  136

    6867              $C$DW$958       .dwtag  DW_TAG_member
    6868                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$75)
    6869                      .dwattr $C$DW$958, DW_AT_name("Idq_ref")
    6870                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_Idq_ref")
    6871                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    6872                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    6873              $C$DW$959       .dwtag  DW_TAG_member
    6874                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$38)
    6875                      .dwattr $C$DW$959, DW_AT_name("IdRated")
    6876                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_IdRated")
    6877                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    6878                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    6879              $C$DW$960       .dwtag  DW_TAG_member
    6880                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$38)
    6881                      .dwattr $C$DW$960, DW_AT_name("spd_ref")
    6882                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_spd_ref")
    6883                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    6884                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    6885              $C$DW$961       .dwtag  DW_TAG_member
    6886                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$38)
    6887                      .dwattr $C$DW$961, DW_AT_name("spd_max")
    6888                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_spd_max")
    6889                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    6890                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    6891              $C$DW$962       .dwtag  DW_TAG_member
    6892                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$73)
    6893                      .dwattr $C$DW$962, DW_AT_name("counter_current")
    6894                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_counter_current")
    6895                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    6896                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    6897              $C$DW$963       .dwtag  DW_TAG_member
    6898                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$73)
    6899                      .dwattr $C$DW$963, DW_AT_name("counter_isr")
    6900                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_counter_isr")
    6901                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    6902                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    6903              $C$DW$964       .dwtag  DW_TAG_member
    6904                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$73)
    6905                      .dwattr $C$DW$964, DW_AT_name("counter_speed")
    6906                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_counter_speed")
    6907                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    6908                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    6909              $C$DW$965       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$73)
    6911                      .dwattr $C$DW$965, DW_AT_name("counter_traj")
    6912                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_counter_traj")
    6913                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    6914                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
    6915              $C$DW$966       .dwtag  DW_TAG_member
    6916                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$76)
    6917                      .dwattr $C$DW$966, DW_AT_name("flag_enableCtrl")
    6918                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_flag_enableCtrl")
    6919                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    6920                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    6921              $C$DW$967       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  137

    6922                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$76)
    6923                      .dwattr $C$DW$967, DW_AT_name("flag_enableDcBusComp")
    6924                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    6925                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    6926                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    6927              $C$DW$968       .dwtag  DW_TAG_member
    6928                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$76)
    6929                      .dwattr $C$DW$968, DW_AT_name("flag_enablePowerWarp")
    6930                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    6931                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    6932                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    6933              $C$DW$969       .dwtag  DW_TAG_member
    6934                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$76)
    6935                      .dwattr $C$DW$969, DW_AT_name("flag_enableOffset")
    6936                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_flag_enableOffset")
    6937                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    6938                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    6939              $C$DW$970       .dwtag  DW_TAG_member
    6940                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$76)
    6941                      .dwattr $C$DW$970, DW_AT_name("flag_enableSpeedCtrl")
    6942                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    6943                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    6944                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    6945              $C$DW$971       .dwtag  DW_TAG_member
    6946                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$76)
    6947                      .dwattr $C$DW$971, DW_AT_name("flag_enableUserMotorParams")
    6948                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    6949                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    6950                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    6951              $C$DW$972       .dwtag  DW_TAG_member
    6952                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$75)
    6953                      .dwattr $C$DW$972, DW_AT_name("Idq_offset_pu")
    6954                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_Idq_offset_pu")
    6955                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    6956                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    6957              $C$DW$973       .dwtag  DW_TAG_member
    6958                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$75)
    6959                      .dwattr $C$DW$973, DW_AT_name("Vdq_offset_pu")
    6960                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    6961                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    6962                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    6963              $C$DW$974       .dwtag  DW_TAG_member
    6964                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$38)
    6965                      .dwattr $C$DW$974, DW_AT_name("angle_pu")
    6966                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_angle_pu")
    6967                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    6968                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    6969              $C$DW$975       .dwtag  DW_TAG_member
    6970                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$38)
    6971                      .dwattr $C$DW$975, DW_AT_name("speed_ref_pu")
    6972                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_speed_ref_pu")
    6973                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    6974                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    6975              $C$DW$976       .dwtag  DW_TAG_member
    6976                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  138

    6977                      .dwattr $C$DW$976, DW_AT_name("speed_fb_pu")
    6978                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_speed_fb_pu")
    6979                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    6980                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    6981              $C$DW$977       .dwtag  DW_TAG_member
    6982                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$38)
    6983                      .dwattr $C$DW$977, DW_AT_name("speed_outMax_pu")
    6984                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_speed_outMax_pu")
    6985                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6986                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    6987              $C$DW$978       .dwtag  DW_TAG_member
    6988                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$76)
    6989                      .dwattr $C$DW$978, DW_AT_name("flag_enableCurrentCtrl")
    6990                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    6991                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    6992                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    6993                      .dwendtag $C$DW$T$77
    6994              
    6995              $C$DW$T$248     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    6996                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$77)
    6997                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    6998              $C$DW$T$249     .dwtag  DW_TAG_pointer_type
    6999                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$248)
    7000                      .dwattr $C$DW$T$249, DW_AT_address_class(0x20)
    7001              $C$DW$T$202     .dwtag  DW_TAG_pointer_type
    7002                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$77)
    7003                      .dwattr $C$DW$T$202, DW_AT_address_class(0x20)
    7004              $C$DW$T$203     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7005                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
    7006                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    7007              $C$DW$979       .dwtag  DW_TAG_TI_far_type
    7008                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$203)
    7009              $C$DW$T$250     .dwtag  DW_TAG_const_type
    7010                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$979)
    7011              
    7012              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7013                      .dwattr $C$DW$T$80, DW_AT_name("_CTRL_Version_")
    7014                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    7015              $C$DW$980       .dwtag  DW_TAG_member
    7016                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$29)
    7017                      .dwattr $C$DW$980, DW_AT_name("rsvd")
    7018                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_rsvd")
    7019                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7020                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    7021              $C$DW$981       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$79)
    7023                      .dwattr $C$DW$981, DW_AT_name("targetProc")
    7024                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_targetProc")
    7025                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7026                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    7027              $C$DW$982       .dwtag  DW_TAG_member
    7028                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$29)
    7029                      .dwattr $C$DW$982, DW_AT_name("major")
    7030                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_major")
    7031                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  139

    7032                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    7033              $C$DW$983       .dwtag  DW_TAG_member
    7034                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$29)
    7035                      .dwattr $C$DW$983, DW_AT_name("minor")
    7036                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_minor")
    7037                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7038                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    7039                      .dwendtag $C$DW$T$80
    7040              
    7041              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7042                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$80)
    7043                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    7044              $C$DW$T$256     .dwtag  DW_TAG_pointer_type
    7045                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$44)
    7046                      .dwattr $C$DW$T$256, DW_AT_address_class(0x20)
    7047              
    7048              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7049                      .dwattr $C$DW$T$87, DW_AT_name("_DRV8301_Obj_")
    7050                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
    7051              $C$DW$984       .dwtag  DW_TAG_member
    7052                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$82)
    7053                      .dwattr $C$DW$984, DW_AT_name("spiHandle")
    7054                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_spiHandle")
    7055                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7056                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    7057              $C$DW$985       .dwtag  DW_TAG_member
    7058                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$84)
    7059                      .dwattr $C$DW$985, DW_AT_name("gpioHandle")
    7060                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_gpioHandle")
    7061                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7062                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$986       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$86)
    7065                      .dwattr $C$DW$986, DW_AT_name("gpioNumber")
    7066                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_gpioNumber")
    7067                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7068                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    7069              $C$DW$987       .dwtag  DW_TAG_member
    7070                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$76)
    7071                      .dwattr $C$DW$987, DW_AT_name("RxTimeOut")
    7072                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_RxTimeOut")
    7073                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7074                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    7075              $C$DW$988       .dwtag  DW_TAG_member
    7076                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$76)
    7077                      .dwattr $C$DW$988, DW_AT_name("enableTimeOut")
    7078                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_enableTimeOut")
    7079                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7080                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    7081                      .dwendtag $C$DW$T$87
    7082              
    7083              $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    7084                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$87)
    7085                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    7086              $C$DW$T$153     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  140

    7087                      .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$87)
    7088                      .dwattr $C$DW$T$153, DW_AT_address_class(0x20)
    7089              $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    7090                      .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)
    7091                      .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    7092              
    7093              $C$DW$T$98      .dwtag  DW_TAG_structure_type
    7094                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    7095                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x05)
    7096              $C$DW$989       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$89)
    7098                      .dwattr $C$DW$989, DW_AT_name("DRV8301_CURRENT")
    7099                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    7100                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7101                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$990       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$91)
    7104                      .dwattr $C$DW$990, DW_AT_name("DRV8301_RESET")
    7105                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_DRV8301_RESET")
    7106                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7107                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$991       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$93)
    7110                      .dwattr $C$DW$991, DW_AT_name("PWM_MODE")
    7111                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_PWM_MODE")
    7112                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7113                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$992       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$95)
    7116                      .dwattr $C$DW$992, DW_AT_name("OC_MODE")
    7117                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_OC_MODE")
    7118                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7119                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$993       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$97)
    7122                      .dwattr $C$DW$993, DW_AT_name("OC_ADJ_SET")
    7123                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    7124                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7125                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    7126                      .dwendtag $C$DW$T$98
    7127              
    7128              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    7129                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$98)
    7130                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    7131              
    7132              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    7133                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    7134                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x04)
    7135              $C$DW$994       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$100)
    7137                      .dwattr $C$DW$994, DW_AT_name("OCTW_SET")
    7138                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_OCTW_SET")
    7139                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7140                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$995       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  141

    7142                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$102)
    7143                      .dwattr $C$DW$995, DW_AT_name("GAIN")
    7144                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_GAIN")
    7145                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7146                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$996       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$104)
    7149                      .dwattr $C$DW$996, DW_AT_name("DC_CAL_CH1p2")
    7150                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    7151                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7152                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    7153              $C$DW$997       .dwtag  DW_TAG_member
    7154                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$106)
    7155                      .dwattr $C$DW$997, DW_AT_name("OC_TOFF")
    7156                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_OC_TOFF")
    7157                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7158                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    7159                      .dwendtag $C$DW$T$107
    7160              
    7161              $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    7162                      .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$107)
    7163                      .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    7164              
    7165              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    7166                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    7167                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x0b)
    7168              $C$DW$998       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$76)
    7170                      .dwattr $C$DW$998, DW_AT_name("FAULT")
    7171                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_FAULT")
    7172                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7173                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    7174              $C$DW$999       .dwtag  DW_TAG_member
    7175                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$76)
    7176                      .dwattr $C$DW$999, DW_AT_name("GVDD_UV")
    7177                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_GVDD_UV")
    7178                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7179                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    7180              $C$DW$1000      .dwtag  DW_TAG_member
    7181                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$76)
    7182                      .dwattr $C$DW$1000, DW_AT_name("PVDD_UV")
    7183                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_PVDD_UV")
    7184                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7185                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    7186              $C$DW$1001      .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$76)
    7188                      .dwattr $C$DW$1001, DW_AT_name("OTSD")
    7189                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_OTSD")
    7190                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7191                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    7192              $C$DW$1002      .dwtag  DW_TAG_member
    7193                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$76)
    7194                      .dwattr $C$DW$1002, DW_AT_name("OTW")
    7195                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_OTW")
    7196                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  142

    7197                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    7198              $C$DW$1003      .dwtag  DW_TAG_member
    7199                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$76)
    7200                      .dwattr $C$DW$1003, DW_AT_name("FETHA_OC")
    7201                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_FETHA_OC")
    7202                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7203                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    7204              $C$DW$1004      .dwtag  DW_TAG_member
    7205                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$76)
    7206                      .dwattr $C$DW$1004, DW_AT_name("FETLA_OC")
    7207                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_FETLA_OC")
    7208                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7209                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    7210              $C$DW$1005      .dwtag  DW_TAG_member
    7211                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$76)
    7212                      .dwattr $C$DW$1005, DW_AT_name("FETHB_OC")
    7213                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_FETHB_OC")
    7214                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7215                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    7216              $C$DW$1006      .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$76)
    7218                      .dwattr $C$DW$1006, DW_AT_name("FETLB_OC")
    7219                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_FETLB_OC")
    7220                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7221                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    7222              $C$DW$1007      .dwtag  DW_TAG_member
    7223                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$76)
    7224                      .dwattr $C$DW$1007, DW_AT_name("FETHC_OC")
    7225                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_FETHC_OC")
    7226                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7227                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    7228              $C$DW$1008      .dwtag  DW_TAG_member
    7229                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$76)
    7230                      .dwattr $C$DW$1008, DW_AT_name("FETLC_OC")
    7231                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_FETLC_OC")
    7232                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7233                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    7234                      .dwendtag $C$DW$T$108
    7235              
    7236              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    7237                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$108)
    7238                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7239              
    7240              $C$DW$T$109     .dwtag  DW_TAG_structure_type
    7241                      .dwattr $C$DW$T$109, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    7242                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x02)
    7243              $C$DW$1009      .dwtag  DW_TAG_member
    7244                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$76)
    7245                      .dwattr $C$DW$1009, DW_AT_name("GVDD_OV")
    7246                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_GVDD_OV")
    7247                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7248                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    7249              $C$DW$1010      .dwtag  DW_TAG_member
    7250                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$29)
    7251                      .dwattr $C$DW$1010, DW_AT_name("DeviceID")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:37 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2692010                            PAGE  143

    7252                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_DeviceID")
    7253                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7254                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    7255                      .dwendtag $C$DW$T$109
    7256              
    7257              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    7258                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$109)
    7259                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    7260              
    7261              $C$DW$T$114     .dwtag  DW_TAG_structure_type
    7262                      .dwattr $C$DW$T$114, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    7263                      .dwattr $C$DW$T$114, DW_AT_byte_size(0x18)
    7264              $C$DW$1011      .dwtag  DW_TAG_member
    7265                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$110)
    7266                      .dwattr $C$DW$1011, DW_AT_name("Stat_Reg_1")
    7267                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_Stat_Reg_1")
    7268                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7269                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    7270              $C$DW$1012      .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$111)
    7272                      .dwattr $C$DW$1012, DW_AT_name("Stat_Reg_2")
    7273                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_Stat_Reg_2")
    7274                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7275                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    7276              $C$DW$1013      .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$112)
    7278                      .dwattr $C$DW$1013, DW_AT_name("Ctrl_Reg_1")
    7279                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    7280                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7281                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    7282              $C$DW$1014      .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$113)
    7284                      .dwattr $C$DW$1014, DW_AT_name("Ctrl_Reg_2")
    7285                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    7286                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7287                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    7288              $C$DW$1015      .dwtag  DW_TAG_member
    7289                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$76)
    7290                      .dwattr $C$DW$1015, DW_AT_name("SndCmd")
    7291                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_SndCmd")
    7292                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7293                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    7294              $C$DW$1016      .dwtag  DW_TAG_member
    7295                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$76)
    7296                      .dwattr $C$DW$1016, DW_AT_name("RcvCmd")
    7297                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_RcvCmd")
    7298                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7299                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    7300                      .dwendtag $C$DW$T$114
    7301              
