TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:19 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6522              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6523              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6524              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6525              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6526              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6527              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6528              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6529              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6530              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6531              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6532              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6533                      .dwendtag $C$DW$T$183
    6534              
    6535              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6536                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    6537                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    6538              
    6539              $C$DW$T$193     .dwtag  DW_TAG_enumeration_type
    6540                      .dwattr $C$DW$T$193, DW_AT_byte_size(0x01)
    6541              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6542              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6543              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6544              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6545              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6546              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6547              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6548              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6549              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6550              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6551              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6552              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6553              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6554              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6555              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6556                      .dwendtag $C$DW$T$193
    6557              
    6558              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6559                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$193)
    6560                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    6561              
    6562              $C$DW$T$198     .dwtag  DW_TAG_enumeration_type
    6563                      .dwattr $C$DW$T$198, DW_AT_byte_size(0x01)
    6564              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6565              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6566              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6567                      .dwendtag $C$DW$T$198
    6568              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  127

    6569              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6570                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    6571                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    6572              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    6573                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$199)
    6574              $C$DW$T$200     .dwtag  DW_TAG_const_type
    6575                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$678)
    6576              
    6577              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6578                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_BITS")
    6579                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    6580              $C$DW$679       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$22)
    6582                      .dwattr $C$DW$679, DW_AT_name("BCM")
    6583                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_BCM")
    6584                      .dwattr $C$DW$679, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6585                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6586                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6587              $C$DW$680       .dwtag  DW_TAG_member
    6588                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$22)
    6589                      .dwattr $C$DW$680, DW_AT_name("rsvd1")
    6590                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_rsvd1")
    6591                      .dwattr $C$DW$680, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    6592                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6593                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6594                      .dwendtag $C$DW$T$23
    6595              
    6596              
    6597              $C$DW$T$24      .dwtag  DW_TAG_union_type
    6598                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_REG")
    6599                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    6600              $C$DW$681       .dwtag  DW_TAG_member
    6601                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$22)
    6602                      .dwattr $C$DW$681, DW_AT_name("all")
    6603                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_all")
    6604                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6605                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6606              $C$DW$682       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    6608                      .dwattr $C$DW$682, DW_AT_name("bit")
    6609                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_bit")
    6610                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6611                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6612                      .dwendtag $C$DW$T$24
    6613              
    6614              
    6615              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6616                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_BITS")
    6617                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    6618              $C$DW$683       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$22)
    6620                      .dwattr $C$DW$683, DW_AT_name("RXFFIL")
    6621                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_RXFFIL")
    6622                      .dwattr $C$DW$683, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    6623                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  128

    6624                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6625              $C$DW$684       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$22)
    6627                      .dwattr $C$DW$684, DW_AT_name("RXFFIENA")
    6628                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_RXFFIENA")
    6629                      .dwattr $C$DW$684, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6630                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6631                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6632              $C$DW$685       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$22)
    6634                      .dwattr $C$DW$685, DW_AT_name("RXFFINTCLR")
    6635                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_RXFFINTCLR")
    6636                      .dwattr $C$DW$685, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6637                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6638                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6639              $C$DW$686       .dwtag  DW_TAG_member
    6640                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$22)
    6641                      .dwattr $C$DW$686, DW_AT_name("RXFFINT")
    6642                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_RXFFINT")
    6643                      .dwattr $C$DW$686, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6644                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6645                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$687       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$22)
    6648                      .dwattr $C$DW$687, DW_AT_name("RXFFST")
    6649                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_RXFFST")
    6650                      .dwattr $C$DW$687, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    6651                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6652                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6653              $C$DW$688       .dwtag  DW_TAG_member
    6654                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$22)
    6655                      .dwattr $C$DW$688, DW_AT_name("RXFFRST")
    6656                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_RXFFRST")
    6657                      .dwattr $C$DW$688, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    6658                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6659                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6660              $C$DW$689       .dwtag  DW_TAG_member
    6661                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$22)
    6662                      .dwattr $C$DW$689, DW_AT_name("rsvd1")
    6663                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd1")
    6664                      .dwattr $C$DW$689, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    6665                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6666                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6667                      .dwendtag $C$DW$T$25
    6668              
    6669              
    6670              $C$DW$T$26      .dwtag  DW_TAG_union_type
    6671                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_REG")
    6672                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    6673              $C$DW$690       .dwtag  DW_TAG_member
    6674                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$22)
    6675                      .dwattr $C$DW$690, DW_AT_name("all")
    6676                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_all")
    6677                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6678                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  129

    6679              $C$DW$691       .dwtag  DW_TAG_member
    6680                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$25)
    6681                      .dwattr $C$DW$691, DW_AT_name("bit")
    6682                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_bit")
    6683                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6684                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6685                      .dwendtag $C$DW$T$26
    6686              
    6687              
    6688              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6689                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_BITS")
    6690                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    6691              $C$DW$692       .dwtag  DW_TAG_member
    6692                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$22)
    6693                      .dwattr $C$DW$692, DW_AT_name("TXFFIL")
    6694                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_TXFFIL")
    6695                      .dwattr $C$DW$692, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    6696                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6697                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6698              $C$DW$693       .dwtag  DW_TAG_member
    6699                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$22)
    6700                      .dwattr $C$DW$693, DW_AT_name("TXFFIENA")
    6701                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_TXFFIENA")
    6702                      .dwattr $C$DW$693, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6703                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6704                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6705              $C$DW$694       .dwtag  DW_TAG_member
    6706                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$22)
    6707                      .dwattr $C$DW$694, DW_AT_name("TXFFINTCLR")
    6708                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_TXFFINTCLR")
    6709                      .dwattr $C$DW$694, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6710                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6711                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$695       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$22)
    6714                      .dwattr $C$DW$695, DW_AT_name("TXFFINT")
    6715                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_TXFFINT")
    6716                      .dwattr $C$DW$695, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6717                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6718                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6719              $C$DW$696       .dwtag  DW_TAG_member
    6720                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$22)
    6721                      .dwattr $C$DW$696, DW_AT_name("TXFFST")
    6722                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_TXFFST")
    6723                      .dwattr $C$DW$696, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    6724                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6725                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6726              $C$DW$697       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$22)
    6728                      .dwattr $C$DW$697, DW_AT_name("TXFFRST")
    6729                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_TXFFRST")
    6730                      .dwattr $C$DW$697, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    6731                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6732                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6733              $C$DW$698       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  130

    6734                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$22)
    6735                      .dwattr $C$DW$698, DW_AT_name("I2CFFEN")
    6736                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_I2CFFEN")
    6737                      .dwattr $C$DW$698, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    6738                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6739                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6740              $C$DW$699       .dwtag  DW_TAG_member
    6741                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$22)
    6742                      .dwattr $C$DW$699, DW_AT_name("rsvd1")
    6743                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_rsvd1")
    6744                      .dwattr $C$DW$699, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    6745                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6746                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6747                      .dwendtag $C$DW$T$27
    6748              
    6749              
    6750              $C$DW$T$28      .dwtag  DW_TAG_union_type
    6751                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_REG")
    6752                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    6753              $C$DW$700       .dwtag  DW_TAG_member
    6754                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$22)
    6755                      .dwattr $C$DW$700, DW_AT_name("all")
    6756                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_all")
    6757                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6758                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6759              $C$DW$701       .dwtag  DW_TAG_member
    6760                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$27)
    6761                      .dwattr $C$DW$701, DW_AT_name("bit")
    6762                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_bit")
    6763                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6764                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6765                      .dwendtag $C$DW$T$28
    6766              
    6767              
    6768              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6769                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_BITS")
    6770                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    6771              $C$DW$702       .dwtag  DW_TAG_member
    6772                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$22)
    6773                      .dwattr $C$DW$702, DW_AT_name("ARBL")
    6774                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_ARBL")
    6775                      .dwattr $C$DW$702, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    6776                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6777                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6778              $C$DW$703       .dwtag  DW_TAG_member
    6779                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$22)
    6780                      .dwattr $C$DW$703, DW_AT_name("NACK")
    6781                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_NACK")
    6782                      .dwattr $C$DW$703, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    6783                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6784                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6785              $C$DW$704       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$22)
    6787                      .dwattr $C$DW$704, DW_AT_name("ARDY")
    6788                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ARDY")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  131

    6789                      .dwattr $C$DW$704, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    6790                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6791                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6792              $C$DW$705       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$22)
    6794                      .dwattr $C$DW$705, DW_AT_name("RRDY")
    6795                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_RRDY")
    6796                      .dwattr $C$DW$705, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6797                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6798                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6799              $C$DW$706       .dwtag  DW_TAG_member
    6800                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$22)
    6801                      .dwattr $C$DW$706, DW_AT_name("XRDY")
    6802                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_XRDY")
    6803                      .dwattr $C$DW$706, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    6804                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6805                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$707       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$22)
    6808                      .dwattr $C$DW$707, DW_AT_name("SCD")
    6809                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_SCD")
    6810                      .dwattr $C$DW$707, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6811                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6812                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6813              $C$DW$708       .dwtag  DW_TAG_member
    6814                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$22)
    6815                      .dwattr $C$DW$708, DW_AT_name("AAS")
    6816                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_AAS")
    6817                      .dwattr $C$DW$708, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6818                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6819                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6820              $C$DW$709       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$22)
    6822                      .dwattr $C$DW$709, DW_AT_name("rsvd")
    6823                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd")
    6824                      .dwattr $C$DW$709, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    6825                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6826                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6827                      .dwendtag $C$DW$T$29
    6828              
    6829              
    6830              $C$DW$T$30      .dwtag  DW_TAG_union_type
    6831                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_REG")
    6832                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    6833              $C$DW$710       .dwtag  DW_TAG_member
    6834                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$22)
    6835                      .dwattr $C$DW$710, DW_AT_name("all")
    6836                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_all")
    6837                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6838                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6839              $C$DW$711       .dwtag  DW_TAG_member
    6840                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$29)
    6841                      .dwattr $C$DW$711, DW_AT_name("bit")
    6842                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_bit")
    6843                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  132

    6844                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6845                      .dwendtag $C$DW$T$30
    6846              
    6847              
    6848              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6849                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_BITS")
    6850                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    6851              $C$DW$712       .dwtag  DW_TAG_member
    6852                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$22)
    6853                      .dwattr $C$DW$712, DW_AT_name("INTCODE")
    6854                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_INTCODE")
    6855                      .dwattr $C$DW$712, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    6856                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6857                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6858              $C$DW$713       .dwtag  DW_TAG_member
    6859                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$22)
    6860                      .dwattr $C$DW$713, DW_AT_name("rsvd1")
    6861                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_rsvd1")
    6862                      .dwattr $C$DW$713, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    6863                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6864                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6865                      .dwendtag $C$DW$T$31
    6866              
    6867              
    6868              $C$DW$T$32      .dwtag  DW_TAG_union_type
    6869                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_REG")
    6870                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    6871              $C$DW$714       .dwtag  DW_TAG_member
    6872                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$22)
    6873                      .dwattr $C$DW$714, DW_AT_name("all")
    6874                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_all")
    6875                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6876                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6877              $C$DW$715       .dwtag  DW_TAG_member
    6878                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$31)
    6879                      .dwattr $C$DW$715, DW_AT_name("bit")
    6880                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_bit")
    6881                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6882                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6883                      .dwendtag $C$DW$T$32
    6884              
    6885              
    6886              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6887                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_BITS")
    6888                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    6889              $C$DW$716       .dwtag  DW_TAG_member
    6890                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$22)
    6891                      .dwattr $C$DW$716, DW_AT_name("BC")
    6892                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_BC")
    6893                      .dwattr $C$DW$716, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    6894                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6895                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6896              $C$DW$717       .dwtag  DW_TAG_member
    6897                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$22)
    6898                      .dwattr $C$DW$717, DW_AT_name("FDF")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  133

    6899                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_FDF")
    6900                      .dwattr $C$DW$717, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    6901                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6902                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6903              $C$DW$718       .dwtag  DW_TAG_member
    6904                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$22)
    6905                      .dwattr $C$DW$718, DW_AT_name("STB")
    6906                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_STB")
    6907                      .dwattr $C$DW$718, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    6908                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6909                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$719       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    6912                      .dwattr $C$DW$719, DW_AT_name("IRS")
    6913                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_IRS")
    6914                      .dwattr $C$DW$719, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    6915                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6916                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6917              $C$DW$720       .dwtag  DW_TAG_member
    6918                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
    6919                      .dwattr $C$DW$720, DW_AT_name("DLB")
    6920                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_DLB")
    6921                      .dwattr $C$DW$720, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    6922                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6923                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$721       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    6926                      .dwattr $C$DW$721, DW_AT_name("RM")
    6927                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_RM")
    6928                      .dwattr $C$DW$721, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    6929                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6930                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6931              $C$DW$722       .dwtag  DW_TAG_member
    6932                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
    6933                      .dwattr $C$DW$722, DW_AT_name("XA")
    6934                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_XA")
    6935                      .dwattr $C$DW$722, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    6936                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6937                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6938              $C$DW$723       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$22)
    6940                      .dwattr $C$DW$723, DW_AT_name("TRX")
    6941                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_TRX")
    6942                      .dwattr $C$DW$723, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    6943                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6944                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6945              $C$DW$724       .dwtag  DW_TAG_member
    6946                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$22)
    6947                      .dwattr $C$DW$724, DW_AT_name("MST")
    6948                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_MST")
    6949                      .dwattr $C$DW$724, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    6950                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6951                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$725       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  134

    6954                      .dwattr $C$DW$725, DW_AT_name("STP")
    6955                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_STP")
    6956                      .dwattr $C$DW$725, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    6957                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6958                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6959              $C$DW$726       .dwtag  DW_TAG_member
    6960                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$22)
    6961                      .dwattr $C$DW$726, DW_AT_name("rsvd1")
    6962                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_rsvd1")
    6963                      .dwattr $C$DW$726, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    6964                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6965                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6966              $C$DW$727       .dwtag  DW_TAG_member
    6967                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$22)
    6968                      .dwattr $C$DW$727, DW_AT_name("STT")
    6969                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_STT")
    6970                      .dwattr $C$DW$727, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    6971                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6972                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6973              $C$DW$728       .dwtag  DW_TAG_member
    6974                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$22)
    6975                      .dwattr $C$DW$728, DW_AT_name("FREE")
    6976                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_FREE")
    6977                      .dwattr $C$DW$728, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    6978                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6979                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6980              $C$DW$729       .dwtag  DW_TAG_member
    6981                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$22)
    6982                      .dwattr $C$DW$729, DW_AT_name("NACKMOD")
    6983                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_NACKMOD")
    6984                      .dwattr $C$DW$729, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    6985                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6986                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6987                      .dwendtag $C$DW$T$33
    6988              
    6989              
    6990              $C$DW$T$34      .dwtag  DW_TAG_union_type
    6991                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_REG")
    6992                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6993              $C$DW$730       .dwtag  DW_TAG_member
    6994                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$22)
    6995                      .dwattr $C$DW$730, DW_AT_name("all")
    6996                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_all")
    6997                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6998                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6999              $C$DW$731       .dwtag  DW_TAG_member
    7000                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$33)
    7001                      .dwattr $C$DW$731, DW_AT_name("bit")
    7002                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_bit")
    7003                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7004                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7005                      .dwendtag $C$DW$T$34
    7006              
    7007              
    7008              $C$DW$T$35      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  135

    7009                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_BITS")
    7010                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    7011              $C$DW$732       .dwtag  DW_TAG_member
    7012                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$22)
    7013                      .dwattr $C$DW$732, DW_AT_name("IPSC")
    7014                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_IPSC")
    7015                      .dwattr $C$DW$732, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    7016                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7017                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7018              $C$DW$733       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$22)
    7020                      .dwattr $C$DW$733, DW_AT_name("rsvd1")
    7021                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_rsvd1")
    7022                      .dwattr $C$DW$733, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    7023                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7024                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7025                      .dwendtag $C$DW$T$35
    7026              
    7027              
    7028              $C$DW$T$36      .dwtag  DW_TAG_union_type
    7029                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_REG")
    7030                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    7031              $C$DW$734       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$22)
    7033                      .dwattr $C$DW$734, DW_AT_name("all")
    7034                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_all")
    7035                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7036                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7037              $C$DW$735       .dwtag  DW_TAG_member
    7038                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$35)
    7039                      .dwattr $C$DW$735, DW_AT_name("bit")
    7040                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_bit")
    7041                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7042                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7043                      .dwendtag $C$DW$T$36
    7044              
    7045              
    7046              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7047                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_BITS")
    7048                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    7049              $C$DW$736       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$22)
    7051                      .dwattr $C$DW$736, DW_AT_name("ARBL")
    7052                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_ARBL")
    7053                      .dwattr $C$DW$736, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    7054                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7055                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7056              $C$DW$737       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$22)
    7058                      .dwattr $C$DW$737, DW_AT_name("NACK")
    7059                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_NACK")
    7060                      .dwattr $C$DW$737, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    7061                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7062                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7063              $C$DW$738       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  136

    7064                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$22)
    7065                      .dwattr $C$DW$738, DW_AT_name("ARDY")
    7066                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_ARDY")
    7067                      .dwattr $C$DW$738, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    7068                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7069                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7070              $C$DW$739       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$22)
    7072                      .dwattr $C$DW$739, DW_AT_name("RRDY")
    7073                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_RRDY")
    7074                      .dwattr $C$DW$739, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    7075                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7076                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7077              $C$DW$740       .dwtag  DW_TAG_member
    7078                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$22)
    7079                      .dwattr $C$DW$740, DW_AT_name("XRDY")
    7080                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_XRDY")
    7081                      .dwattr $C$DW$740, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    7082                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7083                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7084              $C$DW$741       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$22)
    7086                      .dwattr $C$DW$741, DW_AT_name("SCD")
    7087                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_SCD")
    7088                      .dwattr $C$DW$741, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    7089                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7090                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7091              $C$DW$742       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$22)
    7093                      .dwattr $C$DW$742, DW_AT_name("rsvd1")
    7094                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_rsvd1")
    7095                      .dwattr $C$DW$742, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    7096                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7097                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7098              $C$DW$743       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$22)
    7100                      .dwattr $C$DW$743, DW_AT_name("AD0")
    7101                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_AD0")
    7102                      .dwattr $C$DW$743, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    7103                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7104                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7105              $C$DW$744       .dwtag  DW_TAG_member
    7106                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$22)
    7107                      .dwattr $C$DW$744, DW_AT_name("AAS")
    7108                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_AAS")
    7109                      .dwattr $C$DW$744, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    7110                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7111                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7112              $C$DW$745       .dwtag  DW_TAG_member
    7113                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$22)
    7114                      .dwattr $C$DW$745, DW_AT_name("XSMT")
    7115                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_XSMT")
    7116                      .dwattr $C$DW$745, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    7117                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7118                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  137

    7119              $C$DW$746       .dwtag  DW_TAG_member
    7120                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$22)
    7121                      .dwattr $C$DW$746, DW_AT_name("RSFULL")
    7122                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_RSFULL")
    7123                      .dwattr $C$DW$746, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    7124                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7125                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7126              $C$DW$747       .dwtag  DW_TAG_member
    7127                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$22)
    7128                      .dwattr $C$DW$747, DW_AT_name("BB")
    7129                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_BB")
    7130                      .dwattr $C$DW$747, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    7131                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7132                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7133              $C$DW$748       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$22)
    7135                      .dwattr $C$DW$748, DW_AT_name("NACKSNT")
    7136                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_NACKSNT")
    7137                      .dwattr $C$DW$748, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    7138                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7139                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7140              $C$DW$749       .dwtag  DW_TAG_member
    7141                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$22)
    7142                      .dwattr $C$DW$749, DW_AT_name("SDIR")
    7143                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_SDIR")
    7144                      .dwattr $C$DW$749, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    7145                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7146                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$750       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$22)
    7149                      .dwattr $C$DW$750, DW_AT_name("rsvd2")
    7150                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_rsvd2")
    7151                      .dwattr $C$DW$750, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    7152                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7153                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7154                      .dwendtag $C$DW$T$37
    7155              
    7156              
    7157              $C$DW$T$38      .dwtag  DW_TAG_union_type
    7158                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_REG")
    7159                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    7160              $C$DW$751       .dwtag  DW_TAG_member
    7161                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$22)
    7162                      .dwattr $C$DW$751, DW_AT_name("all")
    7163                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_all")
    7164                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7165                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7166              $C$DW$752       .dwtag  DW_TAG_member
    7167                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$37)
    7168                      .dwattr $C$DW$752, DW_AT_name("bit")
    7169                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_bit")
    7170                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7171                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7172                      .dwendtag $C$DW$T$38
    7173              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  138

    7174              
    7175              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7176                      .dwattr $C$DW$T$46, DW_AT_name("_ADC_Obj_")
    7177                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x6650)
    7178              $C$DW$753       .dwtag  DW_TAG_member
    7179                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$40)
    7180                      .dwattr $C$DW$753, DW_AT_name("ADCRESULT")
    7181                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_ADCRESULT")
    7182                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7183                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7184              $C$DW$754       .dwtag  DW_TAG_member
    7185                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$41)
    7186                      .dwattr $C$DW$754, DW_AT_name("resvd_1")
    7187                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_resvd_1")
    7188                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7189                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7190              $C$DW$755       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$39)
    7192                      .dwattr $C$DW$755, DW_AT_name("ADCCTL1")
    7193                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ADCCTL1")
    7194                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7195                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7196              $C$DW$756       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$39)
    7198                      .dwattr $C$DW$756, DW_AT_name("ADCCTL2")
    7199                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_ADCCTL2")
    7200                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7201                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$757       .dwtag  DW_TAG_member
    7203                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$42)
    7204                      .dwattr $C$DW$757, DW_AT_name("rsvd_2")
    7205                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_rsvd_2")
    7206                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7207                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7208              $C$DW$758       .dwtag  DW_TAG_member
    7209                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$39)
    7210                      .dwattr $C$DW$758, DW_AT_name("ADCINTFLG")
    7211                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ADCINTFLG")
    7212                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7213                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7214              $C$DW$759       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$39)
    7216                      .dwattr $C$DW$759, DW_AT_name("ADCINTFLGCLR")
    7217                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7218                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7219                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7220              $C$DW$760       .dwtag  DW_TAG_member
    7221                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$39)
    7222                      .dwattr $C$DW$760, DW_AT_name("ADCINTOVF")
    7223                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_ADCINTOVF")
    7224                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7225                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7226              $C$DW$761       .dwtag  DW_TAG_member
    7227                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$39)
    7228                      .dwattr $C$DW$761, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  139

    7229                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7230                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7231                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7232              $C$DW$762       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$43)
    7234                      .dwattr $C$DW$762, DW_AT_name("INTSELxNy")
    7235                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_INTSELxNy")
    7236                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7237                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7238              $C$DW$763       .dwtag  DW_TAG_member
    7239                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$44)
    7240                      .dwattr $C$DW$763, DW_AT_name("rsvd_3")
    7241                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_rsvd_3")
    7242                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7243                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7244              $C$DW$764       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$39)
    7246                      .dwattr $C$DW$764, DW_AT_name("SOCPRICTRL")
    7247                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7248                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7249                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7250              $C$DW$765       .dwtag  DW_TAG_member
    7251                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$39)
    7252                      .dwattr $C$DW$765, DW_AT_name("rsvd_4")
    7253                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_rsvd_4")
    7254                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7255                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7256              $C$DW$766       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$39)
    7258                      .dwattr $C$DW$766, DW_AT_name("ADCSAMPLEMODE")
    7259                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7260                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7261                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7262              $C$DW$767       .dwtag  DW_TAG_member
    7263                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$39)
    7264                      .dwattr $C$DW$767, DW_AT_name("rsvd_5")
    7265                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_rsvd_5")
    7266                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7267                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7268              $C$DW$768       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$39)
    7270                      .dwattr $C$DW$768, DW_AT_name("ADCINTSOCSEL1")
    7271                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7272                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7273                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7274              $C$DW$769       .dwtag  DW_TAG_member
    7275                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$39)
    7276                      .dwattr $C$DW$769, DW_AT_name("ADCINTSOCSEL2")
    7277                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7278                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7279                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7280              $C$DW$770       .dwtag  DW_TAG_member
    7281                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$42)
    7282                      .dwattr $C$DW$770, DW_AT_name("rsvd_6")
    7283                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_rsvd_6")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  140

    7284                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7285                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7286              $C$DW$771       .dwtag  DW_TAG_member
    7287                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$39)
    7288                      .dwattr $C$DW$771, DW_AT_name("ADCSOCFLG1")
    7289                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7290                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7291                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7292              $C$DW$772       .dwtag  DW_TAG_member
    7293                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$39)
    7294                      .dwattr $C$DW$772, DW_AT_name("rsvd_7")
    7295                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_rsvd_7")
    7296                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7297                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7298              $C$DW$773       .dwtag  DW_TAG_member
    7299                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$39)
    7300                      .dwattr $C$DW$773, DW_AT_name("ADCSOCFRC1")
    7301                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7302                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7303                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7304              $C$DW$774       .dwtag  DW_TAG_member
    7305                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$39)
    7306                      .dwattr $C$DW$774, DW_AT_name("rsvd_8")
    7307                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_rsvd_8")
    7308                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7309                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7310              $C$DW$775       .dwtag  DW_TAG_member
    7311                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$39)
    7312                      .dwattr $C$DW$775, DW_AT_name("ADCSOCOVF1")
    7313                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    7314                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7315                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7316              $C$DW$776       .dwtag  DW_TAG_member
    7317                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$39)
    7318                      .dwattr $C$DW$776, DW_AT_name("rsvd_9")
    7319                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_rsvd_9")
    7320                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7321                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7322              $C$DW$777       .dwtag  DW_TAG_member
    7323                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$39)
    7324                      .dwattr $C$DW$777, DW_AT_name("ADCSOCOVFCLR1")
    7325                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7326                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7327                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7328              $C$DW$778       .dwtag  DW_TAG_member
    7329                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$39)
    7330                      .dwattr $C$DW$778, DW_AT_name("rsvd_10")
    7331                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_rsvd_10")
    7332                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7333                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7334              $C$DW$779       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$40)
    7336                      .dwattr $C$DW$779, DW_AT_name("ADCSOCxCTL")
    7337                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7338                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  141

    7339                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7340              $C$DW$780       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$40)
    7342                      .dwattr $C$DW$780, DW_AT_name("rsvd_11")
    7343                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_rsvd_11")
    7344                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7345                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7346              $C$DW$781       .dwtag  DW_TAG_member
    7347                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$39)
    7348                      .dwattr $C$DW$781, DW_AT_name("ADCREFTRIM")
    7349                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7350                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7351                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7352              $C$DW$782       .dwtag  DW_TAG_member
    7353                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$39)
    7354                      .dwattr $C$DW$782, DW_AT_name("ADCOFFTRIM")
    7355                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7356                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7357                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7358              $C$DW$783       .dwtag  DW_TAG_member
    7359                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$45)
    7360                      .dwattr $C$DW$783, DW_AT_name("resvd_12")
    7361                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_resvd_12")
    7362                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7363                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7364              $C$DW$784       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$39)
    7366                      .dwattr $C$DW$784, DW_AT_name("ADCREV")
    7367                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_ADCREV")
    7368                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    7369                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7370                      .dwendtag $C$DW$T$46
    7371              
    7372              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    7373                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$46)
    7374                      .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
    7375              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    7376                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    7377                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    7378              
    7379              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    7380                      .dwattr $C$DW$T$49, DW_AT_name("_CLARKE_Obj_")
    7381                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    7382              $C$DW$785       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$47)
    7384                      .dwattr $C$DW$785, DW_AT_name("alpha_sf")
    7385                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_alpha_sf")
    7386                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7387                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7388              $C$DW$786       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$47)
    7390                      .dwattr $C$DW$786, DW_AT_name("beta_sf")
    7391                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_beta_sf")
    7392                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7393                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  142

    7394              $C$DW$787       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$48)
    7396                      .dwattr $C$DW$787, DW_AT_name("numSensors")
    7397                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_numSensors")
    7398                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7399                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7400                      .dwendtag $C$DW$T$49
    7401              
    7402              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7403                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$49)
    7404                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7405              $C$DW$T$201     .dwtag  DW_TAG_pointer_type
    7406                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$60)
    7407                      .dwattr $C$DW$T$201, DW_AT_address_class(0x20)
    7408              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    7409                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$49)
    7410                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    7411              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7412                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    7413                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7414              
    7415              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    7416                      .dwattr $C$DW$T$51, DW_AT_name("_CLK_Obj_")
    7417                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x11)
    7418              $C$DW$788       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$39)
    7420                      .dwattr $C$DW$788, DW_AT_name("XCLK")
    7421                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_XCLK")
    7422                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7423                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7424              $C$DW$789       .dwtag  DW_TAG_member
    7425                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$39)
    7426                      .dwattr $C$DW$789, DW_AT_name("rsvd_1")
    7427                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_rsvd_1")
    7428                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7429                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7430              $C$DW$790       .dwtag  DW_TAG_member
    7431                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$39)
    7432                      .dwattr $C$DW$790, DW_AT_name("CLKCTL")
    7433                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_CLKCTL")
    7434                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7435                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7436              $C$DW$791       .dwtag  DW_TAG_member
    7437                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$50)
    7438                      .dwattr $C$DW$791, DW_AT_name("rsvd_2")
    7439                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_rsvd_2")
    7440                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7441                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7442              $C$DW$792       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$39)
    7444                      .dwattr $C$DW$792, DW_AT_name("LOSPCP")
    7445                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_LOSPCP")
    7446                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7447                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7448              $C$DW$793       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  143

    7449                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$39)
    7450                      .dwattr $C$DW$793, DW_AT_name("PCLKCR0")
    7451                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_PCLKCR0")
    7452                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7453                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7454              $C$DW$794       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$39)
    7456                      .dwattr $C$DW$794, DW_AT_name("PCLKCR1")
    7457                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_PCLKCR1")
    7458                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7459                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7460              $C$DW$795       .dwtag  DW_TAG_member
    7461                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$42)
    7462                      .dwattr $C$DW$795, DW_AT_name("rsvd_3")
    7463                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_rsvd_3")
    7464                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7465                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7466              $C$DW$796       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$39)
    7468                      .dwattr $C$DW$796, DW_AT_name("PCLKCR3")
    7469                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_PCLKCR3")
    7470                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7471                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7472                      .dwendtag $C$DW$T$51
    7473              
    7474              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    7475                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$51)
    7476                      .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    7477              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7478                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    7479                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    7480              
    7481              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7482                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_Obj_")
    7483                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    7484              $C$DW$797       .dwtag  DW_TAG_member
    7485                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$48)
    7486                      .dwattr $C$DW$797, DW_AT_name("tmp")
    7487                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_tmp")
    7488                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7489                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7490                      .dwendtag $C$DW$T$52
    7491              
    7492              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    7493                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$52)
    7494                      .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    7495              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7496                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    7497                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7498              
    7499              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    7500                      .dwattr $C$DW$T$86, DW_AT_name("_CTRL_Obj_")
    7501                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x108)
    7502              $C$DW$798       .dwtag  DW_TAG_member
    7503                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  144

    7504                      .dwattr $C$DW$798, DW_AT_name("version")
    7505                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_version")
    7506                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7507                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7508              $C$DW$799       .dwtag  DW_TAG_member
    7509                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$55)
    7510                      .dwattr $C$DW$799, DW_AT_name("state")
    7511                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_state")
    7512                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7513                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7514              $C$DW$800       .dwtag  DW_TAG_member
    7515                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$55)
    7516                      .dwattr $C$DW$800, DW_AT_name("prevState")
    7517                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_prevState")
    7518                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7519                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7520              $C$DW$801       .dwtag  DW_TAG_member
    7521                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$57)
    7522                      .dwattr $C$DW$801, DW_AT_name("errorCode")
    7523                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_errorCode")
    7524                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7525                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7526              $C$DW$802       .dwtag  DW_TAG_member
    7527                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$59)
    7528                      .dwattr $C$DW$802, DW_AT_name("clarkeHandle_I")
    7529                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7530                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7531                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7532              $C$DW$803       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$60)
    7534                      .dwattr $C$DW$803, DW_AT_name("clarke_I")
    7535                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_clarke_I")
    7536                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7537                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7538              $C$DW$804       .dwtag  DW_TAG_member
    7539                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$59)
    7540                      .dwattr $C$DW$804, DW_AT_name("clarkeHandle_V")
    7541                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7542                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7543                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7544              $C$DW$805       .dwtag  DW_TAG_member
    7545                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$60)
    7546                      .dwattr $C$DW$805, DW_AT_name("clarke_V")
    7547                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_clarke_V")
    7548                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7549                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7550              $C$DW$806       .dwtag  DW_TAG_member
    7551                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$62)
    7552                      .dwattr $C$DW$806, DW_AT_name("estHandle")
    7553                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_estHandle")
    7554                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7555                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7556              $C$DW$807       .dwtag  DW_TAG_member
    7557                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$64)
    7558                      .dwattr $C$DW$807, DW_AT_name("parkHandle")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  145

    7559                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_parkHandle")
    7560                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7561                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7562              $C$DW$808       .dwtag  DW_TAG_member
    7563                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$65)
    7564                      .dwattr $C$DW$808, DW_AT_name("park")
    7565                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_park")
    7566                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7567                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7568              $C$DW$809       .dwtag  DW_TAG_member
    7569                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$67)
    7570                      .dwattr $C$DW$809, DW_AT_name("pidHandle_Id")
    7571                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_pidHandle_Id")
    7572                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7573                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7574              $C$DW$810       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$68)
    7576                      .dwattr $C$DW$810, DW_AT_name("pid_Id")
    7577                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_pid_Id")
    7578                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7579                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7580              $C$DW$811       .dwtag  DW_TAG_member
    7581                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$67)
    7582                      .dwattr $C$DW$811, DW_AT_name("pidHandle_Iq")
    7583                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7584                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7585                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7586              $C$DW$812       .dwtag  DW_TAG_member
    7587                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$68)
    7588                      .dwattr $C$DW$812, DW_AT_name("pid_Iq")
    7589                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_pid_Iq")
    7590                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7591                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7592              $C$DW$813       .dwtag  DW_TAG_member
    7593                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$67)
    7594                      .dwattr $C$DW$813, DW_AT_name("pidHandle_spd")
    7595                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_pidHandle_spd")
    7596                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7597                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7598              $C$DW$814       .dwtag  DW_TAG_member
    7599                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$68)
    7600                      .dwattr $C$DW$814, DW_AT_name("pid_spd")
    7601                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_pid_spd")
    7602                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7603                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7604              $C$DW$815       .dwtag  DW_TAG_member
    7605                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$70)
    7606                      .dwattr $C$DW$815, DW_AT_name("iparkHandle")
    7607                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_iparkHandle")
    7608                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7609                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7610              $C$DW$816       .dwtag  DW_TAG_member
    7611                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$71)
    7612                      .dwattr $C$DW$816, DW_AT_name("ipark")
    7613                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_ipark")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  146

    7614                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7615                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7616              $C$DW$817       .dwtag  DW_TAG_member
    7617                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$73)
    7618                      .dwattr $C$DW$817, DW_AT_name("svgenHandle")
    7619                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_svgenHandle")
    7620                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7621                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7622              $C$DW$818       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$74)
    7624                      .dwattr $C$DW$818, DW_AT_name("svgen")
    7625                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_svgen")
    7626                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7627                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7628              $C$DW$819       .dwtag  DW_TAG_member
    7629                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$76)
    7630                      .dwattr $C$DW$819, DW_AT_name("trajHandle_Id")
    7631                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_trajHandle_Id")
    7632                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7633                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7634              $C$DW$820       .dwtag  DW_TAG_member
    7635                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$77)
    7636                      .dwattr $C$DW$820, DW_AT_name("traj_Id")
    7637                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_traj_Id")
    7638                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7639                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7640              $C$DW$821       .dwtag  DW_TAG_member
    7641                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$76)
    7642                      .dwattr $C$DW$821, DW_AT_name("trajHandle_spd")
    7643                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_trajHandle_spd")
    7644                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7645                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7646              $C$DW$822       .dwtag  DW_TAG_member
    7647                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$77)
    7648                      .dwattr $C$DW$822, DW_AT_name("traj_spd")
    7649                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_traj_spd")
    7650                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7651                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7652              $C$DW$823       .dwtag  DW_TAG_member
    7653                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$76)
    7654                      .dwattr $C$DW$823, DW_AT_name("trajHandle_spdMax")
    7655                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7656                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7657                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7658              $C$DW$824       .dwtag  DW_TAG_member
    7659                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$77)
    7660                      .dwattr $C$DW$824, DW_AT_name("traj_spdMax")
    7661                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_traj_spdMax")
    7662                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7663                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7664              $C$DW$825       .dwtag  DW_TAG_member
    7665                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$78)
    7666                      .dwattr $C$DW$825, DW_AT_name("motorParams")
    7667                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_motorParams")
    7668                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  147

    7669                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7670              $C$DW$826       .dwtag  DW_TAG_member
    7671                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$81)
    7672                      .dwattr $C$DW$826, DW_AT_name("waitTimes")
    7673                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_waitTimes")
    7674                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7675                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7676              $C$DW$827       .dwtag  DW_TAG_member
    7677                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$80)
    7678                      .dwattr $C$DW$827, DW_AT_name("counter_state")
    7679                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_counter_state")
    7680                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7681                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7682              $C$DW$828       .dwtag  DW_TAG_member
    7683                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$82)
    7684                      .dwattr $C$DW$828, DW_AT_name("numIsrTicksPerCtrlTick")
    7685                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7686                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7687                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7688              $C$DW$829       .dwtag  DW_TAG_member
    7689                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$82)
    7690                      .dwattr $C$DW$829, DW_AT_name("numCtrlTicksPerCurrentTick")
    7691                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7692                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7693                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7694              $C$DW$830       .dwtag  DW_TAG_member
    7695                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$82)
    7696                      .dwattr $C$DW$830, DW_AT_name("numCtrlTicksPerSpeedTick")
    7697                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7698                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7699                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7700              $C$DW$831       .dwtag  DW_TAG_member
    7701                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$82)
    7702                      .dwattr $C$DW$831, DW_AT_name("numCtrlTicksPerTrajTick")
    7703                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7704                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7705                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7706              $C$DW$832       .dwtag  DW_TAG_member
    7707                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$80)
    7708                      .dwattr $C$DW$832, DW_AT_name("ctrlFreq_Hz")
    7709                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7710                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7711                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7712              $C$DW$833       .dwtag  DW_TAG_member
    7713                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$80)
    7714                      .dwattr $C$DW$833, DW_AT_name("trajFreq_Hz")
    7715                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7716                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7717                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7718              $C$DW$834       .dwtag  DW_TAG_member
    7719                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$47)
    7720                      .dwattr $C$DW$834, DW_AT_name("trajPeriod_sec")
    7721                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7722                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7723                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:20 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0637210                            PAGE  148

    7724              $C$DW$835       .dwtag  DW_TAG_member
    7725                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$83)
    7726                      .dwattr $C$DW$835, DW_AT_name("ctrlPeriod_sec")
    7727                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7728                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7729                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7730              $C$DW$836       .dwtag  DW_TAG_member
    7731                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$47)
    7732                      .dwattr $C$DW$836, DW_AT_name("maxVsMag_pu")
    7733                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7734                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
