TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:21 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4943              $C$DW$T$237     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4944                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    4945                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
    4946              
    4947              $C$DW$T$239     .dwtag  DW_TAG_enumeration_type
    4948                      .dwattr $C$DW$T$239, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE   99

    4949              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4950              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4951              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4952              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4953              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4954              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4955              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4956              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4957              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4958              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4959              $C$DW$678       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4960              $C$DW$679       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4961                      .dwendtag $C$DW$T$239
    4962              
    4963              $C$DW$T$240     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4964                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    4965                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    4966              
    4967              $C$DW$T$242     .dwtag  DW_TAG_enumeration_type
    4968                      .dwattr $C$DW$T$242, DW_AT_byte_size(0x01)
    4969              $C$DW$680       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    4970              $C$DW$681       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    4971              $C$DW$682       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    4972                      .dwendtag $C$DW$T$242
    4973              
    4974              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4975                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    4976                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    4977              
    4978              $C$DW$T$245     .dwtag  DW_TAG_enumeration_type
    4979                      .dwattr $C$DW$T$245, DW_AT_byte_size(0x01)
    4980              $C$DW$683       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4981              $C$DW$684       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4982                      .dwendtag $C$DW$T$245
    4983              
    4984              $C$DW$T$246     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4985                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    4986                      .dwattr $C$DW$T$246, DW_AT_language(DW_LANG_C)
    4987              
    4988              $C$DW$T$22      .dwtag  DW_TAG_union_type
    4989                      .dwattr $C$DW$T$22, DW_AT_name("U3_0")
    4990                      .dwattr $C$DW$T$22, DW_AT_declaration
    4991                      .dwendtag $C$DW$T$22
    4992              
    4993              
    4994              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4995                      .dwattr $C$DW$T$23, DW_AT_name("S3_1")
    4996                      .dwattr $C$DW$T$23, DW_AT_declaration
    4997                      .dwendtag $C$DW$T$23
    4998              
    4999              
    5000              $C$DW$T$24      .dwtag  DW_TAG_union_type
    5001                      .dwattr $C$DW$T$24, DW_AT_name("U4_2")
    5002                      .dwattr $C$DW$T$24, DW_AT_declaration
    5003                      .dwendtag $C$DW$T$24
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  100

    5004              
    5005              
    5006              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5007                      .dwattr $C$DW$T$25, DW_AT_name("S4_3")
    5008                      .dwattr $C$DW$T$25, DW_AT_declaration
    5009                      .dwendtag $C$DW$T$25
    5010              
    5011              
    5012              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5013                      .dwattr $C$DW$T$27, DW_AT_name("I2CEMDR_BITS")
    5014                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5015              $C$DW$685       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$26)
    5017                      .dwattr $C$DW$685, DW_AT_name("BCM")
    5018                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_BCM")
    5019                      .dwattr $C$DW$685, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5020                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$686       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$26)
    5024                      .dwattr $C$DW$686, DW_AT_name("rsvd1")
    5025                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_rsvd1")
    5026                      .dwattr $C$DW$686, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    5027                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5028                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    5029                      .dwendtag $C$DW$T$27
    5030              
    5031              
    5032              $C$DW$T$28      .dwtag  DW_TAG_union_type
    5033                      .dwattr $C$DW$T$28, DW_AT_name("I2CEMDR_REG")
    5034                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5035              $C$DW$687       .dwtag  DW_TAG_member
    5036                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$26)
    5037                      .dwattr $C$DW$687, DW_AT_name("all")
    5038                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_all")
    5039                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5040                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    5041              $C$DW$688       .dwtag  DW_TAG_member
    5042                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    5043                      .dwattr $C$DW$688, DW_AT_name("bit")
    5044                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_bit")
    5045                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5046                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    5047                      .dwendtag $C$DW$T$28
    5048              
    5049              
    5050              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5051                      .dwattr $C$DW$T$29, DW_AT_name("I2CFFRX_BITS")
    5052                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5053              $C$DW$689       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$26)
    5055                      .dwattr $C$DW$689, DW_AT_name("RXFFIL")
    5056                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_RXFFIL")
    5057                      .dwattr $C$DW$689, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    5058                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  101

    5059                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    5060              $C$DW$690       .dwtag  DW_TAG_member
    5061                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$26)
    5062                      .dwattr $C$DW$690, DW_AT_name("RXFFIENA")
    5063                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_RXFFIENA")
    5064                      .dwattr $C$DW$690, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5065                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$691       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$26)
    5069                      .dwattr $C$DW$691, DW_AT_name("RXFFINTCLR")
    5070                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_RXFFINTCLR")
    5071                      .dwattr $C$DW$691, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5072                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5073                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    5074              $C$DW$692       .dwtag  DW_TAG_member
    5075                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$26)
    5076                      .dwattr $C$DW$692, DW_AT_name("RXFFINT")
    5077                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_RXFFINT")
    5078                      .dwattr $C$DW$692, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5079                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5080                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$693       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$26)
    5083                      .dwattr $C$DW$693, DW_AT_name("RXFFST")
    5084                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_RXFFST")
    5085                      .dwattr $C$DW$693, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    5086                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5087                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    5088              $C$DW$694       .dwtag  DW_TAG_member
    5089                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$26)
    5090                      .dwattr $C$DW$694, DW_AT_name("RXFFRST")
    5091                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_RXFFRST")
    5092                      .dwattr $C$DW$694, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5093                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5094                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$695       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$26)
    5097                      .dwattr $C$DW$695, DW_AT_name("rsvd1")
    5098                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_rsvd1")
    5099                      .dwattr $C$DW$695, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5100                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5101                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    5102                      .dwendtag $C$DW$T$29
    5103              
    5104              
    5105              $C$DW$T$30      .dwtag  DW_TAG_union_type
    5106                      .dwattr $C$DW$T$30, DW_AT_name("I2CFFRX_REG")
    5107                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    5108              $C$DW$696       .dwtag  DW_TAG_member
    5109                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    5110                      .dwattr $C$DW$696, DW_AT_name("all")
    5111                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_all")
    5112                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5113                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  102

    5114              $C$DW$697       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$29)
    5116                      .dwattr $C$DW$697, DW_AT_name("bit")
    5117                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_bit")
    5118                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5119                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    5120                      .dwendtag $C$DW$T$30
    5121              
    5122              
    5123              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5124                      .dwattr $C$DW$T$31, DW_AT_name("I2CFFTX_BITS")
    5125                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    5126              $C$DW$698       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$26)
    5128                      .dwattr $C$DW$698, DW_AT_name("TXFFIL")
    5129                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_TXFFIL")
    5130                      .dwattr $C$DW$698, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    5131                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5132                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$699       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$26)
    5135                      .dwattr $C$DW$699, DW_AT_name("TXFFIENA")
    5136                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_TXFFIENA")
    5137                      .dwattr $C$DW$699, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5138                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5139                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    5140              $C$DW$700       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$26)
    5142                      .dwattr $C$DW$700, DW_AT_name("TXFFINTCLR")
    5143                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_TXFFINTCLR")
    5144                      .dwattr $C$DW$700, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5145                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5146                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    5147              $C$DW$701       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$26)
    5149                      .dwattr $C$DW$701, DW_AT_name("TXFFINT")
    5150                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_TXFFINT")
    5151                      .dwattr $C$DW$701, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5152                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5153                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    5154              $C$DW$702       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$26)
    5156                      .dwattr $C$DW$702, DW_AT_name("TXFFST")
    5157                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_TXFFST")
    5158                      .dwattr $C$DW$702, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    5159                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5160                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    5161              $C$DW$703       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$26)
    5163                      .dwattr $C$DW$703, DW_AT_name("TXFFRST")
    5164                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_TXFFRST")
    5165                      .dwattr $C$DW$703, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5166                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5167                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    5168              $C$DW$704       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  103

    5169                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$26)
    5170                      .dwattr $C$DW$704, DW_AT_name("I2CFFEN")
    5171                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_I2CFFEN")
    5172                      .dwattr $C$DW$704, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5173                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5174                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    5175              $C$DW$705       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$26)
    5177                      .dwattr $C$DW$705, DW_AT_name("rsvd1")
    5178                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd1")
    5179                      .dwattr $C$DW$705, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5180                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5181                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    5182                      .dwendtag $C$DW$T$31
    5183              
    5184              
    5185              $C$DW$T$32      .dwtag  DW_TAG_union_type
    5186                      .dwattr $C$DW$T$32, DW_AT_name("I2CFFTX_REG")
    5187                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    5188              $C$DW$706       .dwtag  DW_TAG_member
    5189                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$26)
    5190                      .dwattr $C$DW$706, DW_AT_name("all")
    5191                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_all")
    5192                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5193                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    5194              $C$DW$707       .dwtag  DW_TAG_member
    5195                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$31)
    5196                      .dwattr $C$DW$707, DW_AT_name("bit")
    5197                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_bit")
    5198                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5199                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    5200                      .dwendtag $C$DW$T$32
    5201              
    5202              
    5203              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5204                      .dwattr $C$DW$T$33, DW_AT_name("I2CIER_BITS")
    5205                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5206              $C$DW$708       .dwtag  DW_TAG_member
    5207                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$26)
    5208                      .dwattr $C$DW$708, DW_AT_name("ARBL")
    5209                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ARBL")
    5210                      .dwattr $C$DW$708, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5211                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5212                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    5213              $C$DW$709       .dwtag  DW_TAG_member
    5214                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$26)
    5215                      .dwattr $C$DW$709, DW_AT_name("NACK")
    5216                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_NACK")
    5217                      .dwattr $C$DW$709, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5218                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5219                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    5220              $C$DW$710       .dwtag  DW_TAG_member
    5221                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$26)
    5222                      .dwattr $C$DW$710, DW_AT_name("ARDY")
    5223                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ARDY")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  104

    5224                      .dwattr $C$DW$710, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5225                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5226                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    5227              $C$DW$711       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$26)
    5229                      .dwattr $C$DW$711, DW_AT_name("RRDY")
    5230                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_RRDY")
    5231                      .dwattr $C$DW$711, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5232                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5233                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    5234              $C$DW$712       .dwtag  DW_TAG_member
    5235                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$26)
    5236                      .dwattr $C$DW$712, DW_AT_name("XRDY")
    5237                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_XRDY")
    5238                      .dwattr $C$DW$712, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5239                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5240                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    5241              $C$DW$713       .dwtag  DW_TAG_member
    5242                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$26)
    5243                      .dwattr $C$DW$713, DW_AT_name("SCD")
    5244                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_SCD")
    5245                      .dwattr $C$DW$713, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5246                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5247                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    5248              $C$DW$714       .dwtag  DW_TAG_member
    5249                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$26)
    5250                      .dwattr $C$DW$714, DW_AT_name("AAS")
    5251                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_AAS")
    5252                      .dwattr $C$DW$714, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5253                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5254                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5255              $C$DW$715       .dwtag  DW_TAG_member
    5256                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$26)
    5257                      .dwattr $C$DW$715, DW_AT_name("rsvd")
    5258                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd")
    5259                      .dwattr $C$DW$715, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    5260                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5261                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5262                      .dwendtag $C$DW$T$33
    5263              
    5264              
    5265              $C$DW$T$34      .dwtag  DW_TAG_union_type
    5266                      .dwattr $C$DW$T$34, DW_AT_name("I2CIER_REG")
    5267                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5268              $C$DW$716       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$26)
    5270                      .dwattr $C$DW$716, DW_AT_name("all")
    5271                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_all")
    5272                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5273                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5274              $C$DW$717       .dwtag  DW_TAG_member
    5275                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    5276                      .dwattr $C$DW$717, DW_AT_name("bit")
    5277                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_bit")
    5278                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  105

    5279                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5280                      .dwendtag $C$DW$T$34
    5281              
    5282              
    5283              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5284                      .dwattr $C$DW$T$35, DW_AT_name("I2CISRC_BITS")
    5285                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    5286              $C$DW$718       .dwtag  DW_TAG_member
    5287                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$26)
    5288                      .dwattr $C$DW$718, DW_AT_name("INTCODE")
    5289                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_INTCODE")
    5290                      .dwattr $C$DW$718, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    5291                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5292                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5293              $C$DW$719       .dwtag  DW_TAG_member
    5294                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$26)
    5295                      .dwattr $C$DW$719, DW_AT_name("rsvd1")
    5296                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_rsvd1")
    5297                      .dwattr $C$DW$719, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    5298                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5299                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5300                      .dwendtag $C$DW$T$35
    5301              
    5302              
    5303              $C$DW$T$36      .dwtag  DW_TAG_union_type
    5304                      .dwattr $C$DW$T$36, DW_AT_name("I2CISRC_REG")
    5305                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    5306              $C$DW$720       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$26)
    5308                      .dwattr $C$DW$720, DW_AT_name("all")
    5309                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_all")
    5310                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5311                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5312              $C$DW$721       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$35)
    5314                      .dwattr $C$DW$721, DW_AT_name("bit")
    5315                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_bit")
    5316                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5317                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5318                      .dwendtag $C$DW$T$36
    5319              
    5320              
    5321              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    5322                      .dwattr $C$DW$T$37, DW_AT_name("I2CMDR_BITS")
    5323                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    5324              $C$DW$722       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$26)
    5326                      .dwattr $C$DW$722, DW_AT_name("BC")
    5327                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_BC")
    5328                      .dwattr $C$DW$722, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    5329                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5330                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5331              $C$DW$723       .dwtag  DW_TAG_member
    5332                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$26)
    5333                      .dwattr $C$DW$723, DW_AT_name("FDF")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  106

    5334                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_FDF")
    5335                      .dwattr $C$DW$723, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5336                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5337                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5338              $C$DW$724       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$26)
    5340                      .dwattr $C$DW$724, DW_AT_name("STB")
    5341                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_STB")
    5342                      .dwattr $C$DW$724, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5343                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5344                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5345              $C$DW$725       .dwtag  DW_TAG_member
    5346                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$26)
    5347                      .dwattr $C$DW$725, DW_AT_name("IRS")
    5348                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_IRS")
    5349                      .dwattr $C$DW$725, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5350                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5351                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5352              $C$DW$726       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$26)
    5354                      .dwattr $C$DW$726, DW_AT_name("DLB")
    5355                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_DLB")
    5356                      .dwattr $C$DW$726, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5357                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5358                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5359              $C$DW$727       .dwtag  DW_TAG_member
    5360                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$26)
    5361                      .dwattr $C$DW$727, DW_AT_name("RM")
    5362                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_RM")
    5363                      .dwattr $C$DW$727, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5364                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5365                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5366              $C$DW$728       .dwtag  DW_TAG_member
    5367                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$26)
    5368                      .dwattr $C$DW$728, DW_AT_name("XA")
    5369                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_XA")
    5370                      .dwattr $C$DW$728, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5371                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5372                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5373              $C$DW$729       .dwtag  DW_TAG_member
    5374                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$26)
    5375                      .dwattr $C$DW$729, DW_AT_name("TRX")
    5376                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_TRX")
    5377                      .dwattr $C$DW$729, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5378                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5379                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5380              $C$DW$730       .dwtag  DW_TAG_member
    5381                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$26)
    5382                      .dwattr $C$DW$730, DW_AT_name("MST")
    5383                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_MST")
    5384                      .dwattr $C$DW$730, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5385                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5386                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5387              $C$DW$731       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  107

    5389                      .dwattr $C$DW$731, DW_AT_name("STP")
    5390                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_STP")
    5391                      .dwattr $C$DW$731, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5392                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5393                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5394              $C$DW$732       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$26)
    5396                      .dwattr $C$DW$732, DW_AT_name("rsvd1")
    5397                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_rsvd1")
    5398                      .dwattr $C$DW$732, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5399                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5400                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5401              $C$DW$733       .dwtag  DW_TAG_member
    5402                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$26)
    5403                      .dwattr $C$DW$733, DW_AT_name("STT")
    5404                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_STT")
    5405                      .dwattr $C$DW$733, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5406                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5407                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5408              $C$DW$734       .dwtag  DW_TAG_member
    5409                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$26)
    5410                      .dwattr $C$DW$734, DW_AT_name("FREE")
    5411                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_FREE")
    5412                      .dwattr $C$DW$734, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5413                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5414                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5415              $C$DW$735       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$26)
    5417                      .dwattr $C$DW$735, DW_AT_name("NACKMOD")
    5418                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_NACKMOD")
    5419                      .dwattr $C$DW$735, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5420                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5421                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5422                      .dwendtag $C$DW$T$37
    5423              
    5424              
    5425              $C$DW$T$38      .dwtag  DW_TAG_union_type
    5426                      .dwattr $C$DW$T$38, DW_AT_name("I2CMDR_REG")
    5427                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    5428              $C$DW$736       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$26)
    5430                      .dwattr $C$DW$736, DW_AT_name("all")
    5431                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_all")
    5432                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5433                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$737       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$37)
    5436                      .dwattr $C$DW$737, DW_AT_name("bit")
    5437                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_bit")
    5438                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5439                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5440                      .dwendtag $C$DW$T$38
    5441              
    5442              
    5443              $C$DW$T$39      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  108

    5444                      .dwattr $C$DW$T$39, DW_AT_name("I2CPSC_BITS")
    5445                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    5446              $C$DW$738       .dwtag  DW_TAG_member
    5447                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$26)
    5448                      .dwattr $C$DW$738, DW_AT_name("IPSC")
    5449                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_IPSC")
    5450                      .dwattr $C$DW$738, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    5451                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5452                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5453              $C$DW$739       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$26)
    5455                      .dwattr $C$DW$739, DW_AT_name("rsvd1")
    5456                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_rsvd1")
    5457                      .dwattr $C$DW$739, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    5458                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5459                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5460                      .dwendtag $C$DW$T$39
    5461              
    5462              
    5463              $C$DW$T$40      .dwtag  DW_TAG_union_type
    5464                      .dwattr $C$DW$T$40, DW_AT_name("I2CPSC_REG")
    5465                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    5466              $C$DW$740       .dwtag  DW_TAG_member
    5467                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$26)
    5468                      .dwattr $C$DW$740, DW_AT_name("all")
    5469                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_all")
    5470                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5471                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5472              $C$DW$741       .dwtag  DW_TAG_member
    5473                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$39)
    5474                      .dwattr $C$DW$741, DW_AT_name("bit")
    5475                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_bit")
    5476                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5477                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5478                      .dwendtag $C$DW$T$40
    5479              
    5480              
    5481              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5482                      .dwattr $C$DW$T$41, DW_AT_name("I2CSTR_BITS")
    5483                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    5484              $C$DW$742       .dwtag  DW_TAG_member
    5485                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$26)
    5486                      .dwattr $C$DW$742, DW_AT_name("ARBL")
    5487                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ARBL")
    5488                      .dwattr $C$DW$742, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    5489                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5490                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5491              $C$DW$743       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$26)
    5493                      .dwattr $C$DW$743, DW_AT_name("NACK")
    5494                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_NACK")
    5495                      .dwattr $C$DW$743, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5496                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5497                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5498              $C$DW$744       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  109

    5499                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$26)
    5500                      .dwattr $C$DW$744, DW_AT_name("ARDY")
    5501                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_ARDY")
    5502                      .dwattr $C$DW$744, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5503                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5504                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5505              $C$DW$745       .dwtag  DW_TAG_member
    5506                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$26)
    5507                      .dwattr $C$DW$745, DW_AT_name("RRDY")
    5508                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_RRDY")
    5509                      .dwattr $C$DW$745, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5510                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5511                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5512              $C$DW$746       .dwtag  DW_TAG_member
    5513                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$26)
    5514                      .dwattr $C$DW$746, DW_AT_name("XRDY")
    5515                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_XRDY")
    5516                      .dwattr $C$DW$746, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5517                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5518                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5519              $C$DW$747       .dwtag  DW_TAG_member
    5520                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$26)
    5521                      .dwattr $C$DW$747, DW_AT_name("SCD")
    5522                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_SCD")
    5523                      .dwattr $C$DW$747, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5524                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5525                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5526              $C$DW$748       .dwtag  DW_TAG_member
    5527                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$26)
    5528                      .dwattr $C$DW$748, DW_AT_name("rsvd1")
    5529                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_rsvd1")
    5530                      .dwattr $C$DW$748, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    5531                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5532                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5533              $C$DW$749       .dwtag  DW_TAG_member
    5534                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$26)
    5535                      .dwattr $C$DW$749, DW_AT_name("AD0")
    5536                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_AD0")
    5537                      .dwattr $C$DW$749, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5538                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5539                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5540              $C$DW$750       .dwtag  DW_TAG_member
    5541                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$26)
    5542                      .dwattr $C$DW$750, DW_AT_name("AAS")
    5543                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_AAS")
    5544                      .dwattr $C$DW$750, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5545                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5546                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5547              $C$DW$751       .dwtag  DW_TAG_member
    5548                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$26)
    5549                      .dwattr $C$DW$751, DW_AT_name("XSMT")
    5550                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_XSMT")
    5551                      .dwattr $C$DW$751, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5552                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5553                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  110

    5554              $C$DW$752       .dwtag  DW_TAG_member
    5555                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$26)
    5556                      .dwattr $C$DW$752, DW_AT_name("RSFULL")
    5557                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_RSFULL")
    5558                      .dwattr $C$DW$752, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5559                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5560                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5561              $C$DW$753       .dwtag  DW_TAG_member
    5562                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$26)
    5563                      .dwattr $C$DW$753, DW_AT_name("BB")
    5564                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_BB")
    5565                      .dwattr $C$DW$753, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5566                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5567                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5568              $C$DW$754       .dwtag  DW_TAG_member
    5569                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$26)
    5570                      .dwattr $C$DW$754, DW_AT_name("NACKSNT")
    5571                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_NACKSNT")
    5572                      .dwattr $C$DW$754, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5573                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5574                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5575              $C$DW$755       .dwtag  DW_TAG_member
    5576                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$26)
    5577                      .dwattr $C$DW$755, DW_AT_name("SDIR")
    5578                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_SDIR")
    5579                      .dwattr $C$DW$755, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5580                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5581                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5582              $C$DW$756       .dwtag  DW_TAG_member
    5583                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$26)
    5584                      .dwattr $C$DW$756, DW_AT_name("rsvd2")
    5585                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_rsvd2")
    5586                      .dwattr $C$DW$756, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5587                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5588                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5589                      .dwendtag $C$DW$T$41
    5590              
    5591              
    5592              $C$DW$T$42      .dwtag  DW_TAG_union_type
    5593                      .dwattr $C$DW$T$42, DW_AT_name("I2CSTR_REG")
    5594                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    5595              $C$DW$757       .dwtag  DW_TAG_member
    5596                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$26)
    5597                      .dwattr $C$DW$757, DW_AT_name("all")
    5598                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_all")
    5599                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5600                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5601              $C$DW$758       .dwtag  DW_TAG_member
    5602                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$41)
    5603                      .dwattr $C$DW$758, DW_AT_name("bit")
    5604                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_bit")
    5605                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5606                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5607                      .dwendtag $C$DW$T$42
    5608              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  111

    5609              
    5610              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    5611                      .dwattr $C$DW$T$50, DW_AT_name("_ADC_Obj_")
    5612                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x6650)
    5613              $C$DW$759       .dwtag  DW_TAG_member
    5614                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$44)
    5615                      .dwattr $C$DW$759, DW_AT_name("ADCRESULT")
    5616                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_ADCRESULT")
    5617                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5618                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5619              $C$DW$760       .dwtag  DW_TAG_member
    5620                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$45)
    5621                      .dwattr $C$DW$760, DW_AT_name("resvd_1")
    5622                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_resvd_1")
    5623                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5624                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5625              $C$DW$761       .dwtag  DW_TAG_member
    5626                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$43)
    5627                      .dwattr $C$DW$761, DW_AT_name("ADCCTL1")
    5628                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ADCCTL1")
    5629                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    5630                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5631              $C$DW$762       .dwtag  DW_TAG_member
    5632                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$43)
    5633                      .dwattr $C$DW$762, DW_AT_name("ADCCTL2")
    5634                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_ADCCTL2")
    5635                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5636                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5637              $C$DW$763       .dwtag  DW_TAG_member
    5638                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$46)
    5639                      .dwattr $C$DW$763, DW_AT_name("rsvd_2")
    5640                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_rsvd_2")
    5641                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5642                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5643              $C$DW$764       .dwtag  DW_TAG_member
    5644                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$43)
    5645                      .dwattr $C$DW$764, DW_AT_name("ADCINTFLG")
    5646                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_ADCINTFLG")
    5647                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5648                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5649              $C$DW$765       .dwtag  DW_TAG_member
    5650                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$43)
    5651                      .dwattr $C$DW$765, DW_AT_name("ADCINTFLGCLR")
    5652                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5653                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5654                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5655              $C$DW$766       .dwtag  DW_TAG_member
    5656                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$43)
    5657                      .dwattr $C$DW$766, DW_AT_name("ADCINTOVF")
    5658                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_ADCINTOVF")
    5659                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5660                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5661              $C$DW$767       .dwtag  DW_TAG_member
    5662                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$43)
    5663                      .dwattr $C$DW$767, DW_AT_name("ADCINTOVFCLR")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  112

    5664                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5665                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5666                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5667              $C$DW$768       .dwtag  DW_TAG_member
    5668                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$47)
    5669                      .dwattr $C$DW$768, DW_AT_name("INTSELxNy")
    5670                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_INTSELxNy")
    5671                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5672                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5673              $C$DW$769       .dwtag  DW_TAG_member
    5674                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$48)
    5675                      .dwattr $C$DW$769, DW_AT_name("rsvd_3")
    5676                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_rsvd_3")
    5677                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5678                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5679              $C$DW$770       .dwtag  DW_TAG_member
    5680                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$43)
    5681                      .dwattr $C$DW$770, DW_AT_name("SOCPRICTRL")
    5682                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5683                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5684                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5685              $C$DW$771       .dwtag  DW_TAG_member
    5686                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$43)
    5687                      .dwattr $C$DW$771, DW_AT_name("rsvd_4")
    5688                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_rsvd_4")
    5689                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5690                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5691              $C$DW$772       .dwtag  DW_TAG_member
    5692                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$43)
    5693                      .dwattr $C$DW$772, DW_AT_name("ADCSAMPLEMODE")
    5694                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5695                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5696                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5697              $C$DW$773       .dwtag  DW_TAG_member
    5698                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$43)
    5699                      .dwattr $C$DW$773, DW_AT_name("rsvd_5")
    5700                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_rsvd_5")
    5701                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5702                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5703              $C$DW$774       .dwtag  DW_TAG_member
    5704                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$43)
    5705                      .dwattr $C$DW$774, DW_AT_name("ADCINTSOCSEL1")
    5706                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5707                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5708                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5709              $C$DW$775       .dwtag  DW_TAG_member
    5710                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$43)
    5711                      .dwattr $C$DW$775, DW_AT_name("ADCINTSOCSEL2")
    5712                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5713                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5714                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5715              $C$DW$776       .dwtag  DW_TAG_member
    5716                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$46)
    5717                      .dwattr $C$DW$776, DW_AT_name("rsvd_6")
    5718                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_rsvd_6")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  113

    5719                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5720                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5721              $C$DW$777       .dwtag  DW_TAG_member
    5722                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$43)
    5723                      .dwattr $C$DW$777, DW_AT_name("ADCSOCFLG1")
    5724                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5725                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5726                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5727              $C$DW$778       .dwtag  DW_TAG_member
    5728                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$43)
    5729                      .dwattr $C$DW$778, DW_AT_name("rsvd_7")
    5730                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_rsvd_7")
    5731                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5732                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5733              $C$DW$779       .dwtag  DW_TAG_member
    5734                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$43)
    5735                      .dwattr $C$DW$779, DW_AT_name("ADCSOCFRC1")
    5736                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5737                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5738                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5739              $C$DW$780       .dwtag  DW_TAG_member
    5740                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$43)
    5741                      .dwattr $C$DW$780, DW_AT_name("rsvd_8")
    5742                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_rsvd_8")
    5743                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5744                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5745              $C$DW$781       .dwtag  DW_TAG_member
    5746                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$43)
    5747                      .dwattr $C$DW$781, DW_AT_name("ADCSOCOVF1")
    5748                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5749                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5750                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5751              $C$DW$782       .dwtag  DW_TAG_member
    5752                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$43)
    5753                      .dwattr $C$DW$782, DW_AT_name("rsvd_9")
    5754                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_rsvd_9")
    5755                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5756                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5757              $C$DW$783       .dwtag  DW_TAG_member
    5758                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$43)
    5759                      .dwattr $C$DW$783, DW_AT_name("ADCSOCOVFCLR1")
    5760                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5761                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5762                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5763              $C$DW$784       .dwtag  DW_TAG_member
    5764                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$43)
    5765                      .dwattr $C$DW$784, DW_AT_name("rsvd_10")
    5766                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_rsvd_10")
    5767                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5768                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5769              $C$DW$785       .dwtag  DW_TAG_member
    5770                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$44)
    5771                      .dwattr $C$DW$785, DW_AT_name("ADCSOCxCTL")
    5772                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5773                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  114

    5774                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5775              $C$DW$786       .dwtag  DW_TAG_member
    5776                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$44)
    5777                      .dwattr $C$DW$786, DW_AT_name("rsvd_11")
    5778                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_rsvd_11")
    5779                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5780                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5781              $C$DW$787       .dwtag  DW_TAG_member
    5782                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$43)
    5783                      .dwattr $C$DW$787, DW_AT_name("ADCREFTRIM")
    5784                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5785                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5786                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5787              $C$DW$788       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$43)
    5789                      .dwattr $C$DW$788, DW_AT_name("ADCOFFTRIM")
    5790                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5791                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5792                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5793              $C$DW$789       .dwtag  DW_TAG_member
    5794                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$49)
    5795                      .dwattr $C$DW$789, DW_AT_name("resvd_12")
    5796                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_resvd_12")
    5797                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5798                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5799              $C$DW$790       .dwtag  DW_TAG_member
    5800                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$43)
    5801                      .dwattr $C$DW$790, DW_AT_name("ADCREV")
    5802                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ADCREV")
    5803                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5804                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5805                      .dwendtag $C$DW$T$50
    5806              
    5807              $C$DW$T$249     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5808                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$50)
    5809                      .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    5810              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    5811                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$50)
    5812                      .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    5813              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5814                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    5815                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    5816              
    5817              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    5818                      .dwattr $C$DW$T$53, DW_AT_name("_CLARKE_Obj_")
    5819                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x06)
    5820              $C$DW$791       .dwtag  DW_TAG_member
    5821                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$51)
    5822                      .dwattr $C$DW$791, DW_AT_name("alpha_sf")
    5823                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_alpha_sf")
    5824                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5825                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5826              $C$DW$792       .dwtag  DW_TAG_member
    5827                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$51)
    5828                      .dwattr $C$DW$792, DW_AT_name("beta_sf")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  115

    5829                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_beta_sf")
    5830                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5831                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5832              $C$DW$793       .dwtag  DW_TAG_member
    5833                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$52)
    5834                      .dwattr $C$DW$793, DW_AT_name("numSensors")
    5835                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_numSensors")
    5836                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5837                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    5838                      .dwendtag $C$DW$T$53
    5839              
    5840              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    5841                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$53)
    5842                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    5843              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    5844                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$53)
    5845                      .dwattr $C$DW$T$62, DW_AT_address_class(0x20)
    5846              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5847                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    5848                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5849              $C$DW$794       .dwtag  DW_TAG_TI_far_type
    5850                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$63)
    5851              $C$DW$T$250     .dwtag  DW_TAG_const_type
    5852                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$794)
    5853              
    5854              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    5855                      .dwattr $C$DW$T$55, DW_AT_name("_CLK_Obj_")
    5856                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x11)
    5857              $C$DW$795       .dwtag  DW_TAG_member
    5858                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$43)
    5859                      .dwattr $C$DW$795, DW_AT_name("XCLK")
    5860                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_XCLK")
    5861                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5862                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5863              $C$DW$796       .dwtag  DW_TAG_member
    5864                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$43)
    5865                      .dwattr $C$DW$796, DW_AT_name("rsvd_1")
    5866                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_rsvd_1")
    5867                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5868                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5869              $C$DW$797       .dwtag  DW_TAG_member
    5870                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$43)
    5871                      .dwattr $C$DW$797, DW_AT_name("CLKCTL")
    5872                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_CLKCTL")
    5873                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5874                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5875              $C$DW$798       .dwtag  DW_TAG_member
    5876                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$54)
    5877                      .dwattr $C$DW$798, DW_AT_name("rsvd_2")
    5878                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_rsvd_2")
    5879                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5880                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5881              $C$DW$799       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$43)
    5883                      .dwattr $C$DW$799, DW_AT_name("LOSPCP")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  116

    5884                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_LOSPCP")
    5885                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5886                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5887              $C$DW$800       .dwtag  DW_TAG_member
    5888                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$43)
    5889                      .dwattr $C$DW$800, DW_AT_name("PCLKCR0")
    5890                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_PCLKCR0")
    5891                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5892                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    5893              $C$DW$801       .dwtag  DW_TAG_member
    5894                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$43)
    5895                      .dwattr $C$DW$801, DW_AT_name("PCLKCR1")
    5896                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_PCLKCR1")
    5897                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5898                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5899              $C$DW$802       .dwtag  DW_TAG_member
    5900                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$46)
    5901                      .dwattr $C$DW$802, DW_AT_name("rsvd_3")
    5902                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_3")
    5903                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5904                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5905              $C$DW$803       .dwtag  DW_TAG_member
    5906                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$43)
    5907                      .dwattr $C$DW$803, DW_AT_name("PCLKCR3")
    5908                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_PCLKCR3")
    5909                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5910                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5911                      .dwendtag $C$DW$T$55
    5912              
    5913              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    5914                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$55)
    5915                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    5916              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5917                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    5918                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    5919              
    5920              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    5921                      .dwattr $C$DW$T$56, DW_AT_name("_CPU_Obj_")
    5922                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    5923              $C$DW$804       .dwtag  DW_TAG_member
    5924                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$52)
    5925                      .dwattr $C$DW$804, DW_AT_name("tmp")
    5926                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_tmp")
    5927                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5928                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5929                      .dwendtag $C$DW$T$56
    5930              
    5931              $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    5932                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$56)
    5933                      .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    5934              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5935                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    5936                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    5937              
    5938              $C$DW$T$90      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  117

    5939                      .dwattr $C$DW$T$90, DW_AT_name("_CTRL_Obj_")
    5940                      .dwattr $C$DW$T$90, DW_AT_byte_size(0x108)
    5941              $C$DW$805       .dwtag  DW_TAG_member
    5942                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$57)
    5943                      .dwattr $C$DW$805, DW_AT_name("version")
    5944                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_version")
    5945                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5946                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    5947              $C$DW$806       .dwtag  DW_TAG_member
    5948                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$59)
    5949                      .dwattr $C$DW$806, DW_AT_name("state")
    5950                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_state")
    5951                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5952                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5953              $C$DW$807       .dwtag  DW_TAG_member
    5954                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$59)
    5955                      .dwattr $C$DW$807, DW_AT_name("prevState")
    5956                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_prevState")
    5957                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5958                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    5959              $C$DW$808       .dwtag  DW_TAG_member
    5960                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$61)
    5961                      .dwattr $C$DW$808, DW_AT_name("errorCode")
    5962                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_errorCode")
    5963                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5964                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5965              $C$DW$809       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$63)
    5967                      .dwattr $C$DW$809, DW_AT_name("clarkeHandle_I")
    5968                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5969                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5970                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5971              $C$DW$810       .dwtag  DW_TAG_member
    5972                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$64)
    5973                      .dwattr $C$DW$810, DW_AT_name("clarke_I")
    5974                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_clarke_I")
    5975                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5976                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    5977              $C$DW$811       .dwtag  DW_TAG_member
    5978                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$63)
    5979                      .dwattr $C$DW$811, DW_AT_name("clarkeHandle_V")
    5980                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5981                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5982                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    5983              $C$DW$812       .dwtag  DW_TAG_member
    5984                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$64)
    5985                      .dwattr $C$DW$812, DW_AT_name("clarke_V")
    5986                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_clarke_V")
    5987                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5988                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    5989              $C$DW$813       .dwtag  DW_TAG_member
    5990                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$66)
    5991                      .dwattr $C$DW$813, DW_AT_name("estHandle")
    5992                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_estHandle")
    5993                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  118

    5994                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    5995              $C$DW$814       .dwtag  DW_TAG_member
    5996                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$68)
    5997                      .dwattr $C$DW$814, DW_AT_name("parkHandle")
    5998                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_parkHandle")
    5999                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6000                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    6001              $C$DW$815       .dwtag  DW_TAG_member
    6002                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$69)
    6003                      .dwattr $C$DW$815, DW_AT_name("park")
    6004                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_park")
    6005                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6006                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    6007              $C$DW$816       .dwtag  DW_TAG_member
    6008                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$71)
    6009                      .dwattr $C$DW$816, DW_AT_name("pidHandle_Id")
    6010                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_pidHandle_Id")
    6011                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6012                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    6013              $C$DW$817       .dwtag  DW_TAG_member
    6014                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$72)
    6015                      .dwattr $C$DW$817, DW_AT_name("pid_Id")
    6016                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_pid_Id")
    6017                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6018                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    6019              $C$DW$818       .dwtag  DW_TAG_member
    6020                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$71)
    6021                      .dwattr $C$DW$818, DW_AT_name("pidHandle_Iq")
    6022                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6023                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6024                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    6025              $C$DW$819       .dwtag  DW_TAG_member
    6026                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$72)
    6027                      .dwattr $C$DW$819, DW_AT_name("pid_Iq")
    6028                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_pid_Iq")
    6029                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6030                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    6031              $C$DW$820       .dwtag  DW_TAG_member
    6032                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$71)
    6033                      .dwattr $C$DW$820, DW_AT_name("pidHandle_spd")
    6034                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_pidHandle_spd")
    6035                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6036                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    6037              $C$DW$821       .dwtag  DW_TAG_member
    6038                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$72)
    6039                      .dwattr $C$DW$821, DW_AT_name("pid_spd")
    6040                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_pid_spd")
    6041                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    6042                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    6043              $C$DW$822       .dwtag  DW_TAG_member
    6044                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$74)
    6045                      .dwattr $C$DW$822, DW_AT_name("iparkHandle")
    6046                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_iparkHandle")
    6047                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    6048                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  119

    6049              $C$DW$823       .dwtag  DW_TAG_member
    6050                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$75)
    6051                      .dwattr $C$DW$823, DW_AT_name("ipark")
    6052                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_ipark")
    6053                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6054                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    6055              $C$DW$824       .dwtag  DW_TAG_member
    6056                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$77)
    6057                      .dwattr $C$DW$824, DW_AT_name("svgenHandle")
    6058                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_svgenHandle")
    6059                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6060                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    6061              $C$DW$825       .dwtag  DW_TAG_member
    6062                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$78)
    6063                      .dwattr $C$DW$825, DW_AT_name("svgen")
    6064                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_svgen")
    6065                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6066                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    6067              $C$DW$826       .dwtag  DW_TAG_member
    6068                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$80)
    6069                      .dwattr $C$DW$826, DW_AT_name("trajHandle_Id")
    6070                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_trajHandle_Id")
    6071                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6072                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    6073              $C$DW$827       .dwtag  DW_TAG_member
    6074                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$81)
    6075                      .dwattr $C$DW$827, DW_AT_name("traj_Id")
    6076                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_traj_Id")
    6077                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6078                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    6079              $C$DW$828       .dwtag  DW_TAG_member
    6080                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$80)
    6081                      .dwattr $C$DW$828, DW_AT_name("trajHandle_spd")
    6082                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_trajHandle_spd")
    6083                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6084                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    6085              $C$DW$829       .dwtag  DW_TAG_member
    6086                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$81)
    6087                      .dwattr $C$DW$829, DW_AT_name("traj_spd")
    6088                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_traj_spd")
    6089                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    6090                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    6091              $C$DW$830       .dwtag  DW_TAG_member
    6092                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$80)
    6093                      .dwattr $C$DW$830, DW_AT_name("trajHandle_spdMax")
    6094                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    6095                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6096                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    6097              $C$DW$831       .dwtag  DW_TAG_member
    6098                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$81)
    6099                      .dwattr $C$DW$831, DW_AT_name("traj_spdMax")
    6100                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_traj_spdMax")
    6101                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    6102                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    6103              $C$DW$832       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  120

    6104                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$82)
    6105                      .dwattr $C$DW$832, DW_AT_name("motorParams")
    6106                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_motorParams")
    6107                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6108                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    6109              $C$DW$833       .dwtag  DW_TAG_member
    6110                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$85)
    6111                      .dwattr $C$DW$833, DW_AT_name("waitTimes")
    6112                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_waitTimes")
    6113                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    6114                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    6115              $C$DW$834       .dwtag  DW_TAG_member
    6116                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$84)
    6117                      .dwattr $C$DW$834, DW_AT_name("counter_state")
    6118                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_counter_state")
    6119                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    6120                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    6121              $C$DW$835       .dwtag  DW_TAG_member
    6122                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$86)
    6123                      .dwattr $C$DW$835, DW_AT_name("numIsrTicksPerCtrlTick")
    6124                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    6125                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    6126                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    6127              $C$DW$836       .dwtag  DW_TAG_member
    6128                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$86)
    6129                      .dwattr $C$DW$836, DW_AT_name("numCtrlTicksPerCurrentTick")
    6130                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    6131                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    6132                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    6133              $C$DW$837       .dwtag  DW_TAG_member
    6134                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$86)
    6135                      .dwattr $C$DW$837, DW_AT_name("numCtrlTicksPerSpeedTick")
    6136                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    6137                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    6138                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    6139              $C$DW$838       .dwtag  DW_TAG_member
    6140                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$86)
    6141                      .dwattr $C$DW$838, DW_AT_name("numCtrlTicksPerTrajTick")
    6142                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    6143                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    6144                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    6145              $C$DW$839       .dwtag  DW_TAG_member
    6146                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$84)
    6147                      .dwattr $C$DW$839, DW_AT_name("ctrlFreq_Hz")
    6148                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    6149                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6150                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    6151              $C$DW$840       .dwtag  DW_TAG_member
    6152                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$84)
    6153                      .dwattr $C$DW$840, DW_AT_name("trajFreq_Hz")
    6154                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_trajFreq_Hz")
    6155                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    6156                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    6157              $C$DW$841       .dwtag  DW_TAG_member
    6158                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:22 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2735610                            PAGE  121

    6159                      .dwattr $C$DW$841, DW_AT_name("trajPeriod_sec")
    6160                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_trajPeriod_sec")
    6161                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6162                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    6163              $C$DW$842       .dwtag  DW_TAG_member
    6164                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$87)
    6165                      .dwattr $C$DW$842, DW_AT_name("ctrlPeriod_sec")
    6166                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    6167                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    6168                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    6169              $C$DW$843       .dwtag  DW_TAG_member
    6170                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$51)
