TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:58:46 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/drivers/gpio/src/32b/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.10\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp

    1617              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1618              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_SDAA"), DW_AT_const_value(0x01)
    1619              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_EPWMSYNCI"), DW_AT_const_value(0x02)
    1620              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_ADCSOCAO_NOT"), DW_AT_const_value(0x03)
    1621              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1622              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_SCLA"), DW_AT_const_value(0x01)
    1623              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_EPWMSYNCO"), DW_AT_const_value(0x02)
    1624              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_ADCSOCBO_NOT"), DW_AT_const_value(0x03)
    1625              $C$DW$227       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1626              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_COMP2OUT"), DW_AT_const_value(0x01)
    1627              $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1628              $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1629              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_JTAG_TDI"), DW_AT_const_value(0x00)
    1630              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1631              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1632              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1633              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_JTAG_TMS"), DW_AT_const_value(0x00)
    1634              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1635              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1636              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1637              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_JTAG_TDO"), DW_AT_const_value(0x00)
    1638              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1639              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1640              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1641              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_JTAG_TCK"), DW_AT_const_value(0x00)
    1642              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1643              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1644              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1645                      .dwendtag $C$DW$T$45
    1646              
    1647              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
    1648                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1649                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1650              $C$DW$247       .dwtag  DW_TAG_TI_far_type
    1651                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$46)
    1652              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1653                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$247)
    1654              
    1655              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    1656                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1657              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
    1658              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
    1659              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
    1660              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
    1661                      .dwendtag $C$DW$T$48
    1662              
    1663              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
    1664                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1665                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1666              $C$DW$252       .dwtag  DW_TAG_TI_far_type
    1667                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$49)
    1668              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1669                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$252)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE   32

    1670              
    1671              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1672                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    1673                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    1674              $C$DW$253       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    1676                      .dwattr $C$DW$253, DW_AT_name("GPACTRL")
    1677                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPACTRL")
    1678                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1680              $C$DW$254       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    1682                      .dwattr $C$DW$254, DW_AT_name("GPAQSEL1")
    1683                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPAQSEL1")
    1684                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1685                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$255       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    1688                      .dwattr $C$DW$255, DW_AT_name("GPAQSEL2")
    1689                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPAQSEL2")
    1690                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1691                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$256       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    1694                      .dwattr $C$DW$256, DW_AT_name("GPAMUX1")
    1695                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPAMUX1")
    1696                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1697                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$257       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    1700                      .dwattr $C$DW$257, DW_AT_name("GPAMUX2")
    1701                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPAMUX2")
    1702                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1703                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1704              $C$DW$258       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    1706                      .dwattr $C$DW$258, DW_AT_name("GPADIR")
    1707                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_GPADIR")
    1708                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1709                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$259       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    1712                      .dwattr $C$DW$259, DW_AT_name("GPAPUD")
    1713                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPAPUD")
    1714                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1715                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$260       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$23)
    1718                      .dwattr $C$DW$260, DW_AT_name("rsvd_1")
    1719                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd_1")
    1720                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1721                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$261       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    1724                      .dwattr $C$DW$261, DW_AT_name("GPBCTRL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE   33

    1725                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPBCTRL")
    1726                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1727                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$262       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    1730                      .dwattr $C$DW$262, DW_AT_name("GPBQSEL1")
    1731                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPBQSEL1")
    1732                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1733                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1734              $C$DW$263       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$23)
    1736                      .dwattr $C$DW$263, DW_AT_name("rsvd_2")
    1737                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd_2")
    1738                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1739                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$264       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    1742                      .dwattr $C$DW$264, DW_AT_name("GPBMUX1")
    1743                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPBMUX1")
    1744                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1745                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1746              $C$DW$265       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$23)
    1748                      .dwattr $C$DW$265, DW_AT_name("rsvd_3")
    1749                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd_3")
    1750                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1751                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$266       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    1754                      .dwattr $C$DW$266, DW_AT_name("GPBDIR")
    1755                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPBDIR")
    1756                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1757                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$267       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$20)
    1760                      .dwattr $C$DW$267, DW_AT_name("GPBPUD")
    1761                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_GPBPUD")
    1762                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1763                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1764              $C$DW$268       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$24)
    1766                      .dwattr $C$DW$268, DW_AT_name("rsvd_4")
    1767                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_4")
    1768                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1769                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$269       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    1772                      .dwattr $C$DW$269, DW_AT_name("AIOMUX1")
    1773                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_AIOMUX1")
    1774                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1775                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$270       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$23)
    1778                      .dwattr $C$DW$270, DW_AT_name("rsvd_5")
    1779                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd_5")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE   34

    1780                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1781                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1782              $C$DW$271       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$20)
    1784                      .dwattr $C$DW$271, DW_AT_name("AIODIR")
    1785                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_AIODIR")
    1786                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1787                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1788              $C$DW$272       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$25)
    1790                      .dwattr $C$DW$272, DW_AT_name("rsvd_6")
    1791                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_rsvd_6")
    1792                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1793                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1794              $C$DW$273       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    1796                      .dwattr $C$DW$273, DW_AT_name("GPADAT")
    1797                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_GPADAT")
    1798                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1799                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$274       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    1802                      .dwattr $C$DW$274, DW_AT_name("GPASET")
    1803                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPASET")
    1804                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1805                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1806              $C$DW$275       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    1808                      .dwattr $C$DW$275, DW_AT_name("GPACLEAR")
    1809                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPACLEAR")
    1810                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1811                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1812              $C$DW$276       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    1814                      .dwattr $C$DW$276, DW_AT_name("GPATOGGLE")
    1815                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPATOGGLE")
    1816                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1817                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1818              $C$DW$277       .dwtag  DW_TAG_member
    1819                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    1820                      .dwattr $C$DW$277, DW_AT_name("GPBDAT")
    1821                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPBDAT")
    1822                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1823                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1824              $C$DW$278       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    1826                      .dwattr $C$DW$278, DW_AT_name("GPBSET")
    1827                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPBSET")
    1828                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1829                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1830              $C$DW$279       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    1832                      .dwattr $C$DW$279, DW_AT_name("GPBCLEAR")
    1833                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_GPBCLEAR")
    1834                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE   35

    1835                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$280       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    1838                      .dwattr $C$DW$280, DW_AT_name("GPBTOGGLE")
    1839                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1840                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1841                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$281       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$26)
    1844                      .dwattr $C$DW$281, DW_AT_name("rsvd_7")
    1845                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd_7")
    1846                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1847                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1848              $C$DW$282       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    1850                      .dwattr $C$DW$282, DW_AT_name("AIODAT")
    1851                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_AIODAT")
    1852                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1853                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$283       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    1856                      .dwattr $C$DW$283, DW_AT_name("AIOSET")
    1857                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_AIOSET")
    1858                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1859                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1860              $C$DW$284       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    1862                      .dwattr $C$DW$284, DW_AT_name("AIOCLEAR")
    1863                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_AIOCLEAR")
    1864                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1865                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$285       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    1868                      .dwattr $C$DW$285, DW_AT_name("AIOTOGGLE")
    1869                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1870                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1871                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$286       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$27)
    1874                      .dwattr $C$DW$286, DW_AT_name("GPIOXINTnSEL")
    1875                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1876                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1877                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$287       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$28)
    1880                      .dwattr $C$DW$287, DW_AT_name("rsvd_8")
    1881                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_rsvd_8")
    1882                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1883                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$288       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$20)
    1886                      .dwattr $C$DW$288, DW_AT_name("GPIOLPMSEL")
    1887                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1888                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1889                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:47 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2734010                            PAGE   36

    1890                      .dwendtag $C$DW$T$29
    1891              
    1892              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Obj")
    1893                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    1894                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1895              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1896                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    1897                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    1898              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1899                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1900                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1901              $C$DW$289       .dwtag  DW_TAG_TI_far_type
    1902                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$53)
    1903              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1904                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$289)
    1905              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1906                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1907              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1908                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1909                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1910              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1911                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1912                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1913                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1914              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1915                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1916                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1917                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1918              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1919                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1920                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1921                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1922              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1923                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1924                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1925                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1926              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1927                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1928                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1929                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1930              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1931                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1932                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1933                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1934              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1935                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1936                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1937                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1938              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1939                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1940                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
