TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:58:50 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3961              $C$DW$565       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBDecr"), DW_AT_const_va
    3962                      .dwendtag $C$DW$T$243
    3963              
    3964              $C$DW$T$244     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SocPulseSrc_e")
    3965                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$243)
    3966                      .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    3967              $C$DW$566       .dwtag  DW_TAG_TI_far_type
    3968                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$244)
    3969              $C$DW$T$245     .dwtag  DW_TAG_const_type
    3970                      .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$566)
    3971              
    3972              $C$DW$T$246     .dwtag  DW_TAG_enumeration_type
    3973                      .dwattr $C$DW$T$246, DW_AT_byte_size(0x01)
    3974              $C$DW$567       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3975              $C$DW$568       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3976              $C$DW$569       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3977              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3978              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3979              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3980              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3981              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3982              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3983              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3984              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3985              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3986                      .dwendtag $C$DW$T$246
    3987              
    3988              $C$DW$T$247     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3989                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$246)
    3990                      .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    3991              
    3992              $C$DW$T$249     .dwtag  DW_TAG_enumeration_type
    3993                      .dwattr $C$DW$T$249, DW_AT_byte_size(0x01)
    3994              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3995              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   80

    3996              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3997                      .dwendtag $C$DW$T$249
    3998              
    3999              $C$DW$T$250     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4000                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$249)
    4001                      .dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
    4002              
    4003              $C$DW$T$252     .dwtag  DW_TAG_enumeration_type
    4004                      .dwattr $C$DW$T$252, DW_AT_byte_size(0x01)
    4005              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4006              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4007                      .dwendtag $C$DW$T$252
    4008              
    4009              $C$DW$T$253     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4010                      .dwattr $C$DW$T$253, DW_AT_type(*$C$DW$T$252)
    4011                      .dwattr $C$DW$T$253, DW_AT_language(DW_LANG_C)
    4012              
    4013              $C$DW$T$255     .dwtag  DW_TAG_enumeration_type
    4014                      .dwattr $C$DW$T$255, DW_AT_byte_size(0x01)
    4015              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    4016              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    4017              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    4018              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    4019                      .dwendtag $C$DW$T$255
    4020              
    4021              $C$DW$T$256     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    4022                      .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$255)
    4023                      .dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
    4024              
    4025              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4026                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_BITS")
    4027                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4028              $C$DW$588       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$22)
    4030                      .dwattr $C$DW$588, DW_AT_name("BCM")
    4031                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_BCM")
    4032                      .dwattr $C$DW$588, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4033                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4034                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$589       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$22)
    4037                      .dwattr $C$DW$589, DW_AT_name("rsvd1")
    4038                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd1")
    4039                      .dwattr $C$DW$589, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4040                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4041                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    4042                      .dwendtag $C$DW$T$23
    4043              
    4044              
    4045              $C$DW$T$24      .dwtag  DW_TAG_union_type
    4046                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_REG")
    4047                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4048              $C$DW$590       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$22)
    4050                      .dwattr $C$DW$590, DW_AT_name("all")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   81

    4051                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_all")
    4052                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4053                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    4054              $C$DW$591       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$23)
    4056                      .dwattr $C$DW$591, DW_AT_name("bit")
    4057                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_bit")
    4058                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4059                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    4060                      .dwendtag $C$DW$T$24
    4061              
    4062              
    4063              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4064                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_BITS")
    4065                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4066              $C$DW$592       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$22)
    4068                      .dwattr $C$DW$592, DW_AT_name("RXFFIL")
    4069                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_RXFFIL")
    4070                      .dwattr $C$DW$592, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4071                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4072                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$593       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$22)
    4075                      .dwattr $C$DW$593, DW_AT_name("RXFFIENA")
    4076                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_RXFFIENA")
    4077                      .dwattr $C$DW$593, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4078                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4079                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$594       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$22)
    4082                      .dwattr $C$DW$594, DW_AT_name("RXFFINTCLR")
    4083                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_RXFFINTCLR")
    4084                      .dwattr $C$DW$594, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4085                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4086                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$595       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$22)
    4089                      .dwattr $C$DW$595, DW_AT_name("RXFFINT")
    4090                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_RXFFINT")
    4091                      .dwattr $C$DW$595, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4092                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4093                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$596       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$22)
    4096                      .dwattr $C$DW$596, DW_AT_name("RXFFST")
    4097                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_RXFFST")
    4098                      .dwattr $C$DW$596, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4099                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4100                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$597       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$22)
    4103                      .dwattr $C$DW$597, DW_AT_name("RXFFRST")
    4104                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_RXFFRST")
    4105                      .dwattr $C$DW$597, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   82

    4106                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4107                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    4108              $C$DW$598       .dwtag  DW_TAG_member
    4109                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$22)
    4110                      .dwattr $C$DW$598, DW_AT_name("rsvd1")
    4111                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd1")
    4112                      .dwattr $C$DW$598, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4113                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4114                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    4115                      .dwendtag $C$DW$T$25
    4116              
    4117              
    4118              $C$DW$T$26      .dwtag  DW_TAG_union_type
    4119                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_REG")
    4120                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4121              $C$DW$599       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$22)
    4123                      .dwattr $C$DW$599, DW_AT_name("all")
    4124                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_all")
    4125                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4126                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$600       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$25)
    4129                      .dwattr $C$DW$600, DW_AT_name("bit")
    4130                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_bit")
    4131                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4132                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4133                      .dwendtag $C$DW$T$26
    4134              
    4135              
    4136              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4137                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_BITS")
    4138                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4139              $C$DW$601       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$22)
    4141                      .dwattr $C$DW$601, DW_AT_name("TXFFIL")
    4142                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_TXFFIL")
    4143                      .dwattr $C$DW$601, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4144                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4145                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$602       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$22)
    4148                      .dwattr $C$DW$602, DW_AT_name("TXFFIENA")
    4149                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_TXFFIENA")
    4150                      .dwattr $C$DW$602, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4151                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4152                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$603       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$22)
    4155                      .dwattr $C$DW$603, DW_AT_name("TXFFINTCLR")
    4156                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_TXFFINTCLR")
    4157                      .dwattr $C$DW$603, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4158                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4159                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$604       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   83

    4161                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$22)
    4162                      .dwattr $C$DW$604, DW_AT_name("TXFFINT")
    4163                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_TXFFINT")
    4164                      .dwattr $C$DW$604, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4165                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4166                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$605       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$22)
    4169                      .dwattr $C$DW$605, DW_AT_name("TXFFST")
    4170                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_TXFFST")
    4171                      .dwattr $C$DW$605, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4172                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4173                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4174              $C$DW$606       .dwtag  DW_TAG_member
    4175                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$22)
    4176                      .dwattr $C$DW$606, DW_AT_name("TXFFRST")
    4177                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_TXFFRST")
    4178                      .dwattr $C$DW$606, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4179                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4180                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4181              $C$DW$607       .dwtag  DW_TAG_member
    4182                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$22)
    4183                      .dwattr $C$DW$607, DW_AT_name("I2CFFEN")
    4184                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_I2CFFEN")
    4185                      .dwattr $C$DW$607, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4186                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4187                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$608       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$22)
    4190                      .dwattr $C$DW$608, DW_AT_name("rsvd1")
    4191                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_rsvd1")
    4192                      .dwattr $C$DW$608, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4193                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4194                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4195                      .dwendtag $C$DW$T$27
    4196              
    4197              
    4198              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4199                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_REG")
    4200                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4201              $C$DW$609       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$22)
    4203                      .dwattr $C$DW$609, DW_AT_name("all")
    4204                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_all")
    4205                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4206                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4207              $C$DW$610       .dwtag  DW_TAG_member
    4208                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$27)
    4209                      .dwattr $C$DW$610, DW_AT_name("bit")
    4210                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_bit")
    4211                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4212                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4213                      .dwendtag $C$DW$T$28
    4214              
    4215              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   84

    4216              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4217                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_BITS")
    4218                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4219              $C$DW$611       .dwtag  DW_TAG_member
    4220                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$22)
    4221                      .dwattr $C$DW$611, DW_AT_name("ARBL")
    4222                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_ARBL")
    4223                      .dwattr $C$DW$611, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4224                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4225                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$612       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$22)
    4228                      .dwattr $C$DW$612, DW_AT_name("NACK")
    4229                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_NACK")
    4230                      .dwattr $C$DW$612, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4231                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4232                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$613       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$22)
    4235                      .dwattr $C$DW$613, DW_AT_name("ARDY")
    4236                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ARDY")
    4237                      .dwattr $C$DW$613, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4238                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4239                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4240              $C$DW$614       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$22)
    4242                      .dwattr $C$DW$614, DW_AT_name("RRDY")
    4243                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_RRDY")
    4244                      .dwattr $C$DW$614, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4245                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4246                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$615       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$22)
    4249                      .dwattr $C$DW$615, DW_AT_name("XRDY")
    4250                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_XRDY")
    4251                      .dwattr $C$DW$615, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4252                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4253                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4254              $C$DW$616       .dwtag  DW_TAG_member
    4255                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$22)
    4256                      .dwattr $C$DW$616, DW_AT_name("SCD")
    4257                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_SCD")
    4258                      .dwattr $C$DW$616, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4259                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4260                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4261              $C$DW$617       .dwtag  DW_TAG_member
    4262                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$22)
    4263                      .dwattr $C$DW$617, DW_AT_name("AAS")
    4264                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_AAS")
    4265                      .dwattr $C$DW$617, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4266                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4267                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$618       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$22)
    4270                      .dwattr $C$DW$618, DW_AT_name("rsvd")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   85

    4271                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd")
    4272                      .dwattr $C$DW$618, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    4273                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4274                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4275                      .dwendtag $C$DW$T$29
    4276              
    4277              
    4278              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4279                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_REG")
    4280                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4281              $C$DW$619       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$22)
    4283                      .dwattr $C$DW$619, DW_AT_name("all")
    4284                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_all")
    4285                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4286                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$620       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$29)
    4289                      .dwattr $C$DW$620, DW_AT_name("bit")
    4290                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_bit")
    4291                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4292                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4293                      .dwendtag $C$DW$T$30
    4294              
    4295              
    4296              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4297                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_BITS")
    4298                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    4299              $C$DW$621       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$22)
    4301                      .dwattr $C$DW$621, DW_AT_name("INTCODE")
    4302                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_INTCODE")
    4303                      .dwattr $C$DW$621, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4304                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4305                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$622       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$22)
    4308                      .dwattr $C$DW$622, DW_AT_name("rsvd1")
    4309                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd1")
    4310                      .dwattr $C$DW$622, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    4311                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4312                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4313                      .dwendtag $C$DW$T$31
    4314              
    4315              
    4316              $C$DW$T$32      .dwtag  DW_TAG_union_type
    4317                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_REG")
    4318                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    4319              $C$DW$623       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$22)
    4321                      .dwattr $C$DW$623, DW_AT_name("all")
    4322                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_all")
    4323                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4324                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4325              $C$DW$624       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   86

    4326                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$31)
    4327                      .dwattr $C$DW$624, DW_AT_name("bit")
    4328                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_bit")
    4329                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4330                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4331                      .dwendtag $C$DW$T$32
    4332              
    4333              
    4334              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4335                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_BITS")
    4336                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4337              $C$DW$625       .dwtag  DW_TAG_member
    4338                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$22)
    4339                      .dwattr $C$DW$625, DW_AT_name("BC")
    4340                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_BC")
    4341                      .dwattr $C$DW$625, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4342                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4343                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$626       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$22)
    4346                      .dwattr $C$DW$626, DW_AT_name("FDF")
    4347                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_FDF")
    4348                      .dwattr $C$DW$626, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4349                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4350                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4351              $C$DW$627       .dwtag  DW_TAG_member
    4352                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$22)
    4353                      .dwattr $C$DW$627, DW_AT_name("STB")
    4354                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_STB")
    4355                      .dwattr $C$DW$627, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4356                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4357                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4358              $C$DW$628       .dwtag  DW_TAG_member
    4359                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$22)
    4360                      .dwattr $C$DW$628, DW_AT_name("IRS")
    4361                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_IRS")
    4362                      .dwattr $C$DW$628, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4363                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4364                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$629       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$22)
    4367                      .dwattr $C$DW$629, DW_AT_name("DLB")
    4368                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_DLB")
    4369                      .dwattr $C$DW$629, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4370                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4371                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4372              $C$DW$630       .dwtag  DW_TAG_member
    4373                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$22)
    4374                      .dwattr $C$DW$630, DW_AT_name("RM")
    4375                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_RM")
    4376                      .dwattr $C$DW$630, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4377                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4378                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4379              $C$DW$631       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   87

    4381                      .dwattr $C$DW$631, DW_AT_name("XA")
    4382                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_XA")
    4383                      .dwattr $C$DW$631, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4384                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4385                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$632       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$22)
    4388                      .dwattr $C$DW$632, DW_AT_name("TRX")
    4389                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_TRX")
    4390                      .dwattr $C$DW$632, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4391                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4392                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4393              $C$DW$633       .dwtag  DW_TAG_member
    4394                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$22)
    4395                      .dwattr $C$DW$633, DW_AT_name("MST")
    4396                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_MST")
    4397                      .dwattr $C$DW$633, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4398                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4399                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4400              $C$DW$634       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$22)
    4402                      .dwattr $C$DW$634, DW_AT_name("STP")
    4403                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_STP")
    4404                      .dwattr $C$DW$634, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4405                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4406                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$635       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$22)
    4409                      .dwattr $C$DW$635, DW_AT_name("rsvd1")
    4410                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd1")
    4411                      .dwattr $C$DW$635, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4412                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4413                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4414              $C$DW$636       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$22)
    4416                      .dwattr $C$DW$636, DW_AT_name("STT")
    4417                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_STT")
    4418                      .dwattr $C$DW$636, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4419                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4420                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4421              $C$DW$637       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$22)
    4423                      .dwattr $C$DW$637, DW_AT_name("FREE")
    4424                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_FREE")
    4425                      .dwattr $C$DW$637, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4426                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4427                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$638       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$22)
    4430                      .dwattr $C$DW$638, DW_AT_name("NACKMOD")
    4431                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_NACKMOD")
    4432                      .dwattr $C$DW$638, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4433                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4434                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4435                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   88

    4436              
    4437              
    4438              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4439                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_REG")
    4440                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    4441              $C$DW$639       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$22)
    4443                      .dwattr $C$DW$639, DW_AT_name("all")
    4444                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_all")
    4445                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4446                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4447              $C$DW$640       .dwtag  DW_TAG_member
    4448                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$33)
    4449                      .dwattr $C$DW$640, DW_AT_name("bit")
    4450                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_bit")
    4451                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4452                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4453                      .dwendtag $C$DW$T$34
    4454              
    4455              
    4456              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4457                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_BITS")
    4458                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4459              $C$DW$641       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$22)
    4461                      .dwattr $C$DW$641, DW_AT_name("IPSC")
    4462                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_IPSC")
    4463                      .dwattr $C$DW$641, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4464                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4465                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$642       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$22)
    4468                      .dwattr $C$DW$642, DW_AT_name("rsvd1")
    4469                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd1")
    4470                      .dwattr $C$DW$642, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4471                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4472                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4473                      .dwendtag $C$DW$T$35
    4474              
    4475              
    4476              $C$DW$T$36      .dwtag  DW_TAG_union_type
    4477                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_REG")
    4478                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4479              $C$DW$643       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$22)
    4481                      .dwattr $C$DW$643, DW_AT_name("all")
    4482                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_all")
    4483                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4484                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$644       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$35)
    4487                      .dwattr $C$DW$644, DW_AT_name("bit")
    4488                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_bit")
    4489                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4490                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   89

    4491                      .dwendtag $C$DW$T$36
    4492              
    4493              
    4494              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4495                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_BITS")
    4496                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4497              $C$DW$645       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$22)
    4499                      .dwattr $C$DW$645, DW_AT_name("ARBL")
    4500                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_ARBL")
    4501                      .dwattr $C$DW$645, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4502                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4503                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4504              $C$DW$646       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$22)
    4506                      .dwattr $C$DW$646, DW_AT_name("NACK")
    4507                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_NACK")
    4508                      .dwattr $C$DW$646, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4509                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$647       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$22)
    4513                      .dwattr $C$DW$647, DW_AT_name("ARDY")
    4514                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ARDY")
    4515                      .dwattr $C$DW$647, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4516                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4517                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$648       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$22)
    4520                      .dwattr $C$DW$648, DW_AT_name("RRDY")
    4521                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_RRDY")
    4522                      .dwattr $C$DW$648, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4523                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4524                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$649       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$22)
    4527                      .dwattr $C$DW$649, DW_AT_name("XRDY")
    4528                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_XRDY")
    4529                      .dwattr $C$DW$649, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4530                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4531                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$650       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
    4534                      .dwattr $C$DW$650, DW_AT_name("SCD")
    4535                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_SCD")
    4536                      .dwattr $C$DW$650, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4537                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4538                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$651       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$22)
    4541                      .dwattr $C$DW$651, DW_AT_name("rsvd1")
    4542                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd1")
    4543                      .dwattr $C$DW$651, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4544                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4545                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   90

    4546              $C$DW$652       .dwtag  DW_TAG_member
    4547                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
    4548                      .dwattr $C$DW$652, DW_AT_name("AD0")
    4549                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_AD0")
    4550                      .dwattr $C$DW$652, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4551                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4552                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4553              $C$DW$653       .dwtag  DW_TAG_member
    4554                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$22)
    4555                      .dwattr $C$DW$653, DW_AT_name("AAS")
    4556                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_AAS")
    4557                      .dwattr $C$DW$653, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4558                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4559                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$654       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$22)
    4562                      .dwattr $C$DW$654, DW_AT_name("XSMT")
    4563                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_XSMT")
    4564                      .dwattr $C$DW$654, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4565                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4566                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$655       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$22)
    4569                      .dwattr $C$DW$655, DW_AT_name("RSFULL")
    4570                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_RSFULL")
    4571                      .dwattr $C$DW$655, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4572                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4573                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4574              $C$DW$656       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$22)
    4576                      .dwattr $C$DW$656, DW_AT_name("BB")
    4577                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_BB")
    4578                      .dwattr $C$DW$656, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4579                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4580                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4581              $C$DW$657       .dwtag  DW_TAG_member
    4582                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$22)
    4583                      .dwattr $C$DW$657, DW_AT_name("NACKSNT")
    4584                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_NACKSNT")
    4585                      .dwattr $C$DW$657, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4586                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4587                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4588              $C$DW$658       .dwtag  DW_TAG_member
    4589                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
    4590                      .dwattr $C$DW$658, DW_AT_name("SDIR")
    4591                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_SDIR")
    4592                      .dwattr $C$DW$658, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4593                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4594                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$659       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$22)
    4597                      .dwattr $C$DW$659, DW_AT_name("rsvd2")
    4598                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_rsvd2")
    4599                      .dwattr $C$DW$659, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4600                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   91

    4601                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4602                      .dwendtag $C$DW$T$37
    4603              
    4604              
    4605              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4606                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_REG")
    4607                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4608              $C$DW$660       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$22)
    4610                      .dwattr $C$DW$660, DW_AT_name("all")
    4611                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_all")
    4612                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4613                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4614              $C$DW$661       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$37)
    4616                      .dwattr $C$DW$661, DW_AT_name("bit")
    4617                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_bit")
    4618                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4619                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4620                      .dwendtag $C$DW$T$38
    4621              
    4622              
    4623              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4624                      .dwattr $C$DW$T$46, DW_AT_name("_ADC_Obj_")
    4625                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x6650)
    4626              $C$DW$662       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$40)
    4628                      .dwattr $C$DW$662, DW_AT_name("ADCRESULT")
    4629                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCRESULT")
    4630                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4631                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4632              $C$DW$663       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$41)
    4634                      .dwattr $C$DW$663, DW_AT_name("resvd_1")
    4635                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_resvd_1")
    4636                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4637                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$664       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$39)
    4640                      .dwattr $C$DW$664, DW_AT_name("ADCCTL1")
    4641                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_ADCCTL1")
    4642                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4643                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4644              $C$DW$665       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$39)
    4646                      .dwattr $C$DW$665, DW_AT_name("ADCCTL2")
    4647                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_ADCCTL2")
    4648                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4649                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4650              $C$DW$666       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$42)
    4652                      .dwattr $C$DW$666, DW_AT_name("rsvd_2")
    4653                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_rsvd_2")
    4654                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4655                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   92

    4656              $C$DW$667       .dwtag  DW_TAG_member
    4657                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$39)
    4658                      .dwattr $C$DW$667, DW_AT_name("ADCINTFLG")
    4659                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCINTFLG")
    4660                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4661                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4662              $C$DW$668       .dwtag  DW_TAG_member
    4663                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$39)
    4664                      .dwattr $C$DW$668, DW_AT_name("ADCINTFLGCLR")
    4665                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4666                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4667                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4668              $C$DW$669       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$39)
    4670                      .dwattr $C$DW$669, DW_AT_name("ADCINTOVF")
    4671                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCINTOVF")
    4672                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4673                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4674              $C$DW$670       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$39)
    4676                      .dwattr $C$DW$670, DW_AT_name("ADCINTOVFCLR")
    4677                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4678                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4679                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4680              $C$DW$671       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$43)
    4682                      .dwattr $C$DW$671, DW_AT_name("INTSELxNy")
    4683                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_INTSELxNy")
    4684                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4685                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4686              $C$DW$672       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$44)
    4688                      .dwattr $C$DW$672, DW_AT_name("rsvd_3")
    4689                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_rsvd_3")
    4690                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4691                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4692              $C$DW$673       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$39)
    4694                      .dwattr $C$DW$673, DW_AT_name("SOCPRICTRL")
    4695                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4696                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4697                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4698              $C$DW$674       .dwtag  DW_TAG_member
    4699                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$39)
    4700                      .dwattr $C$DW$674, DW_AT_name("rsvd_4")
    4701                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_rsvd_4")
    4702                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4703                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4704              $C$DW$675       .dwtag  DW_TAG_member
    4705                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$39)
    4706                      .dwattr $C$DW$675, DW_AT_name("ADCSAMPLEMODE")
    4707                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4708                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4709                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4710              $C$DW$676       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   93

    4711                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$39)
    4712                      .dwattr $C$DW$676, DW_AT_name("rsvd_5")
    4713                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_rsvd_5")
    4714                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4715                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4716              $C$DW$677       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$39)
    4718                      .dwattr $C$DW$677, DW_AT_name("ADCINTSOCSEL1")
    4719                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4720                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4721                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4722              $C$DW$678       .dwtag  DW_TAG_member
    4723                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$39)
    4724                      .dwattr $C$DW$678, DW_AT_name("ADCINTSOCSEL2")
    4725                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4726                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4727                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4728              $C$DW$679       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$42)
    4730                      .dwattr $C$DW$679, DW_AT_name("rsvd_6")
    4731                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_rsvd_6")
    4732                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4733                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4734              $C$DW$680       .dwtag  DW_TAG_member
    4735                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$39)
    4736                      .dwattr $C$DW$680, DW_AT_name("ADCSOCFLG1")
    4737                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4738                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4739                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4740              $C$DW$681       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$39)
    4742                      .dwattr $C$DW$681, DW_AT_name("rsvd_7")
    4743                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_7")
    4744                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4745                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4746              $C$DW$682       .dwtag  DW_TAG_member
    4747                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$39)
    4748                      .dwattr $C$DW$682, DW_AT_name("ADCSOCFRC1")
    4749                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4750                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4751                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4752              $C$DW$683       .dwtag  DW_TAG_member
    4753                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$39)
    4754                      .dwattr $C$DW$683, DW_AT_name("rsvd_8")
    4755                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_8")
    4756                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4757                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4758              $C$DW$684       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$39)
    4760                      .dwattr $C$DW$684, DW_AT_name("ADCSOCOVF1")
    4761                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4762                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4763                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4764              $C$DW$685       .dwtag  DW_TAG_member
    4765                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   94

    4766                      .dwattr $C$DW$685, DW_AT_name("rsvd_9")
    4767                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_rsvd_9")
    4768                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4769                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4770              $C$DW$686       .dwtag  DW_TAG_member
    4771                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$39)
    4772                      .dwattr $C$DW$686, DW_AT_name("ADCSOCOVFCLR1")
    4773                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4774                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4775                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4776              $C$DW$687       .dwtag  DW_TAG_member
    4777                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$39)
    4778                      .dwattr $C$DW$687, DW_AT_name("rsvd_10")
    4779                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_rsvd_10")
    4780                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4781                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4782              $C$DW$688       .dwtag  DW_TAG_member
    4783                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$40)
    4784                      .dwattr $C$DW$688, DW_AT_name("ADCSOCxCTL")
    4785                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4786                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4787                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4788              $C$DW$689       .dwtag  DW_TAG_member
    4789                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$40)
    4790                      .dwattr $C$DW$689, DW_AT_name("rsvd_11")
    4791                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_11")
    4792                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4793                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4794              $C$DW$690       .dwtag  DW_TAG_member
    4795                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$39)
    4796                      .dwattr $C$DW$690, DW_AT_name("ADCREFTRIM")
    4797                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4798                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4799                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4800              $C$DW$691       .dwtag  DW_TAG_member
    4801                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$39)
    4802                      .dwattr $C$DW$691, DW_AT_name("ADCOFFTRIM")
    4803                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4804                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4805                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4806              $C$DW$692       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$45)
    4808                      .dwattr $C$DW$692, DW_AT_name("resvd_12")
    4809                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_resvd_12")
    4810                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4811                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4812              $C$DW$693       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$39)
    4814                      .dwattr $C$DW$693, DW_AT_name("ADCREV")
    4815                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ADCREV")
    4816                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4817                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4818                      .dwendtag $C$DW$T$46
    4819              
    4820              $C$DW$T$258     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   95

    4821                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$T$46)
    4822                      .dwattr $C$DW$T$258, DW_AT_language(DW_LANG_C)
    4823              $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    4824                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$46)
    4825                      .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    4826              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4827                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    4828                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    4829              
    4830              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4831                      .dwattr $C$DW$T$49, DW_AT_name("_CLARKE_Obj_")
    4832                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    4833              $C$DW$694       .dwtag  DW_TAG_member
    4834                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$47)
    4835                      .dwattr $C$DW$694, DW_AT_name("alpha_sf")
    4836                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_alpha_sf")
    4837                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4838                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4839              $C$DW$695       .dwtag  DW_TAG_member
    4840                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$47)
    4841                      .dwattr $C$DW$695, DW_AT_name("beta_sf")
    4842                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_beta_sf")
    4843                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4844                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$696       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$48)
    4847                      .dwattr $C$DW$696, DW_AT_name("numSensors")
    4848                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_numSensors")
    4849                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4850                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4851                      .dwendtag $C$DW$T$49
    4852              
    4853              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4854                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$49)
    4855                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4856              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4857                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$49)
    4858                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    4859              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4860                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4861                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4862              
    4863              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4864                      .dwattr $C$DW$T$51, DW_AT_name("_CLK_Obj_")
    4865                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x11)
    4866              $C$DW$697       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$39)
    4868                      .dwattr $C$DW$697, DW_AT_name("XCLK")
    4869                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_XCLK")
    4870                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4871                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4872              $C$DW$698       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$39)
    4874                      .dwattr $C$DW$698, DW_AT_name("rsvd_1")
    4875                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   96

    4876                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4877                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$699       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$39)
    4880                      .dwattr $C$DW$699, DW_AT_name("CLKCTL")
    4881                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_CLKCTL")
    4882                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4883                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4884              $C$DW$700       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$50)
    4886                      .dwattr $C$DW$700, DW_AT_name("rsvd_2")
    4887                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_2")
    4888                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4889                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$701       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$39)
    4892                      .dwattr $C$DW$701, DW_AT_name("LOSPCP")
    4893                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_LOSPCP")
    4894                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4895                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4896              $C$DW$702       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$39)
    4898                      .dwattr $C$DW$702, DW_AT_name("PCLKCR0")
    4899                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_PCLKCR0")
    4900                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4901                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4902              $C$DW$703       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$39)
    4904                      .dwattr $C$DW$703, DW_AT_name("PCLKCR1")
    4905                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_PCLKCR1")
    4906                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4907                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4908              $C$DW$704       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$42)
    4910                      .dwattr $C$DW$704, DW_AT_name("rsvd_3")
    4911                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_3")
    4912                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4913                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4914              $C$DW$705       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$39)
    4916                      .dwattr $C$DW$705, DW_AT_name("PCLKCR3")
    4917                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_PCLKCR3")
    4918                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4919                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4920                      .dwendtag $C$DW$T$51
    4921              
    4922              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    4923                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$51)
    4924                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    4925              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4926                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    4927                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4928              
    4929              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4930                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_Obj_")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   97

    4931                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4932              $C$DW$706       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$48)
    4934                      .dwattr $C$DW$706, DW_AT_name("tmp")
    4935                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_tmp")
    4936                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4937                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4938                      .dwendtag $C$DW$T$52
    4939              
    4940              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    4941                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$52)
    4942                      .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    4943              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4944                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    4945                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    4946              
    4947              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4948                      .dwattr $C$DW$T$86, DW_AT_name("_CTRL_Obj_")
    4949                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x108)
    4950              $C$DW$707       .dwtag  DW_TAG_member
    4951                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$53)
    4952                      .dwattr $C$DW$707, DW_AT_name("version")
    4953                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_version")
    4954                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4955                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4956              $C$DW$708       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$55)
    4958                      .dwattr $C$DW$708, DW_AT_name("state")
    4959                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_state")
    4960                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4961                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4962              $C$DW$709       .dwtag  DW_TAG_member
    4963                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$55)
    4964                      .dwattr $C$DW$709, DW_AT_name("prevState")
    4965                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_prevState")
    4966                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4967                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4968              $C$DW$710       .dwtag  DW_TAG_member
    4969                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$57)
    4970                      .dwattr $C$DW$710, DW_AT_name("errorCode")
    4971                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_errorCode")
    4972                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4973                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4974              $C$DW$711       .dwtag  DW_TAG_member
    4975                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$59)
    4976                      .dwattr $C$DW$711, DW_AT_name("clarkeHandle_I")
    4977                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4978                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4979                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4980              $C$DW$712       .dwtag  DW_TAG_member
    4981                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$60)
    4982                      .dwattr $C$DW$712, DW_AT_name("clarke_I")
    4983                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_clarke_I")
    4984                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4985                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   98

    4986              $C$DW$713       .dwtag  DW_TAG_member
    4987                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$59)
    4988                      .dwattr $C$DW$713, DW_AT_name("clarkeHandle_V")
    4989                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4990                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4991                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4992              $C$DW$714       .dwtag  DW_TAG_member
    4993                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$60)
    4994                      .dwattr $C$DW$714, DW_AT_name("clarke_V")
    4995                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_clarke_V")
    4996                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4997                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4998              $C$DW$715       .dwtag  DW_TAG_member
    4999                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$62)
    5000                      .dwattr $C$DW$715, DW_AT_name("estHandle")
    5001                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_estHandle")
    5002                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5003                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5004              $C$DW$716       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$64)
    5006                      .dwattr $C$DW$716, DW_AT_name("parkHandle")
    5007                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_parkHandle")
    5008                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5009                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5010              $C$DW$717       .dwtag  DW_TAG_member
    5011                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$65)
    5012                      .dwattr $C$DW$717, DW_AT_name("park")
    5013                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_park")
    5014                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5015                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5016              $C$DW$718       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$67)
    5018                      .dwattr $C$DW$718, DW_AT_name("pidHandle_Id")
    5019                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_pidHandle_Id")
    5020                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5021                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$719       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$68)
    5024                      .dwattr $C$DW$719, DW_AT_name("pid_Id")
    5025                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_pid_Id")
    5026                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5027                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5028              $C$DW$720       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$67)
    5030                      .dwattr $C$DW$720, DW_AT_name("pidHandle_Iq")
    5031                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5032                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5033                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5034              $C$DW$721       .dwtag  DW_TAG_member
    5035                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$68)
    5036                      .dwattr $C$DW$721, DW_AT_name("pid_Iq")
    5037                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_pid_Iq")
    5038                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5039                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5040              $C$DW$722       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE   99

    5041                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$67)
    5042                      .dwattr $C$DW$722, DW_AT_name("pidHandle_spd")
    5043                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_pidHandle_spd")
    5044                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5045                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5046              $C$DW$723       .dwtag  DW_TAG_member
    5047                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$68)
    5048                      .dwattr $C$DW$723, DW_AT_name("pid_spd")
    5049                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_pid_spd")
    5050                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5051                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5052              $C$DW$724       .dwtag  DW_TAG_member
    5053                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$70)
    5054                      .dwattr $C$DW$724, DW_AT_name("iparkHandle")
    5055                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_iparkHandle")
    5056                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5057                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5058              $C$DW$725       .dwtag  DW_TAG_member
    5059                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$71)
    5060                      .dwattr $C$DW$725, DW_AT_name("ipark")
    5061                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_ipark")
    5062                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5063                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5064              $C$DW$726       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$73)
    5066                      .dwattr $C$DW$726, DW_AT_name("svgenHandle")
    5067                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_svgenHandle")
    5068                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5069                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5070              $C$DW$727       .dwtag  DW_TAG_member
    5071                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$74)
    5072                      .dwattr $C$DW$727, DW_AT_name("svgen")
    5073                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_svgen")
    5074                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5075                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5076              $C$DW$728       .dwtag  DW_TAG_member
    5077                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$76)
    5078                      .dwattr $C$DW$728, DW_AT_name("trajHandle_Id")
    5079                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_trajHandle_Id")
    5080                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5081                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5082              $C$DW$729       .dwtag  DW_TAG_member
    5083                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$77)
    5084                      .dwattr $C$DW$729, DW_AT_name("traj_Id")
    5085                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_traj_Id")
    5086                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5087                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5088              $C$DW$730       .dwtag  DW_TAG_member
    5089                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$76)
    5090                      .dwattr $C$DW$730, DW_AT_name("trajHandle_spd")
    5091                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_trajHandle_spd")
    5092                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5093                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5094              $C$DW$731       .dwtag  DW_TAG_member
    5095                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE  100

    5096                      .dwattr $C$DW$731, DW_AT_name("traj_spd")
    5097                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_traj_spd")
    5098                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5099                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5100              $C$DW$732       .dwtag  DW_TAG_member
    5101                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$76)
    5102                      .dwattr $C$DW$732, DW_AT_name("trajHandle_spdMax")
    5103                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5104                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5105                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5106              $C$DW$733       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$77)
    5108                      .dwattr $C$DW$733, DW_AT_name("traj_spdMax")
    5109                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_traj_spdMax")
    5110                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    5111                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5112              $C$DW$734       .dwtag  DW_TAG_member
    5113                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$78)
    5114                      .dwattr $C$DW$734, DW_AT_name("motorParams")
    5115                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_motorParams")
    5116                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    5117                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5118              $C$DW$735       .dwtag  DW_TAG_member
    5119                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$81)
    5120                      .dwattr $C$DW$735, DW_AT_name("waitTimes")
    5121                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_waitTimes")
    5122                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    5123                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5124              $C$DW$736       .dwtag  DW_TAG_member
    5125                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$80)
    5126                      .dwattr $C$DW$736, DW_AT_name("counter_state")
    5127                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_counter_state")
    5128                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    5129                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5130              $C$DW$737       .dwtag  DW_TAG_member
    5131                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$82)
    5132                      .dwattr $C$DW$737, DW_AT_name("numIsrTicksPerCtrlTick")
    5133                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    5134                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    5135                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5136              $C$DW$738       .dwtag  DW_TAG_member
    5137                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$82)
    5138                      .dwattr $C$DW$738, DW_AT_name("numCtrlTicksPerCurrentTick")
    5139                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    5140                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    5141                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5142              $C$DW$739       .dwtag  DW_TAG_member
    5143                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$82)
    5144                      .dwattr $C$DW$739, DW_AT_name("numCtrlTicksPerSpeedTick")
    5145                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    5146                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    5147                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5148              $C$DW$740       .dwtag  DW_TAG_member
    5149                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$82)
    5150                      .dwattr $C$DW$740, DW_AT_name("numCtrlTicksPerTrajTick")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2237210                            PAGE  101

    5151                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    5152                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    5153                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5154              $C$DW$741       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$80)
    5156                      .dwattr $C$DW$741, DW_AT_name("ctrlFreq_Hz")
    5157                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    5158                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    5159                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5160              $C$DW$742       .dwtag  DW_TAG_member
    5161                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$80)
    5162                      .dwattr $C$DW$742, DW_AT_name("trajFreq_Hz")
    5163                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_trajFreq_Hz")
    5164                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    5165                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5166              $C$DW$743       .dwtag  DW_TAG_member
    5167                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$47)
    5168                      .dwattr $C$DW$743, DW_AT_name("trajPeriod_sec")
    5169                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_trajPeriod_sec")
    5170                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    5171                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5172              $C$DW$744       .dwtag  DW_TAG_member
    5173                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$83)
    5174                      .dwattr $C$DW$744, DW_AT_name("ctrlPeriod_sec")
    5175                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    5176                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    5177                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5178              $C$DW$745       .dwtag  DW_TAG_member
    5179                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$47)
    5180                      .dwattr $C$DW$745, DW_AT_name("maxVsMag_pu")
    5181                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_maxVsMag_pu")
    5182                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
