TMS320C2000 Assembler PC v6.4.6 Sat Apr 02 11:21:05 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1114810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Sat Apr 02 11:21:05 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fem/src/32b/fem.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp\

     192                      .global _FEM_init
     193              
     194              $C$DW$19        .dwtag  DW_TAG_subprogram, DW_AT_name("FEM_init")
     195                      .dwattr $C$DW$19, DW_AT_low_pc(_FEM_init)
     196                      .dwattr $C$DW$19, DW_AT_high_pc(0x00)
     197                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_FEM_init")
     198                      .dwattr $C$DW$19, DW_AT_external
     199                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$24)
     200                      .dwattr $C$DW$19, DW_AT_TI_begin_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fem/src/32b/fe
     201                      .dwattr $C$DW$19, DW_AT_TI_begin_line(0x15)
     202                      .dwattr $C$DW$19, DW_AT_TI_begin_column(0x0c)
     203                      .dwattr $C$DW$19, DW_AT_TI_max_frame_size(-2)
     204                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/fem/src/32b/fem.c",line 22,column 1,is_
     205              
     206                      .dwfde $C$DW$CIE, _FEM_init
     207              $C$DW$20        .dwtag  DW_TAG_formal_parameter, DW_AT_name("pMemory")
     208                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pMemory")
     209                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$3)
     210                      .dwattr $C$DW$20, DW_AT_location[DW_OP_reg12]
     211              $C$DW$21        .dwtag  DW_TAG_formal_parameter, DW_AT_name("numBytes")
     212                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_numBytes")
     213                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$27)
     214                      .dwattr $C$DW$21, DW_AT_location[DW_OP_reg0]
TMS320C2000 Assembler PC v6.4.6 Sat Apr 02 11:21:05 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1114810                            PAGE    5

     215              
     216              ;***************************************************************
     217              ;* FNAME: _FEM_init                     FR SIZE:   0           *
     218              ;*                                                             *
     219              ;* FUNCTION ENVIRONMENT                                        *
     220              ;*                                                             *
     221              ;* FUNCTION PROPERTIES                                         *
     222              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     223              ;***************************************************************
     224              
     225              _FEM_init:
     226              ;* AR6   assigned to _numBytes
     227              $C$DW$22        .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
     228                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_numBytes")
     229                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$27)
     230                      .dwattr $C$DW$22, DW_AT_location[DW_OP_reg16]
     231                      .dwcfi  cfa_offset, -2
     232                      .dwcfi  save_reg_to_mem, 26, 0
     233 00000032 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     234                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/fem/src/32b/fem.c",line 26,column 5,is_
     235 00000033 0212          MOVB      ACC,#18               ; [CPU_] |26| 
     236 00000034 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     237 00000035 56C9          BF        $C$L1,LOS             ; [CPU_] |26| 
         00000036 0003 
     238                      ; branchcc occurs ; [] |26| 
     239 00000037 D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     240              $C$L1:    
     241              $C$DW$23        .dwtag  DW_TAG_TI_branch
     242                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     243                      .dwattr $C$DW$23, DW_AT_TI_return
     244 00000038 0006          LRETR     ; [CPU_] 
     245                      ; return occurs ; [] 
     246                      .dwattr $C$DW$19, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/fem/src/32b/fem.
     247                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x20)
     248                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     249                      .dwendentry
     250                      .dwendtag $C$DW$19
     251              
     252              ;**************************************************************
     253              ;* UNDEFINED EXTERNAL REFERENCES                              *
     254              ;**************************************************************
     255                      .global FS$$SUB
     256                      .global FS$$DIV
     257                      .global FS$$TOUL
     258                      .global FS$$ADD
     259              
     260              ;***************************************************************
     261              ;* TYPE INFORMATION                                            *
     262              ;***************************************************************
     263              
     264              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     265                      .dwattr $C$DW$T$21, DW_AT_name("_FEM_Obj_")
     266                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x12)
     267              $C$DW$24        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.6 Sat Apr 02 11:21:05 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1114810                            PAGE    6

     269                      .dwattr $C$DW$24, DW_AT_name("timerPeriod_cnts")
     270                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     271                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     272                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     273              $C$DW$25        .dwtag  DW_TAG_member
     274                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     275                      .dwattr $C$DW$25, DW_AT_name("cnt_z0")
     276                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_cnt_z0")
     277                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     278                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     279              $C$DW$26        .dwtag  DW_TAG_member
     280                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     281                      .dwattr $C$DW$26, DW_AT_name("cnt_z1")
     282                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_cnt_z1")
     283                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     284                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     285              $C$DW$27        .dwtag  DW_TAG_member
     286                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     287                      .dwattr $C$DW$27, DW_AT_name("deltaCnt")
     288                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_deltaCnt")
     289                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     290                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     291              $C$DW$28        .dwtag  DW_TAG_member
     292                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     293                      .dwattr $C$DW$28, DW_AT_name("maxDeltaCnt")
     294                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_maxDeltaCnt")
     295                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     296                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     297              $C$DW$29        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     299                      .dwattr $C$DW$29, DW_AT_name("minDeltaCnt")
     300                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_minDeltaCnt")
     301                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     302                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     303              $C$DW$30        .dwtag  DW_TAG_member
     304                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     305                      .dwattr $C$DW$30, DW_AT_name("maxDeltaCntObserved")
     306                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
     307                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     308                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     309              $C$DW$31        .dwtag  DW_TAG_member
     310                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     311                      .dwattr $C$DW$31, DW_AT_name("errorCnt")
     312                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_errorCnt")
     313                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     314                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     315              $C$DW$32        .dwtag  DW_TAG_member
     316                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     317                      .dwattr $C$DW$32, DW_AT_name("flag_freqError")
     318                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_flag_freqError")
     319                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     320                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     321                      .dwendtag $C$DW$T$21
     322              
     323              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Obj")
TMS320C2000 Assembler PC v6.4.6 Sat Apr 02 11:21:05 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1114810                            PAGE    7

     324                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     325                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     326              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     327                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     328                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     329              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("FEM_Handle")
     330                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     331                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     332              $C$DW$33        .dwtag  DW_TAG_TI_far_type
     333                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$24)
     334              $C$DW$T$25      .dwtag  DW_TAG_const_type
     335                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$33)
     336              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     337                      .dwattr $C$DW$T$2, DW_AT_name("void")
     338              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     339                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     340                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     341              $C$DW$T$4       .dwtag  DW_TAG_base_type
     342                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     343                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     344                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     345              $C$DW$T$5       .dwtag  DW_TAG_base_type
     346                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     347                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     348                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     349              $C$DW$T$6       .dwtag  DW_TAG_base_type
     350                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     351                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     352                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     353              $C$DW$T$7       .dwtag  DW_TAG_base_type
     354                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     355                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     356                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     357              $C$DW$T$8       .dwtag  DW_TAG_base_type
     358                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     359                      .dwattr $C$DW$T$8, DW_AT_name("short")
     360                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     361              $C$DW$T$9       .dwtag  DW_TAG_base_type
     362                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     363                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     364                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     365              $C$DW$T$10      .dwtag  DW_TAG_base_type
     366                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     367                      .dwattr $C$DW$T$10, DW_AT_name("int")
     368                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     369              $C$DW$T$11      .dwtag  DW_TAG_base_type
     370                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     371                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
