TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Thu Aug 04 15:58:24 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_setSuspend")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_setSuspend")

    9782                      .dwattr $C$DW$T$335, DW_AT_byte_size(0x01)
    9783              $C$DW$1718      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9784              $C$DW$1719      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  188

    9785                      .dwendtag $C$DW$T$335
    9786              
    9787              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9788                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
    9789                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
    9790              $C$DW$1720      .dwtag  DW_TAG_TI_far_type
    9791                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$336)
    9792              $C$DW$T$337     .dwtag  DW_TAG_const_type
    9793                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$1720)
    9794              
    9795              $C$DW$T$338     .dwtag  DW_TAG_enumeration_type
    9796                      .dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
    9797              $C$DW$1721      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9798              $C$DW$1722      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9799                      .dwendtag $C$DW$T$338
    9800              
    9801              $C$DW$T$339     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9802                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
    9803                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
    9804              $C$DW$1723      .dwtag  DW_TAG_TI_far_type
    9805                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$339)
    9806              $C$DW$T$340     .dwtag  DW_TAG_const_type
    9807                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$1723)
    9808              
    9809              $C$DW$T$341     .dwtag  DW_TAG_enumeration_type
    9810                      .dwattr $C$DW$T$341, DW_AT_byte_size(0x01)
    9811              $C$DW$1724      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9812              $C$DW$1725      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9813              $C$DW$1726      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9814                      .dwendtag $C$DW$T$341
    9815              
    9816              $C$DW$T$342     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9817                      .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
    9818                      .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
    9819              $C$DW$1727      .dwtag  DW_TAG_TI_far_type
    9820                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$342)
    9821              $C$DW$T$343     .dwtag  DW_TAG_const_type
    9822                      .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$1727)
    9823              
    9824              $C$DW$T$344     .dwtag  DW_TAG_enumeration_type
    9825                      .dwattr $C$DW$T$344, DW_AT_byte_size(0x01)
    9826              $C$DW$1728      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    9827              $C$DW$1729      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    9828              $C$DW$1730      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    9829                      .dwendtag $C$DW$T$344
    9830              
    9831              $C$DW$T$345     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    9832                      .dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$344)
    9833                      .dwattr $C$DW$T$345, DW_AT_language(DW_LANG_C)
    9834              $C$DW$1731      .dwtag  DW_TAG_TI_far_type
    9835                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$345)
    9836              $C$DW$T$346     .dwtag  DW_TAG_const_type
    9837                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$1731)
    9838              
    9839              $C$DW$T$347     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  189

    9840                      .dwattr $C$DW$T$347, DW_AT_byte_size(0x01)
    9841              $C$DW$1732      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9842              $C$DW$1733      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9843                      .dwendtag $C$DW$T$347
    9844              
    9845              $C$DW$T$348     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9846                      .dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$347)
    9847                      .dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
    9848              
    9849              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    9850                      .dwattr $C$DW$T$22, DW_AT_name("I2CEMDR_BITS")
    9851                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    9852              $C$DW$1734      .dwtag  DW_TAG_member
    9853                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$21)
    9854                      .dwattr $C$DW$1734, DW_AT_name("BCM")
    9855                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_BCM")
    9856                      .dwattr $C$DW$1734, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    9857                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9858                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
    9859              $C$DW$1735      .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$21)
    9861                      .dwattr $C$DW$1735, DW_AT_name("rsvd1")
    9862                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_rsvd1")
    9863                      .dwattr $C$DW$1735, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    9864                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9865                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
    9866                      .dwendtag $C$DW$T$22
    9867              
    9868              
    9869              $C$DW$T$23      .dwtag  DW_TAG_union_type
    9870                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_REG")
    9871                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    9872              $C$DW$1736      .dwtag  DW_TAG_member
    9873                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$21)
    9874                      .dwattr $C$DW$1736, DW_AT_name("all")
    9875                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_all")
    9876                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9877                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
    9878              $C$DW$1737      .dwtag  DW_TAG_member
    9879                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$22)
    9880                      .dwattr $C$DW$1737, DW_AT_name("bit")
    9881                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_bit")
    9882                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9883                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
    9884                      .dwendtag $C$DW$T$23
    9885              
    9886              
    9887              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    9888                      .dwattr $C$DW$T$24, DW_AT_name("I2CFFRX_BITS")
    9889                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    9890              $C$DW$1738      .dwtag  DW_TAG_member
    9891                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$21)
    9892                      .dwattr $C$DW$1738, DW_AT_name("RXFFIL")
    9893                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_RXFFIL")
    9894                      .dwattr $C$DW$1738, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  190

    9895                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9896                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
    9897              $C$DW$1739      .dwtag  DW_TAG_member
    9898                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$21)
    9899                      .dwattr $C$DW$1739, DW_AT_name("RXFFIENA")
    9900                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_RXFFIENA")
    9901                      .dwattr $C$DW$1739, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9902                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9903                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
    9904              $C$DW$1740      .dwtag  DW_TAG_member
    9905                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$21)
    9906                      .dwattr $C$DW$1740, DW_AT_name("RXFFINTCLR")
    9907                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_RXFFINTCLR")
    9908                      .dwattr $C$DW$1740, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9909                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9910                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
    9911              $C$DW$1741      .dwtag  DW_TAG_member
    9912                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$21)
    9913                      .dwattr $C$DW$1741, DW_AT_name("RXFFINT")
    9914                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_RXFFINT")
    9915                      .dwattr $C$DW$1741, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9916                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9917                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
    9918              $C$DW$1742      .dwtag  DW_TAG_member
    9919                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$21)
    9920                      .dwattr $C$DW$1742, DW_AT_name("RXFFST")
    9921                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_RXFFST")
    9922                      .dwattr $C$DW$1742, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    9923                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9924                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
    9925              $C$DW$1743      .dwtag  DW_TAG_member
    9926                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$21)
    9927                      .dwattr $C$DW$1743, DW_AT_name("RXFFRST")
    9928                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_RXFFRST")
    9929                      .dwattr $C$DW$1743, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    9930                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9931                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
    9932              $C$DW$1744      .dwtag  DW_TAG_member
    9933                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$21)
    9934                      .dwattr $C$DW$1744, DW_AT_name("rsvd1")
    9935                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_rsvd1")
    9936                      .dwattr $C$DW$1744, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    9937                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9938                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
    9939                      .dwendtag $C$DW$T$24
    9940              
    9941              
    9942              $C$DW$T$25      .dwtag  DW_TAG_union_type
    9943                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_REG")
    9944                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    9945              $C$DW$1745      .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$21)
    9947                      .dwattr $C$DW$1745, DW_AT_name("all")
    9948                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_all")
    9949                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  191

    9950                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
    9951              $C$DW$1746      .dwtag  DW_TAG_member
    9952                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$24)
    9953                      .dwattr $C$DW$1746, DW_AT_name("bit")
    9954                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_bit")
    9955                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9956                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
    9957                      .dwendtag $C$DW$T$25
    9958              
    9959              
    9960              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    9961                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFTX_BITS")
    9962                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    9963              $C$DW$1747      .dwtag  DW_TAG_member
    9964                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$21)
    9965                      .dwattr $C$DW$1747, DW_AT_name("TXFFIL")
    9966                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_TXFFIL")
    9967                      .dwattr $C$DW$1747, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    9968                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9969                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
    9970              $C$DW$1748      .dwtag  DW_TAG_member
    9971                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$21)
    9972                      .dwattr $C$DW$1748, DW_AT_name("TXFFIENA")
    9973                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_TXFFIENA")
    9974                      .dwattr $C$DW$1748, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    9975                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9976                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
    9977              $C$DW$1749      .dwtag  DW_TAG_member
    9978                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$21)
    9979                      .dwattr $C$DW$1749, DW_AT_name("TXFFINTCLR")
    9980                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_TXFFINTCLR")
    9981                      .dwattr $C$DW$1749, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    9982                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9983                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
    9984              $C$DW$1750      .dwtag  DW_TAG_member
    9985                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$21)
    9986                      .dwattr $C$DW$1750, DW_AT_name("TXFFINT")
    9987                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_TXFFINT")
    9988                      .dwattr $C$DW$1750, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    9989                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9990                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
    9991              $C$DW$1751      .dwtag  DW_TAG_member
    9992                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$21)
    9993                      .dwattr $C$DW$1751, DW_AT_name("TXFFST")
    9994                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_TXFFST")
    9995                      .dwattr $C$DW$1751, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    9996                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9997                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
    9998              $C$DW$1752      .dwtag  DW_TAG_member
    9999                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$21)
   10000                      .dwattr $C$DW$1752, DW_AT_name("TXFFRST")
   10001                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_TXFFRST")
   10002                      .dwattr $C$DW$1752, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
   10003                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10004                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  192

   10005              $C$DW$1753      .dwtag  DW_TAG_member
   10006                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$21)
   10007                      .dwattr $C$DW$1753, DW_AT_name("I2CFFEN")
   10008                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_I2CFFEN")
   10009                      .dwattr $C$DW$1753, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
   10010                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10011                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
   10012              $C$DW$1754      .dwtag  DW_TAG_member
   10013                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$21)
   10014                      .dwattr $C$DW$1754, DW_AT_name("rsvd1")
   10015                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_rsvd1")
   10016                      .dwattr $C$DW$1754, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
   10017                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10018                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
   10019                      .dwendtag $C$DW$T$26
   10020              
   10021              
   10022              $C$DW$T$27      .dwtag  DW_TAG_union_type
   10023                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_REG")
   10024                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
   10025              $C$DW$1755      .dwtag  DW_TAG_member
   10026                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$21)
   10027                      .dwattr $C$DW$1755, DW_AT_name("all")
   10028                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_all")
   10029                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10030                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
   10031              $C$DW$1756      .dwtag  DW_TAG_member
   10032                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$26)
   10033                      .dwattr $C$DW$1756, DW_AT_name("bit")
   10034                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_bit")
   10035                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10036                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
   10037                      .dwendtag $C$DW$T$27
   10038              
   10039              
   10040              $C$DW$T$28      .dwtag  DW_TAG_structure_type
   10041                      .dwattr $C$DW$T$28, DW_AT_name("I2CIER_BITS")
   10042                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
   10043              $C$DW$1757      .dwtag  DW_TAG_member
   10044                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$21)
   10045                      .dwattr $C$DW$1757, DW_AT_name("ARBL")
   10046                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_ARBL")
   10047                      .dwattr $C$DW$1757, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
   10048                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10049                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
   10050              $C$DW$1758      .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$21)
   10052                      .dwattr $C$DW$1758, DW_AT_name("NACK")
   10053                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_NACK")
   10054                      .dwattr $C$DW$1758, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
   10055                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10056                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
   10057              $C$DW$1759      .dwtag  DW_TAG_member
   10058                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$21)
   10059                      .dwattr $C$DW$1759, DW_AT_name("ARDY")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  193

   10060                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_ARDY")
   10061                      .dwattr $C$DW$1759, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
   10062                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10063                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
   10064              $C$DW$1760      .dwtag  DW_TAG_member
   10065                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$21)
   10066                      .dwattr $C$DW$1760, DW_AT_name("RRDY")
   10067                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_RRDY")
   10068                      .dwattr $C$DW$1760, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
   10069                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10070                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
   10071              $C$DW$1761      .dwtag  DW_TAG_member
   10072                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$21)
   10073                      .dwattr $C$DW$1761, DW_AT_name("XRDY")
   10074                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_XRDY")
   10075                      .dwattr $C$DW$1761, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
   10076                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10077                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
   10078              $C$DW$1762      .dwtag  DW_TAG_member
   10079                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$21)
   10080                      .dwattr $C$DW$1762, DW_AT_name("SCD")
   10081                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_SCD")
   10082                      .dwattr $C$DW$1762, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   10083                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10084                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
   10085              $C$DW$1763      .dwtag  DW_TAG_member
   10086                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$21)
   10087                      .dwattr $C$DW$1763, DW_AT_name("AAS")
   10088                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_AAS")
   10089                      .dwattr $C$DW$1763, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
   10090                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10091                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
   10092              $C$DW$1764      .dwtag  DW_TAG_member
   10093                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$21)
   10094                      .dwattr $C$DW$1764, DW_AT_name("rsvd")
   10095                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_rsvd")
   10096                      .dwattr $C$DW$1764, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
   10097                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10098                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
   10099                      .dwendtag $C$DW$T$28
   10100              
   10101              
   10102              $C$DW$T$29      .dwtag  DW_TAG_union_type
   10103                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_REG")
   10104                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
   10105              $C$DW$1765      .dwtag  DW_TAG_member
   10106                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$21)
   10107                      .dwattr $C$DW$1765, DW_AT_name("all")
   10108                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_all")
   10109                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10110                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
   10111              $C$DW$1766      .dwtag  DW_TAG_member
   10112                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$28)
   10113                      .dwattr $C$DW$1766, DW_AT_name("bit")
   10114                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  194

   10115                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10116                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
   10117                      .dwendtag $C$DW$T$29
   10118              
   10119              
   10120              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10121                      .dwattr $C$DW$T$30, DW_AT_name("I2CISRC_BITS")
   10122                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
   10123              $C$DW$1767      .dwtag  DW_TAG_member
   10124                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$21)
   10125                      .dwattr $C$DW$1767, DW_AT_name("INTCODE")
   10126                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_INTCODE")
   10127                      .dwattr $C$DW$1767, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
   10128                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10129                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   10130              $C$DW$1768      .dwtag  DW_TAG_member
   10131                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$21)
   10132                      .dwattr $C$DW$1768, DW_AT_name("rsvd1")
   10133                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_rsvd1")
   10134                      .dwattr $C$DW$1768, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
   10135                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10136                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   10137                      .dwendtag $C$DW$T$30
   10138              
   10139              
   10140              $C$DW$T$31      .dwtag  DW_TAG_union_type
   10141                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_REG")
   10142                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
   10143              $C$DW$1769      .dwtag  DW_TAG_member
   10144                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$21)
   10145                      .dwattr $C$DW$1769, DW_AT_name("all")
   10146                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_all")
   10147                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10148                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
   10149              $C$DW$1770      .dwtag  DW_TAG_member
   10150                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$30)
   10151                      .dwattr $C$DW$1770, DW_AT_name("bit")
   10152                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_bit")
   10153                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10154                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   10155                      .dwendtag $C$DW$T$31
   10156              
   10157              
   10158              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   10159                      .dwattr $C$DW$T$32, DW_AT_name("I2CMDR_BITS")
   10160                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
   10161              $C$DW$1771      .dwtag  DW_TAG_member
   10162                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$21)
   10163                      .dwattr $C$DW$1771, DW_AT_name("BC")
   10164                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_BC")
   10165                      .dwattr $C$DW$1771, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
   10166                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10167                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   10168              $C$DW$1772      .dwtag  DW_TAG_member
   10169                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  195

   10170                      .dwattr $C$DW$1772, DW_AT_name("FDF")
   10171                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_FDF")
   10172                      .dwattr $C$DW$1772, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
   10173                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10174                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   10175              $C$DW$1773      .dwtag  DW_TAG_member
   10176                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$21)
   10177                      .dwattr $C$DW$1773, DW_AT_name("STB")
   10178                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_STB")
   10179                      .dwattr $C$DW$1773, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
   10180                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10181                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   10182              $C$DW$1774      .dwtag  DW_TAG_member
   10183                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$21)
   10184                      .dwattr $C$DW$1774, DW_AT_name("IRS")
   10185                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_IRS")
   10186                      .dwattr $C$DW$1774, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   10187                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10188                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   10189              $C$DW$1775      .dwtag  DW_TAG_member
   10190                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$21)
   10191                      .dwattr $C$DW$1775, DW_AT_name("DLB")
   10192                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_DLB")
   10193                      .dwattr $C$DW$1775, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
   10194                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10195                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   10196              $C$DW$1776      .dwtag  DW_TAG_member
   10197                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$21)
   10198                      .dwattr $C$DW$1776, DW_AT_name("RM")
   10199                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_RM")
   10200                      .dwattr $C$DW$1776, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
   10201                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10202                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   10203              $C$DW$1777      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$21)
   10205                      .dwattr $C$DW$1777, DW_AT_name("XA")
   10206                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_XA")
   10207                      .dwattr $C$DW$1777, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
   10208                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10209                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   10210              $C$DW$1778      .dwtag  DW_TAG_member
   10211                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$21)
   10212                      .dwattr $C$DW$1778, DW_AT_name("TRX")
   10213                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_TRX")
   10214                      .dwattr $C$DW$1778, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
   10215                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10216                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   10217              $C$DW$1779      .dwtag  DW_TAG_member
   10218                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$21)
   10219                      .dwattr $C$DW$1779, DW_AT_name("MST")
   10220                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_MST")
   10221                      .dwattr $C$DW$1779, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
   10222                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10223                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   10224              $C$DW$1780      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  196

   10225                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$21)
   10226                      .dwattr $C$DW$1780, DW_AT_name("STP")
   10227                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_STP")
   10228                      .dwattr $C$DW$1780, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
   10229                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10230                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   10231              $C$DW$1781      .dwtag  DW_TAG_member
   10232                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$21)
   10233                      .dwattr $C$DW$1781, DW_AT_name("rsvd1")
   10234                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_rsvd1")
   10235                      .dwattr $C$DW$1781, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
   10236                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10237                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   10238              $C$DW$1782      .dwtag  DW_TAG_member
   10239                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$21)
   10240                      .dwattr $C$DW$1782, DW_AT_name("STT")
   10241                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_STT")
   10242                      .dwattr $C$DW$1782, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
   10243                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10244                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   10245              $C$DW$1783      .dwtag  DW_TAG_member
   10246                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$21)
   10247                      .dwattr $C$DW$1783, DW_AT_name("FREE")
   10248                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_FREE")
   10249                      .dwattr $C$DW$1783, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
   10250                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10251                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   10252              $C$DW$1784      .dwtag  DW_TAG_member
   10253                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$21)
   10254                      .dwattr $C$DW$1784, DW_AT_name("NACKMOD")
   10255                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_NACKMOD")
   10256                      .dwattr $C$DW$1784, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
   10257                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10258                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   10259                      .dwendtag $C$DW$T$32
   10260              
   10261              
   10262              $C$DW$T$33      .dwtag  DW_TAG_union_type
   10263                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_REG")
   10264                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
   10265              $C$DW$1785      .dwtag  DW_TAG_member
   10266                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$21)
   10267                      .dwattr $C$DW$1785, DW_AT_name("all")
   10268                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_all")
   10269                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10270                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   10271              $C$DW$1786      .dwtag  DW_TAG_member
   10272                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$32)
   10273                      .dwattr $C$DW$1786, DW_AT_name("bit")
   10274                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_bit")
   10275                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10276                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   10277                      .dwendtag $C$DW$T$33
   10278              
   10279              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  197

   10280              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   10281                      .dwattr $C$DW$T$34, DW_AT_name("I2CPSC_BITS")
   10282                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   10283              $C$DW$1787      .dwtag  DW_TAG_member
   10284                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$21)
   10285                      .dwattr $C$DW$1787, DW_AT_name("IPSC")
   10286                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_IPSC")
   10287                      .dwattr $C$DW$1787, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
   10288                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10289                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   10290              $C$DW$1788      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$21)
   10292                      .dwattr $C$DW$1788, DW_AT_name("rsvd1")
   10293                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_rsvd1")
   10294                      .dwattr $C$DW$1788, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
   10295                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10296                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   10297                      .dwendtag $C$DW$T$34
   10298              
   10299              
   10300              $C$DW$T$35      .dwtag  DW_TAG_union_type
   10301                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_REG")
   10302                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
   10303              $C$DW$1789      .dwtag  DW_TAG_member
   10304                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$21)
   10305                      .dwattr $C$DW$1789, DW_AT_name("all")
   10306                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_all")
   10307                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10308                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   10309              $C$DW$1790      .dwtag  DW_TAG_member
   10310                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$34)
   10311                      .dwattr $C$DW$1790, DW_AT_name("bit")
   10312                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_bit")
   10313                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10314                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   10315                      .dwendtag $C$DW$T$35
   10316              
   10317              
   10318              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   10319                      .dwattr $C$DW$T$36, DW_AT_name("I2CSTR_BITS")
   10320                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
   10321              $C$DW$1791      .dwtag  DW_TAG_member
   10322                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$21)
   10323                      .dwattr $C$DW$1791, DW_AT_name("ARBL")
   10324                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_ARBL")
   10325                      .dwattr $C$DW$1791, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
   10326                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10327                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   10328              $C$DW$1792      .dwtag  DW_TAG_member
   10329                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$21)
   10330                      .dwattr $C$DW$1792, DW_AT_name("NACK")
   10331                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_NACK")
   10332                      .dwattr $C$DW$1792, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
   10333                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10334                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  198

   10335              $C$DW$1793      .dwtag  DW_TAG_member
   10336                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$21)
   10337                      .dwattr $C$DW$1793, DW_AT_name("ARDY")
   10338                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ARDY")
   10339                      .dwattr $C$DW$1793, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
   10340                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10341                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   10342              $C$DW$1794      .dwtag  DW_TAG_member
   10343                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$21)
   10344                      .dwattr $C$DW$1794, DW_AT_name("RRDY")
   10345                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_RRDY")
   10346                      .dwattr $C$DW$1794, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
   10347                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10348                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   10349              $C$DW$1795      .dwtag  DW_TAG_member
   10350                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$21)
   10351                      .dwattr $C$DW$1795, DW_AT_name("XRDY")
   10352                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_XRDY")
   10353                      .dwattr $C$DW$1795, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
   10354                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10355                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   10356              $C$DW$1796      .dwtag  DW_TAG_member
   10357                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$21)
   10358                      .dwattr $C$DW$1796, DW_AT_name("SCD")
   10359                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_SCD")
   10360                      .dwattr $C$DW$1796, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
   10361                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10362                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   10363              $C$DW$1797      .dwtag  DW_TAG_member
   10364                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$21)
   10365                      .dwattr $C$DW$1797, DW_AT_name("rsvd1")
   10366                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_rsvd1")
   10367                      .dwattr $C$DW$1797, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
   10368                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10369                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   10370              $C$DW$1798      .dwtag  DW_TAG_member
   10371                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$21)
   10372                      .dwattr $C$DW$1798, DW_AT_name("AD0")
   10373                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_AD0")
   10374                      .dwattr $C$DW$1798, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
   10375                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10376                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   10377              $C$DW$1799      .dwtag  DW_TAG_member
   10378                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$21)
   10379                      .dwattr $C$DW$1799, DW_AT_name("AAS")
   10380                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_AAS")
   10381                      .dwattr $C$DW$1799, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
   10382                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10383                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   10384              $C$DW$1800      .dwtag  DW_TAG_member
   10385                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$21)
   10386                      .dwattr $C$DW$1800, DW_AT_name("XSMT")
   10387                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_XSMT")
   10388                      .dwattr $C$DW$1800, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
   10389                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  199

   10390                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   10391              $C$DW$1801      .dwtag  DW_TAG_member
   10392                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$21)
   10393                      .dwattr $C$DW$1801, DW_AT_name("RSFULL")
   10394                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_RSFULL")
   10395                      .dwattr $C$DW$1801, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
   10396                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10397                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   10398              $C$DW$1802      .dwtag  DW_TAG_member
   10399                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$21)
   10400                      .dwattr $C$DW$1802, DW_AT_name("BB")
   10401                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_BB")
   10402                      .dwattr $C$DW$1802, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
   10403                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10404                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   10405              $C$DW$1803      .dwtag  DW_TAG_member
   10406                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$21)
   10407                      .dwattr $C$DW$1803, DW_AT_name("NACKSNT")
   10408                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_NACKSNT")
   10409                      .dwattr $C$DW$1803, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
   10410                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10411                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   10412              $C$DW$1804      .dwtag  DW_TAG_member
   10413                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$21)
   10414                      .dwattr $C$DW$1804, DW_AT_name("SDIR")
   10415                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_SDIR")
   10416                      .dwattr $C$DW$1804, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
   10417                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10418                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   10419              $C$DW$1805      .dwtag  DW_TAG_member
   10420                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$21)
   10421                      .dwattr $C$DW$1805, DW_AT_name("rsvd2")
   10422                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_rsvd2")
   10423                      .dwattr $C$DW$1805, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
   10424                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10425                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   10426                      .dwendtag $C$DW$T$36
   10427              
   10428              
   10429              $C$DW$T$37      .dwtag  DW_TAG_union_type
   10430                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_REG")
   10431                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
   10432              $C$DW$1806      .dwtag  DW_TAG_member
   10433                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$21)
   10434                      .dwattr $C$DW$1806, DW_AT_name("all")
   10435                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_all")
   10436                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10437                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   10438              $C$DW$1807      .dwtag  DW_TAG_member
   10439                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$36)
   10440                      .dwattr $C$DW$1807, DW_AT_name("bit")
   10441                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_bit")
   10442                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10443                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   10444                      .dwendtag $C$DW$T$37
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  200

   10445              
   10446              
   10447              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   10448                      .dwattr $C$DW$T$45, DW_AT_name("_ADC_Obj_")
   10449                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x6650)
   10450              $C$DW$1808      .dwtag  DW_TAG_member
   10451                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$39)
   10452                      .dwattr $C$DW$1808, DW_AT_name("ADCRESULT")
   10453                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_ADCRESULT")
   10454                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10455                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   10456              $C$DW$1809      .dwtag  DW_TAG_member
   10457                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$40)
   10458                      .dwattr $C$DW$1809, DW_AT_name("resvd_1")
   10459                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_resvd_1")
   10460                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10461                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   10462              $C$DW$1810      .dwtag  DW_TAG_member
   10463                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$38)
   10464                      .dwattr $C$DW$1810, DW_AT_name("ADCCTL1")
   10465                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_ADCCTL1")
   10466                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10467                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   10468              $C$DW$1811      .dwtag  DW_TAG_member
   10469                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$38)
   10470                      .dwattr $C$DW$1811, DW_AT_name("ADCCTL2")
   10471                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_ADCCTL2")
   10472                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10473                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10474              $C$DW$1812      .dwtag  DW_TAG_member
   10475                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$41)
   10476                      .dwattr $C$DW$1812, DW_AT_name("rsvd_2")
   10477                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_rsvd_2")
   10478                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10479                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10480              $C$DW$1813      .dwtag  DW_TAG_member
   10481                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$38)
   10482                      .dwattr $C$DW$1813, DW_AT_name("ADCINTFLG")
   10483                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_ADCINTFLG")
   10484                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10485                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10486              $C$DW$1814      .dwtag  DW_TAG_member
   10487                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$38)
   10488                      .dwattr $C$DW$1814, DW_AT_name("ADCINTFLGCLR")
   10489                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10490                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10491                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10492              $C$DW$1815      .dwtag  DW_TAG_member
   10493                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$38)
   10494                      .dwattr $C$DW$1815, DW_AT_name("ADCINTOVF")
   10495                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_ADCINTOVF")
   10496                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10497                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10498              $C$DW$1816      .dwtag  DW_TAG_member
   10499                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  201

   10500                      .dwattr $C$DW$1816, DW_AT_name("ADCINTOVFCLR")
   10501                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10502                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10503                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10504              $C$DW$1817      .dwtag  DW_TAG_member
   10505                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$42)
   10506                      .dwattr $C$DW$1817, DW_AT_name("INTSELxNy")
   10507                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_INTSELxNy")
   10508                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10509                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10510              $C$DW$1818      .dwtag  DW_TAG_member
   10511                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$43)
   10512                      .dwattr $C$DW$1818, DW_AT_name("rsvd_3")
   10513                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_rsvd_3")
   10514                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10515                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10516              $C$DW$1819      .dwtag  DW_TAG_member
   10517                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$38)
   10518                      .dwattr $C$DW$1819, DW_AT_name("SOCPRICTRL")
   10519                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10520                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10521                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10522              $C$DW$1820      .dwtag  DW_TAG_member
   10523                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$38)
   10524                      .dwattr $C$DW$1820, DW_AT_name("rsvd_4")
   10525                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_rsvd_4")
   10526                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10527                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10528              $C$DW$1821      .dwtag  DW_TAG_member
   10529                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$38)
   10530                      .dwattr $C$DW$1821, DW_AT_name("ADCSAMPLEMODE")
   10531                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10532                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10533                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10534              $C$DW$1822      .dwtag  DW_TAG_member
   10535                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$38)
   10536                      .dwattr $C$DW$1822, DW_AT_name("rsvd_5")
   10537                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_rsvd_5")
   10538                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10539                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10540              $C$DW$1823      .dwtag  DW_TAG_member
   10541                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$38)
   10542                      .dwattr $C$DW$1823, DW_AT_name("ADCINTSOCSEL1")
   10543                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10544                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10545                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10546              $C$DW$1824      .dwtag  DW_TAG_member
   10547                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$38)
   10548                      .dwattr $C$DW$1824, DW_AT_name("ADCINTSOCSEL2")
   10549                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10550                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10551                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10552              $C$DW$1825      .dwtag  DW_TAG_member
   10553                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$41)
   10554                      .dwattr $C$DW$1825, DW_AT_name("rsvd_6")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  202

   10555                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_rsvd_6")
   10556                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10557                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10558              $C$DW$1826      .dwtag  DW_TAG_member
   10559                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$38)
   10560                      .dwattr $C$DW$1826, DW_AT_name("ADCSOCFLG1")
   10561                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10562                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10563                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10564              $C$DW$1827      .dwtag  DW_TAG_member
   10565                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$38)
   10566                      .dwattr $C$DW$1827, DW_AT_name("rsvd_7")
   10567                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_rsvd_7")
   10568                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10569                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10570              $C$DW$1828      .dwtag  DW_TAG_member
   10571                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$38)
   10572                      .dwattr $C$DW$1828, DW_AT_name("ADCSOCFRC1")
   10573                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10574                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10575                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10576              $C$DW$1829      .dwtag  DW_TAG_member
   10577                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$38)
   10578                      .dwattr $C$DW$1829, DW_AT_name("rsvd_8")
   10579                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_rsvd_8")
   10580                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10581                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10582              $C$DW$1830      .dwtag  DW_TAG_member
   10583                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$38)
   10584                      .dwattr $C$DW$1830, DW_AT_name("ADCSOCOVF1")
   10585                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   10586                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   10587                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10588              $C$DW$1831      .dwtag  DW_TAG_member
   10589                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$38)
   10590                      .dwattr $C$DW$1831, DW_AT_name("rsvd_9")
   10591                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_rsvd_9")
   10592                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   10593                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10594              $C$DW$1832      .dwtag  DW_TAG_member
   10595                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$38)
   10596                      .dwattr $C$DW$1832, DW_AT_name("ADCSOCOVFCLR1")
   10597                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   10598                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   10599                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10600              $C$DW$1833      .dwtag  DW_TAG_member
   10601                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$38)
   10602                      .dwattr $C$DW$1833, DW_AT_name("rsvd_10")
   10603                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_rsvd_10")
   10604                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   10605                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10606              $C$DW$1834      .dwtag  DW_TAG_member
   10607                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$39)
   10608                      .dwattr $C$DW$1834, DW_AT_name("ADCSOCxCTL")
   10609                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_ADCSOCxCTL")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  203

   10610                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   10611                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10612              $C$DW$1835      .dwtag  DW_TAG_member
   10613                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$39)
   10614                      .dwattr $C$DW$1835, DW_AT_name("rsvd_11")
   10615                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_rsvd_11")
   10616                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   10617                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10618              $C$DW$1836      .dwtag  DW_TAG_member
   10619                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$38)
   10620                      .dwattr $C$DW$1836, DW_AT_name("ADCREFTRIM")
   10621                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_ADCREFTRIM")
   10622                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   10623                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10624              $C$DW$1837      .dwtag  DW_TAG_member
   10625                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$38)
   10626                      .dwattr $C$DW$1837, DW_AT_name("ADCOFFTRIM")
   10627                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   10628                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   10629                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10630              $C$DW$1838      .dwtag  DW_TAG_member
   10631                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$44)
   10632                      .dwattr $C$DW$1838, DW_AT_name("resvd_12")
   10633                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_resvd_12")
   10634                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   10635                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10636              $C$DW$1839      .dwtag  DW_TAG_member
   10637                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$38)
   10638                      .dwattr $C$DW$1839, DW_AT_name("ADCREV")
   10639                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_ADCREV")
   10640                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   10641                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10642                      .dwendtag $C$DW$T$45
   10643              
   10644              $C$DW$T$350     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   10645                      .dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$45)
   10646                      .dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
   10647              $C$DW$T$95      .dwtag  DW_TAG_pointer_type
   10648                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$45)
   10649                      .dwattr $C$DW$T$95, DW_AT_address_class(0x20)
   10650              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   10651                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
   10652                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   10653              
   10654              $C$DW$T$47      .dwtag  DW_TAG_structure_type
   10655                      .dwattr $C$DW$T$47, DW_AT_name("_CLK_Obj_")
   10656                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x11)
   10657              $C$DW$1840      .dwtag  DW_TAG_member
   10658                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$38)
   10659                      .dwattr $C$DW$1840, DW_AT_name("XCLK")
   10660                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_XCLK")
   10661                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10662                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10663              $C$DW$1841      .dwtag  DW_TAG_member
   10664                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  204

   10665                      .dwattr $C$DW$1841, DW_AT_name("rsvd_1")
   10666                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_rsvd_1")
   10667                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10668                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10669              $C$DW$1842      .dwtag  DW_TAG_member
   10670                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$38)
   10671                      .dwattr $C$DW$1842, DW_AT_name("CLKCTL")
   10672                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_CLKCTL")
   10673                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10674                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10675              $C$DW$1843      .dwtag  DW_TAG_member
   10676                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$46)
   10677                      .dwattr $C$DW$1843, DW_AT_name("rsvd_2")
   10678                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_rsvd_2")
   10679                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10680                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10681              $C$DW$1844      .dwtag  DW_TAG_member
   10682                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$38)
   10683                      .dwattr $C$DW$1844, DW_AT_name("LOSPCP")
   10684                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_LOSPCP")
   10685                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10686                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10687              $C$DW$1845      .dwtag  DW_TAG_member
   10688                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$38)
   10689                      .dwattr $C$DW$1845, DW_AT_name("PCLKCR0")
   10690                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_PCLKCR0")
   10691                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10692                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10693              $C$DW$1846      .dwtag  DW_TAG_member
   10694                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$38)
   10695                      .dwattr $C$DW$1846, DW_AT_name("PCLKCR1")
   10696                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_PCLKCR1")
   10697                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10698                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10699              $C$DW$1847      .dwtag  DW_TAG_member
   10700                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$41)
   10701                      .dwattr $C$DW$1847, DW_AT_name("rsvd_3")
   10702                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_rsvd_3")
   10703                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10704                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10705              $C$DW$1848      .dwtag  DW_TAG_member
   10706                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$38)
   10707                      .dwattr $C$DW$1848, DW_AT_name("PCLKCR3")
   10708                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_PCLKCR3")
   10709                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10710                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10711                      .dwendtag $C$DW$T$47
   10712              
   10713              $C$DW$T$97      .dwtag  DW_TAG_pointer_type
   10714                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$47)
   10715                      .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
   10716              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   10717                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
   10718                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   10719              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  205

   10720              $C$DW$T$49      .dwtag  DW_TAG_structure_type
   10721                      .dwattr $C$DW$T$49, DW_AT_name("_CPU_Obj_")
   10722                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
   10723              $C$DW$1849      .dwtag  DW_TAG_member
   10724                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$48)
   10725                      .dwattr $C$DW$1849, DW_AT_name("tmp")
   10726                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_tmp")
   10727                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10728                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10729                      .dwendtag $C$DW$T$49
   10730              
   10731              $C$DW$T$359     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   10732                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$49)
   10733                      .dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
   10734              $C$DW$T$99      .dwtag  DW_TAG_pointer_type
   10735                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$49)
   10736                      .dwattr $C$DW$T$99, DW_AT_address_class(0x20)
   10737              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   10738                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
   10739                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
   10740              
   10741              $C$DW$T$57      .dwtag  DW_TAG_structure_type
   10742                      .dwattr $C$DW$T$57, DW_AT_name("_DRV8301_Obj_")
   10743                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
   10744              $C$DW$1850      .dwtag  DW_TAG_member
   10745                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$51)
   10746                      .dwattr $C$DW$1850, DW_AT_name("spiHandle")
   10747                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_spiHandle")
   10748                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10749                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10750              $C$DW$1851      .dwtag  DW_TAG_member
   10751                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$53)
   10752                      .dwattr $C$DW$1851, DW_AT_name("gpioHandle")
   10753                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_gpioHandle")
   10754                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10755                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10756              $C$DW$1852      .dwtag  DW_TAG_member
   10757                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$55)
   10758                      .dwattr $C$DW$1852, DW_AT_name("gpioNumber")
   10759                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_gpioNumber")
   10760                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10761                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10762              $C$DW$1853      .dwtag  DW_TAG_member
   10763                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$56)
   10764                      .dwattr $C$DW$1853, DW_AT_name("RxTimeOut")
   10765                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_RxTimeOut")
   10766                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10767                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10768              $C$DW$1854      .dwtag  DW_TAG_member
   10769                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$56)
   10770                      .dwattr $C$DW$1854, DW_AT_name("enableTimeOut")
   10771                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_enableTimeOut")
   10772                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10773                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10774                      .dwendtag $C$DW$T$57
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  206

   10775              
   10776              $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   10777                      .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$57)
   10778                      .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
   10779              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
   10780                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$57)
   10781                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
   10782              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   10783                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
   10784                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
   10785              
   10786              $C$DW$T$68      .dwtag  DW_TAG_structure_type
   10787                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   10788                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x05)
   10789              $C$DW$1855      .dwtag  DW_TAG_member
   10790                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$59)
   10791                      .dwattr $C$DW$1855, DW_AT_name("DRV8301_CURRENT")
   10792                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   10793                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10794                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10795              $C$DW$1856      .dwtag  DW_TAG_member
   10796                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$61)
   10797                      .dwattr $C$DW$1856, DW_AT_name("DRV8301_RESET")
   10798                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_DRV8301_RESET")
   10799                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10800                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10801              $C$DW$1857      .dwtag  DW_TAG_member
   10802                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$63)
   10803                      .dwattr $C$DW$1857, DW_AT_name("PWM_MODE")
   10804                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_PWM_MODE")
   10805                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10806                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10807              $C$DW$1858      .dwtag  DW_TAG_member
   10808                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$65)
   10809                      .dwattr $C$DW$1858, DW_AT_name("OC_MODE")
   10810                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_OC_MODE")
   10811                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10812                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10813              $C$DW$1859      .dwtag  DW_TAG_member
   10814                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$67)
   10815                      .dwattr $C$DW$1859, DW_AT_name("OC_ADJ_SET")
   10816                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   10817                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10818                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10819                      .dwendtag $C$DW$T$68
   10820              
   10821              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   10822                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$68)
   10823                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
   10824              
   10825              $C$DW$T$77      .dwtag  DW_TAG_structure_type
   10826                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   10827                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
   10828              $C$DW$1860      .dwtag  DW_TAG_member
   10829                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  207

   10830                      .dwattr $C$DW$1860, DW_AT_name("OCTW_SET")
   10831                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_OCTW_SET")
   10832                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10833                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10834              $C$DW$1861      .dwtag  DW_TAG_member
   10835                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$72)
   10836                      .dwattr $C$DW$1861, DW_AT_name("GAIN")
   10837                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_GAIN")
   10838                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10839                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10840              $C$DW$1862      .dwtag  DW_TAG_member
   10841                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$74)
   10842                      .dwattr $C$DW$1862, DW_AT_name("DC_CAL_CH1p2")
   10843                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   10844                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10845                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10846              $C$DW$1863      .dwtag  DW_TAG_member
   10847                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$76)
   10848                      .dwattr $C$DW$1863, DW_AT_name("OC_TOFF")
   10849                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_OC_TOFF")
   10850                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10851                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10852                      .dwendtag $C$DW$T$77
   10853              
   10854              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   10855                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$77)
   10856                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
   10857              
   10858              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   10859                      .dwattr $C$DW$T$78, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   10860                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0b)
   10861              $C$DW$1864      .dwtag  DW_TAG_member
   10862                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$56)
   10863                      .dwattr $C$DW$1864, DW_AT_name("FAULT")
   10864                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_FAULT")
   10865                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10866                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10867              $C$DW$1865      .dwtag  DW_TAG_member
   10868                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$56)
   10869                      .dwattr $C$DW$1865, DW_AT_name("GVDD_UV")
   10870                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_GVDD_UV")
   10871                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10872                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10873              $C$DW$1866      .dwtag  DW_TAG_member
   10874                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$56)
   10875                      .dwattr $C$DW$1866, DW_AT_name("PVDD_UV")
   10876                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_PVDD_UV")
   10877                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10878                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10879              $C$DW$1867      .dwtag  DW_TAG_member
   10880                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$56)
   10881                      .dwattr $C$DW$1867, DW_AT_name("OTSD")
   10882                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_OTSD")
   10883                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10884                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  208

   10885              $C$DW$1868      .dwtag  DW_TAG_member
   10886                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$56)
   10887                      .dwattr $C$DW$1868, DW_AT_name("OTW")
   10888                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_OTW")
   10889                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10890                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10891              $C$DW$1869      .dwtag  DW_TAG_member
   10892                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$56)
   10893                      .dwattr $C$DW$1869, DW_AT_name("FETHA_OC")
   10894                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_FETHA_OC")
   10895                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10896                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10897              $C$DW$1870      .dwtag  DW_TAG_member
   10898                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$56)
   10899                      .dwattr $C$DW$1870, DW_AT_name("FETLA_OC")
   10900                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_FETLA_OC")
   10901                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10902                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10903              $C$DW$1871      .dwtag  DW_TAG_member
   10904                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$56)
   10905                      .dwattr $C$DW$1871, DW_AT_name("FETHB_OC")
   10906                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_FETHB_OC")
   10907                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10908                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10909              $C$DW$1872      .dwtag  DW_TAG_member
   10910                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$56)
   10911                      .dwattr $C$DW$1872, DW_AT_name("FETLB_OC")
   10912                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_FETLB_OC")
   10913                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10914                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10915              $C$DW$1873      .dwtag  DW_TAG_member
   10916                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$56)
   10917                      .dwattr $C$DW$1873, DW_AT_name("FETHC_OC")
   10918                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_FETHC_OC")
   10919                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10920                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10921              $C$DW$1874      .dwtag  DW_TAG_member
   10922                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$56)
   10923                      .dwattr $C$DW$1874, DW_AT_name("FETLC_OC")
   10924                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_FETLC_OC")
   10925                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10926                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10927                      .dwendtag $C$DW$T$78
   10928              
   10929              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   10930                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
   10931                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
   10932              
   10933              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   10934                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   10935                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x02)
   10936              $C$DW$1875      .dwtag  DW_TAG_member
   10937                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$56)
   10938                      .dwattr $C$DW$1875, DW_AT_name("GVDD_OV")
   10939                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_GVDD_OV")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  209

   10940                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10941                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10942              $C$DW$1876      .dwtag  DW_TAG_member
   10943                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$21)
   10944                      .dwattr $C$DW$1876, DW_AT_name("DeviceID")
   10945                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_DeviceID")
   10946                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10947                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10948                      .dwendtag $C$DW$T$79
   10949              
   10950              $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   10951                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$79)
   10952                      .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
   10953              
   10954              $C$DW$T$84      .dwtag  DW_TAG_structure_type
   10955                      .dwattr $C$DW$T$84, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   10956                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x18)
   10957              $C$DW$1877      .dwtag  DW_TAG_member
   10958                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$80)
   10959                      .dwattr $C$DW$1877, DW_AT_name("Stat_Reg_1")
   10960                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_Stat_Reg_1")
   10961                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10962                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10963              $C$DW$1878      .dwtag  DW_TAG_member
   10964                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$81)
   10965                      .dwattr $C$DW$1878, DW_AT_name("Stat_Reg_2")
   10966                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_Stat_Reg_2")
   10967                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10968                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10969              $C$DW$1879      .dwtag  DW_TAG_member
   10970                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$82)
   10971                      .dwattr $C$DW$1879, DW_AT_name("Ctrl_Reg_1")
   10972                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   10973                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   10974                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10975              $C$DW$1880      .dwtag  DW_TAG_member
   10976                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$83)
   10977                      .dwattr $C$DW$1880, DW_AT_name("Ctrl_Reg_2")
   10978                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   10979                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10980                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10981              $C$DW$1881      .dwtag  DW_TAG_member
   10982                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$56)
   10983                      .dwattr $C$DW$1881, DW_AT_name("SndCmd")
   10984                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_SndCmd")
   10985                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10986                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10987              $C$DW$1882      .dwtag  DW_TAG_member
   10988                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$56)
   10989                      .dwattr $C$DW$1882, DW_AT_name("RcvCmd")
   10990                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_RcvCmd")
   10991                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   10992                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10993                      .dwendtag $C$DW$T$84
   10994              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:25 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1971610                            PAGE  210

   10995              $C$DW$T$366     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   10996                      .dwattr $C$DW$T$366, DW_AT_type(*$C$DW$T$84)
   10997                      .dwattr $C$DW$T$366, DW_AT_language(DW_LANG_C)
   10998              $C$DW$T$367     .dwtag  DW_TAG_pointer_type
   10999                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$366)
   11000                      .dwattr $C$DW$T$367, DW_AT_address_class(0x20)
   11001              
   11002              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   11003                      .dwattr $C$DW$T$86, DW_AT_name("_FILTER_FO_")
   11004                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x0a)
   11005              $C$DW$1883      .dwtag  DW_TAG_member
   11006                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$85)
   11007                      .dwattr $C$DW$1883, DW_AT_name("a1")
   11008                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_a1")
   11009                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
