TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Thu Aug 04 15:58:50 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/drivers/i2c/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("GPIO_setMode")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GPIO_setMode")

     450              $C$DW$138       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_SDAA"), DW_AT_const_value(0x01)
     451              $C$DW$139       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_EPWMSYNCI"), DW_AT_const_value(0x02)
     452              $C$DW$140       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_ADCSOCAO_NOT"), DW_AT_const_value(0x03)
     453              $C$DW$141       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
     454              $C$DW$142       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_SCLA"), DW_AT_const_value(0x01)
     455              $C$DW$143       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_EPWMSYNCO"), DW_AT_const_value(0x02)
     456              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_ADCSOCBO_NOT"), DW_AT_const_value(0x03)
     457              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
     458              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_COMP2OUT"), DW_AT_const_value(0x01)
     459              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_2"), DW_AT_const_value(0x02)
     460              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_3"), DW_AT_const_value(0x03)
     461              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_JTAG_TDI"), DW_AT_const_value(0x00)
     462              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_1"), DW_AT_const_value(0x01)
     463              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_2"), DW_AT_const_value(0x02)
     464              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_3"), DW_AT_const_value(0x03)
     465              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_JTAG_TMS"), DW_AT_const_value(0x00)
     466              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_1"), DW_AT_const_value(0x01)
     467              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_2"), DW_AT_const_value(0x02)
     468              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_3"), DW_AT_const_value(0x03)
     469              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_JTAG_TDO"), DW_AT_const_value(0x00)
     470              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_1"), DW_AT_const_value(0x01)
     471              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_2"), DW_AT_const_value(0x02)
     472              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_3"), DW_AT_const_value(0x03)
     473              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_JTAG_TCK"), DW_AT_const_value(0x00)
     474              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_1"), DW_AT_const_value(0x01)
     475              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_2"), DW_AT_const_value(0x02)
     476              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_3"), DW_AT_const_value(0x03)
     477                      .dwendtag $C$DW$T$56
     478              
     479              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
     480                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   10

     481                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     482              $C$DW$165       .dwtag  DW_TAG_TI_far_type
     483                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$57)
     484              $C$DW$T$58      .dwtag  DW_TAG_const_type
     485                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$165)
     486              
     487              $C$DW$T$59      .dwtag  DW_TAG_enumeration_type
     488                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
     489              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
     490              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
     491              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
     492              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
     493                      .dwendtag $C$DW$T$59
     494              
     495              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
     496                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
     497                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     498              $C$DW$170       .dwtag  DW_TAG_TI_far_type
     499                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$60)
     500              $C$DW$T$61      .dwtag  DW_TAG_const_type
     501                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$170)
     502              
     503              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     504                      .dwattr $C$DW$T$20, DW_AT_name("I2CEMDR_BITS")
     505                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     506              $C$DW$171       .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
     508                      .dwattr $C$DW$171, DW_AT_name("BCM")
     509                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_BCM")
     510                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     511                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$172       .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
     516                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
     517                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     518                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
     520                      .dwendtag $C$DW$T$20
     521              
     522              
     523              $C$DW$T$21      .dwtag  DW_TAG_union_type
     524                      .dwattr $C$DW$T$21, DW_AT_name("I2CEMDR_REG")
     525                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     526              $C$DW$173       .dwtag  DW_TAG_member
     527                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
     528                      .dwattr $C$DW$173, DW_AT_name("all")
     529                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
     530                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     531                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
     532              $C$DW$174       .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$20)
     534                      .dwattr $C$DW$174, DW_AT_name("bit")
     535                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   11

     536                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
     538                      .dwendtag $C$DW$T$21
     539              
     540              
     541              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     542                      .dwattr $C$DW$T$22, DW_AT_name("I2CFFRX_BITS")
     543                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     544              $C$DW$175       .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$175, DW_AT_name("RXFFIL")
     547                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_RXFFIL")
     548                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
     549                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
     551              $C$DW$176       .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
     553                      .dwattr $C$DW$176, DW_AT_name("RXFFIENA")
     554                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_RXFFIENA")
     555                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     556                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
     558              $C$DW$177       .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
     560                      .dwattr $C$DW$177, DW_AT_name("RXFFINTCLR")
     561                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_RXFFINTCLR")
     562                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     563                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
     565              $C$DW$178       .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
     567                      .dwattr $C$DW$178, DW_AT_name("RXFFINT")
     568                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RXFFINT")
     569                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     570                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
     572              $C$DW$179       .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
     574                      .dwattr $C$DW$179, DW_AT_name("RXFFST")
     575                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_RXFFST")
     576                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
     577                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$180       .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
     581                      .dwattr $C$DW$180, DW_AT_name("RXFFRST")
     582                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RXFFRST")
     583                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     584                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
     586              $C$DW$181       .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
     589                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
     590                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   12

     591                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
     593                      .dwendtag $C$DW$T$22
     594              
     595              
     596              $C$DW$T$23      .dwtag  DW_TAG_union_type
     597                      .dwattr $C$DW$T$23, DW_AT_name("I2CFFRX_REG")
     598                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     599              $C$DW$182       .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$182, DW_AT_name("all")
     602                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
     603                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$183       .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
     607                      .dwattr $C$DW$183, DW_AT_name("bit")
     608                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
     609                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
     611                      .dwendtag $C$DW$T$23
     612              
     613              
     614              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     615                      .dwattr $C$DW$T$24, DW_AT_name("I2CFFTX_BITS")
     616                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     617              $C$DW$184       .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$184, DW_AT_name("TXFFIL")
     620                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_TXFFIL")
     621                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
     622                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
     624              $C$DW$185       .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$185, DW_AT_name("TXFFIENA")
     627                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_TXFFIENA")
     628                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$186       .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$186, DW_AT_name("TXFFINTCLR")
     634                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_TXFFINTCLR")
     635                      .dwattr $C$DW$186, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     636                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$187       .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$187, DW_AT_name("TXFFINT")
     641                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_TXFFINT")
     642                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     643                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$188       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   13

     646                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$188, DW_AT_name("TXFFST")
     648                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_TXFFST")
     649                      .dwattr $C$DW$188, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
     650                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$189       .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$189, DW_AT_name("TXFFRST")
     655                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_TXFFRST")
     656                      .dwattr $C$DW$189, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     657                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
     659              $C$DW$190       .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$190, DW_AT_name("I2CFFEN")
     662                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_I2CFFEN")
     663                      .dwattr $C$DW$190, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     664                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
     666              $C$DW$191       .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
     669                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
     670                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     671                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
     673                      .dwendtag $C$DW$T$24
     674              
     675              
     676              $C$DW$T$25      .dwtag  DW_TAG_union_type
     677                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFTX_REG")
     678                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     679              $C$DW$192       .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$192, DW_AT_name("all")
     682                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_all")
     683                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$193       .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$24)
     687                      .dwattr $C$DW$193, DW_AT_name("bit")
     688                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_bit")
     689                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
     691                      .dwendtag $C$DW$T$25
     692              
     693              
     694              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     695                      .dwattr $C$DW$T$26, DW_AT_name("I2CIER_BITS")
     696                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     697              $C$DW$194       .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
     699                      .dwattr $C$DW$194, DW_AT_name("ARBL")
     700                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ARBL")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   14

     701                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$195       .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$195, DW_AT_name("NACK")
     707                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_NACK")
     708                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
     711              $C$DW$196       .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$196, DW_AT_name("ARDY")
     714                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_ARDY")
     715                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     716                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$197       .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$197, DW_AT_name("RRDY")
     721                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_RRDY")
     722                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     723                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
     725              $C$DW$198       .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$198, DW_AT_name("XRDY")
     728                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_XRDY")
     729                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     730                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
     732              $C$DW$199       .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$199, DW_AT_name("SCD")
     735                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SCD")
     736                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     737                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$200       .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$200, DW_AT_name("AAS")
     742                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_AAS")
     743                      .dwattr $C$DW$200, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     744                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$201       .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$201, DW_AT_name("rsvd")
     749                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd")
     750                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
     751                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
     753                      .dwendtag $C$DW$T$26
     754              
     755              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   15

     756              $C$DW$T$27      .dwtag  DW_TAG_union_type
     757                      .dwattr $C$DW$T$27, DW_AT_name("I2CIER_REG")
     758                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     759              $C$DW$202       .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$202, DW_AT_name("all")
     762                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
     763                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$203       .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$26)
     767                      .dwattr $C$DW$203, DW_AT_name("bit")
     768                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
     769                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
     771                      .dwendtag $C$DW$T$27
     772              
     773              
     774              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     775                      .dwattr $C$DW$T$28, DW_AT_name("I2CISRC_BITS")
     776                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     777              $C$DW$204       .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$204, DW_AT_name("INTCODE")
     780                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTCODE")
     781                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     782                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$205       .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$205, DW_AT_name("rsvd1")
     787                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd1")
     788                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     789                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
     791                      .dwendtag $C$DW$T$28
     792              
     793              
     794              $C$DW$T$29      .dwtag  DW_TAG_union_type
     795                      .dwattr $C$DW$T$29, DW_AT_name("I2CISRC_REG")
     796                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     797              $C$DW$206       .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$206, DW_AT_name("all")
     800                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_all")
     801                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$207       .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$28)
     805                      .dwattr $C$DW$207, DW_AT_name("bit")
     806                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_bit")
     807                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
     809                      .dwendtag $C$DW$T$29
     810              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   16

     811              
     812              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     813                      .dwattr $C$DW$T$30, DW_AT_name("I2CMDR_BITS")
     814                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     815              $C$DW$208       .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$208, DW_AT_name("BC")
     818                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_BC")
     819                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     820                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
     822              $C$DW$209       .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$209, DW_AT_name("FDF")
     825                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_FDF")
     826                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     827                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$210       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$210, DW_AT_name("STB")
     832                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_STB")
     833                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$211       .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
     838                      .dwattr $C$DW$211, DW_AT_name("IRS")
     839                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_IRS")
     840                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     841                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
     843              $C$DW$212       .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$212, DW_AT_name("DLB")
     846                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_DLB")
     847                      .dwattr $C$DW$212, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     848                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
     850              $C$DW$213       .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
     852                      .dwattr $C$DW$213, DW_AT_name("RM")
     853                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RM")
     854                      .dwattr $C$DW$213, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
     857              $C$DW$214       .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$214, DW_AT_name("XA")
     860                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_XA")
     861                      .dwattr $C$DW$214, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$215       .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   17

     866                      .dwattr $C$DW$215, DW_AT_name("TRX")
     867                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_TRX")
     868                      .dwattr $C$DW$215, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     869                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$216       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$216, DW_AT_name("MST")
     874                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_MST")
     875                      .dwattr $C$DW$216, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     876                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
     878              $C$DW$217       .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$217, DW_AT_name("STP")
     881                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_STP")
     882                      .dwattr $C$DW$217, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     883                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
     885              $C$DW$218       .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
     887                      .dwattr $C$DW$218, DW_AT_name("rsvd1")
     888                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd1")
     889                      .dwattr $C$DW$218, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     890                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
     892              $C$DW$219       .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
     894                      .dwattr $C$DW$219, DW_AT_name("STT")
     895                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_STT")
     896                      .dwattr $C$DW$219, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     897                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
     899              $C$DW$220       .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
     901                      .dwattr $C$DW$220, DW_AT_name("FREE")
     902                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_FREE")
     903                      .dwattr $C$DW$220, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     904                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$221       .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$221, DW_AT_name("NACKMOD")
     909                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_NACKMOD")
     910                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     911                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
     913                      .dwendtag $C$DW$T$30
     914              
     915              
     916              $C$DW$T$31      .dwtag  DW_TAG_union_type
     917                      .dwattr $C$DW$T$31, DW_AT_name("I2CMDR_REG")
     918                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     919              $C$DW$222       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   18

     921                      .dwattr $C$DW$222, DW_AT_name("all")
     922                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_all")
     923                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$223       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$30)
     927                      .dwattr $C$DW$223, DW_AT_name("bit")
     928                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_bit")
     929                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
     931                      .dwendtag $C$DW$T$31
     932              
     933              
     934              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     935                      .dwattr $C$DW$T$32, DW_AT_name("I2CPSC_BITS")
     936                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     937              $C$DW$224       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$224, DW_AT_name("IPSC")
     940                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_IPSC")
     941                      .dwattr $C$DW$224, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     942                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
     944              $C$DW$225       .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$225, DW_AT_name("rsvd1")
     947                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd1")
     948                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     949                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
     951                      .dwendtag $C$DW$T$32
     952              
     953              
     954              $C$DW$T$33      .dwtag  DW_TAG_union_type
     955                      .dwattr $C$DW$T$33, DW_AT_name("I2CPSC_REG")
     956                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     957              $C$DW$226       .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$226, DW_AT_name("all")
     960                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
     961                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$227       .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$32)
     965                      .dwattr $C$DW$227, DW_AT_name("bit")
     966                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_bit")
     967                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
     969                      .dwendtag $C$DW$T$33
     970              
     971              
     972              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     973                      .dwattr $C$DW$T$34, DW_AT_name("I2CSTR_BITS")
     974                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     975              $C$DW$228       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   19

     976                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$228, DW_AT_name("ARBL")
     978                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ARBL")
     979                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$229       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$229, DW_AT_name("NACK")
     985                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_NACK")
     986                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$230       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$230, DW_AT_name("ARDY")
     992                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_ARDY")
     993                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     994                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$231       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$231, DW_AT_name("RRDY")
     999                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_RRDY")
    1000                      .dwattr $C$DW$231, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$232       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$232, DW_AT_name("XRDY")
    1006                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_XRDY")
    1007                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$233       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$233, DW_AT_name("SCD")
    1013                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_SCD")
    1014                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1015                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$234       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$234, DW_AT_name("rsvd1")
    1020                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd1")
    1021                      .dwattr $C$DW$234, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$235       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$235, DW_AT_name("AD0")
    1027                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_AD0")
    1028                      .dwattr $C$DW$235, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   20

    1031              $C$DW$236       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$236, DW_AT_name("AAS")
    1034                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_AAS")
    1035                      .dwattr $C$DW$236, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$237       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$237, DW_AT_name("XSMT")
    1041                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_XSMT")
    1042                      .dwattr $C$DW$237, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$238       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$238, DW_AT_name("RSFULL")
    1048                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_RSFULL")
    1049                      .dwattr $C$DW$238, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1051                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$239       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$239, DW_AT_name("BB")
    1055                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_BB")
    1056                      .dwattr $C$DW$239, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1057                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$240       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$240, DW_AT_name("NACKSNT")
    1062                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_NACKSNT")
    1063                      .dwattr $C$DW$240, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1064                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1065                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$241       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$241, DW_AT_name("SDIR")
    1069                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_SDIR")
    1070                      .dwattr $C$DW$241, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1071                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1073              $C$DW$242       .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$242, DW_AT_name("rsvd2")
    1076                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_rsvd2")
    1077                      .dwattr $C$DW$242, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1080                      .dwendtag $C$DW$T$34
    1081              
    1082              
    1083              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1084                      .dwattr $C$DW$T$35, DW_AT_name("I2CSTR_REG")
    1085                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   21

    1086              $C$DW$243       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$243, DW_AT_name("all")
    1089                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_all")
    1090                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$244       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$34)
    1094                      .dwattr $C$DW$244, DW_AT_name("bit")
    1095                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_bit")
    1096                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1098                      .dwendtag $C$DW$T$35
    1099              
    1100              
    1101              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1102                      .dwattr $C$DW$T$45, DW_AT_name("_GPIO_Obj_")
    1103                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x6a)
    1104              $C$DW$245       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$37)
    1106                      .dwattr $C$DW$245, DW_AT_name("GPACTRL")
    1107                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_GPACTRL")
    1108                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$246       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$37)
    1112                      .dwattr $C$DW$246, DW_AT_name("GPAQSEL1")
    1113                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_GPAQSEL1")
    1114                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1115                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$247       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$37)
    1118                      .dwattr $C$DW$247, DW_AT_name("GPAQSEL2")
    1119                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_GPAQSEL2")
    1120                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1121                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$248       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$37)
    1124                      .dwattr $C$DW$248, DW_AT_name("GPAMUX1")
    1125                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_GPAMUX1")
    1126                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1127                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$249       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$37)
    1130                      .dwattr $C$DW$249, DW_AT_name("GPAMUX2")
    1131                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_GPAMUX2")
    1132                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1133                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1134              $C$DW$250       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$37)
    1136                      .dwattr $C$DW$250, DW_AT_name("GPADIR")
    1137                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_GPADIR")
    1138                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1139                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1140              $C$DW$251       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   22

    1141                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$37)
    1142                      .dwattr $C$DW$251, DW_AT_name("GPAPUD")
    1143                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_GPAPUD")
    1144                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1145                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1146              $C$DW$252       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$39)
    1148                      .dwattr $C$DW$252, DW_AT_name("rsvd_1")
    1149                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd_1")
    1150                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1151                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$253       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$37)
    1154                      .dwattr $C$DW$253, DW_AT_name("GPBCTRL")
    1155                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPBCTRL")
    1156                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1157                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$254       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$37)
    1160                      .dwattr $C$DW$254, DW_AT_name("GPBQSEL1")
    1161                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPBQSEL1")
    1162                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1163                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$255       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$39)
    1166                      .dwattr $C$DW$255, DW_AT_name("rsvd_2")
    1167                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_rsvd_2")
    1168                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1169                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$256       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$37)
    1172                      .dwattr $C$DW$256, DW_AT_name("GPBMUX1")
    1173                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPBMUX1")
    1174                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1175                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$257       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$39)
    1178                      .dwattr $C$DW$257, DW_AT_name("rsvd_3")
    1179                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_rsvd_3")
    1180                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1181                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$258       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$37)
    1184                      .dwattr $C$DW$258, DW_AT_name("GPBDIR")
    1185                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_GPBDIR")
    1186                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1187                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$259       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$37)
    1190                      .dwattr $C$DW$259, DW_AT_name("GPBPUD")
    1191                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPBPUD")
    1192                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1193                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$260       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   23

    1196                      .dwattr $C$DW$260, DW_AT_name("rsvd_4")
    1197                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd_4")
    1198                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1199                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$261       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$37)
    1202                      .dwattr $C$DW$261, DW_AT_name("AIOMUX1")
    1203                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_AIOMUX1")
    1204                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1205                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1206              $C$DW$262       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$39)
    1208                      .dwattr $C$DW$262, DW_AT_name("rsvd_5")
    1209                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_5")
    1210                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1211                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$263       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$37)
    1214                      .dwattr $C$DW$263, DW_AT_name("AIODIR")
    1215                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_AIODIR")
    1216                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1217                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1218              $C$DW$264       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$41)
    1220                      .dwattr $C$DW$264, DW_AT_name("rsvd_6")
    1221                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd_6")
    1222                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1223                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$265       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$37)
    1226                      .dwattr $C$DW$265, DW_AT_name("GPADAT")
    1227                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPADAT")
    1228                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1229                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$266       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$37)
    1232                      .dwattr $C$DW$266, DW_AT_name("GPASET")
    1233                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPASET")
    1234                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1235                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$267       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$37)
    1238                      .dwattr $C$DW$267, DW_AT_name("GPACLEAR")
    1239                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_GPACLEAR")
    1240                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1241                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$268       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$37)
    1244                      .dwattr $C$DW$268, DW_AT_name("GPATOGGLE")
    1245                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_GPATOGGLE")
    1246                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1247                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$269       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$37)
    1250                      .dwattr $C$DW$269, DW_AT_name("GPBDAT")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   24

    1251                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_GPBDAT")
    1252                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1253                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$270       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$37)
    1256                      .dwattr $C$DW$270, DW_AT_name("GPBSET")
    1257                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_GPBSET")
    1258                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1259                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1260              $C$DW$271       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$37)
    1262                      .dwattr $C$DW$271, DW_AT_name("GPBCLEAR")
    1263                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_GPBCLEAR")
    1264                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1265                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1266              $C$DW$272       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$37)
    1268                      .dwattr $C$DW$272, DW_AT_name("GPBTOGGLE")
    1269                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1270                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1271                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$273       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$42)
    1274                      .dwattr $C$DW$273, DW_AT_name("rsvd_7")
    1275                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_rsvd_7")
    1276                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1277                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$274       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$37)
    1280                      .dwattr $C$DW$274, DW_AT_name("AIODAT")
    1281                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_AIODAT")
    1282                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1283                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$275       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$37)
    1286                      .dwattr $C$DW$275, DW_AT_name("AIOSET")
    1287                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_AIOSET")
    1288                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1289                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1290              $C$DW$276       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$37)
    1292                      .dwattr $C$DW$276, DW_AT_name("AIOCLEAR")
    1293                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_AIOCLEAR")
    1294                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1295                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$277       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$37)
    1298                      .dwattr $C$DW$277, DW_AT_name("AIOTOGGLE")
    1299                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1300                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1301                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1302              $C$DW$278       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$43)
    1304                      .dwattr $C$DW$278, DW_AT_name("GPIOXINTnSEL")
    1305                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   25

    1306                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1307                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$279       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$44)
    1310                      .dwattr $C$DW$279, DW_AT_name("rsvd_8")
    1311                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_rsvd_8")
    1312                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1313                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$280       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$37)
    1316                      .dwattr $C$DW$280, DW_AT_name("GPIOLPMSEL")
    1317                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1318                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1319                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1320                      .dwendtag $C$DW$T$45
    1321              
    1322              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1323                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$45)
    1324                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    1325              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1326                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    1327                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1328              $C$DW$281       .dwtag  DW_TAG_TI_far_type
    1329                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$48)
    1330              $C$DW$T$62      .dwtag  DW_TAG_const_type
    1331                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$281)
    1332              
    1333              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1334                      .dwattr $C$DW$T$49, DW_AT_name("_I2C_Obj_")
    1335                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x24)
    1336              $C$DW$282       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$282, DW_AT_name("I2COAR")
    1339                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_I2COAR")
    1340                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$283       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$27)
    1344                      .dwattr $C$DW$283, DW_AT_name("I2CIER")
    1345                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_I2CIER")
    1346                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$284       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$35)
    1350                      .dwattr $C$DW$284, DW_AT_name("I2CSTR")
    1351                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_I2CSTR")
    1352                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1353                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$285       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$285, DW_AT_name("I2CCLKL")
    1357                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_I2CCLKL")
    1358                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1359                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$286       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   26

    1361                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$286, DW_AT_name("I2CCLKH")
    1363                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_I2CCLKH")
    1364                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1365                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$287       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$287, DW_AT_name("I2CCNT")
    1369                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_I2CCNT")
    1370                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1371                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1372              $C$DW$288       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    1374                      .dwattr $C$DW$288, DW_AT_name("I2CDRR")
    1375                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_I2CDRR")
    1376                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1377                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$289       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$289, DW_AT_name("I2CSAR")
    1381                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_I2CSAR")
    1382                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1383                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$290       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$290, DW_AT_name("I2CDXR")
    1387                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_I2CDXR")
    1388                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1389                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$291       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$31)
    1392                      .dwattr $C$DW$291, DW_AT_name("I2CMDR")
    1393                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_I2CMDR")
    1394                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1395                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$292       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    1398                      .dwattr $C$DW$292, DW_AT_name("I2CISRC")
    1399                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_I2CISRC")
    1400                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1401                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$293       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    1404                      .dwattr $C$DW$293, DW_AT_name("I2CEMDR")
    1405                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_I2CEMDR")
    1406                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1407                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$294       .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$33)
    1410                      .dwattr $C$DW$294, DW_AT_name("I2CPSC")
    1411                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_I2CPSC")
    1412                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1413                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$295       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$46)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   27

    1416                      .dwattr $C$DW$295, DW_AT_name("rsvd2")
    1417                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_rsvd2")
    1418                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1419                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$296       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$25)
    1422                      .dwattr $C$DW$296, DW_AT_name("I2CFFTX")
    1423                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_I2CFFTX")
    1424                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1425                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$297       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$23)
    1428                      .dwattr $C$DW$297, DW_AT_name("I2CFFRX")
    1429                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_I2CFFRX")
    1430                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1431                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$298       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$48)
    1434                      .dwattr $C$DW$298, DW_AT_name("gpioHandle")
    1435                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_gpioHandle")
    1436                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1437                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    1438                      .dwendtag $C$DW$T$49
    1439              
    1440              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    1441                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$49)
    1442                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1443              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    1444                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$49)
    1445                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
    1446              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1447                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1448                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1449              $C$DW$299       .dwtag  DW_TAG_TI_far_type
    1450                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$66)
    1451              $C$DW$T$67      .dwtag  DW_TAG_const_type
    1452                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$299)
    1453              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1454                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1455              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1456                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1457                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1458                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1459              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1460                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1461                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1462                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1463              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1464                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1465                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1466                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1467              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1468                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1469                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1470                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:50 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1116410                            PAGE   28

    1471              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1472                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1473                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1474                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1475              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1476                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1477                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1478                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1479              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1480                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1481                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1482                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1483              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1484                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1485                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1486                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1487              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1488                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
