TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Thu Aug 04 15:58:27 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4297              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    4298                      .dwendtag $C$DW$T$234
    4299              
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   86

    4300              $C$DW$T$235     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4301                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$234)
    4302                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    4303              
    4304              $C$DW$T$237     .dwtag  DW_TAG_enumeration_type
    4305                      .dwattr $C$DW$T$237, DW_AT_byte_size(0x01)
    4306              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4307              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4308              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4309              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4310              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4311              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4312              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4313              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4314              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4315              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4316              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4317              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4318                      .dwendtag $C$DW$T$237
    4319              
    4320              $C$DW$T$238     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4321                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$237)
    4322                      .dwattr $C$DW$T$238, DW_AT_language(DW_LANG_C)
    4323              
    4324              $C$DW$T$240     .dwtag  DW_TAG_enumeration_type
    4325                      .dwattr $C$DW$T$240, DW_AT_byte_size(0x01)
    4326              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    4327              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    4328              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    4329                      .dwendtag $C$DW$T$240
    4330              
    4331              $C$DW$T$241     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4332                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    4333                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    4334              
    4335              $C$DW$T$243     .dwtag  DW_TAG_enumeration_type
    4336                      .dwattr $C$DW$T$243, DW_AT_byte_size(0x01)
    4337              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4338              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4339                      .dwendtag $C$DW$T$243
    4340              
    4341              $C$DW$T$244     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4342                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$243)
    4343                      .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    4344              
    4345              $C$DW$T$246     .dwtag  DW_TAG_enumeration_type
    4346                      .dwattr $C$DW$T$246, DW_AT_byte_size(0x01)
    4347              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    4348              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    4349              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    4350              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    4351                      .dwendtag $C$DW$T$246
    4352              
    4353              $C$DW$T$247     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    4354                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$246)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   87

    4355                      .dwattr $C$DW$T$247, DW_AT_language(DW_LANG_C)
    4356              
    4357              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4358                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_BITS")
    4359                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4360              $C$DW$650       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
    4362                      .dwattr $C$DW$650, DW_AT_name("BCM")
    4363                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_BCM")
    4364                      .dwattr $C$DW$650, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4365                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4366                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4367              $C$DW$651       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$22)
    4369                      .dwattr $C$DW$651, DW_AT_name("rsvd1")
    4370                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd1")
    4371                      .dwattr $C$DW$651, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4372                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4373                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4374                      .dwendtag $C$DW$T$23
    4375              
    4376              
    4377              $C$DW$T$24      .dwtag  DW_TAG_union_type
    4378                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_REG")
    4379                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4380              $C$DW$652       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
    4382                      .dwattr $C$DW$652, DW_AT_name("all")
    4383                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_all")
    4384                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4385                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$653       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$23)
    4388                      .dwattr $C$DW$653, DW_AT_name("bit")
    4389                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_bit")
    4390                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4391                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4392                      .dwendtag $C$DW$T$24
    4393              
    4394              
    4395              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4396                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_BITS")
    4397                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4398              $C$DW$654       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$22)
    4400                      .dwattr $C$DW$654, DW_AT_name("RXFFIL")
    4401                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_RXFFIL")
    4402                      .dwattr $C$DW$654, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4403                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$655       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$22)
    4407                      .dwattr $C$DW$655, DW_AT_name("RXFFIENA")
    4408                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_RXFFIENA")
    4409                      .dwattr $C$DW$655, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   88

    4410                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4411                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4412              $C$DW$656       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$22)
    4414                      .dwattr $C$DW$656, DW_AT_name("RXFFINTCLR")
    4415                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_RXFFINTCLR")
    4416                      .dwattr $C$DW$656, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4417                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4418                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4419              $C$DW$657       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$22)
    4421                      .dwattr $C$DW$657, DW_AT_name("RXFFINT")
    4422                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_RXFFINT")
    4423                      .dwattr $C$DW$657, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4424                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4425                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4426              $C$DW$658       .dwtag  DW_TAG_member
    4427                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
    4428                      .dwattr $C$DW$658, DW_AT_name("RXFFST")
    4429                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_RXFFST")
    4430                      .dwattr $C$DW$658, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4431                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4432                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4433              $C$DW$659       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$22)
    4435                      .dwattr $C$DW$659, DW_AT_name("RXFFRST")
    4436                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_RXFFRST")
    4437                      .dwattr $C$DW$659, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4438                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4439                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$660       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$22)
    4442                      .dwattr $C$DW$660, DW_AT_name("rsvd1")
    4443                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_rsvd1")
    4444                      .dwattr $C$DW$660, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4445                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4446                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4447                      .dwendtag $C$DW$T$25
    4448              
    4449              
    4450              $C$DW$T$26      .dwtag  DW_TAG_union_type
    4451                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_REG")
    4452                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4453              $C$DW$661       .dwtag  DW_TAG_member
    4454                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$22)
    4455                      .dwattr $C$DW$661, DW_AT_name("all")
    4456                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_all")
    4457                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$662       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$25)
    4461                      .dwattr $C$DW$662, DW_AT_name("bit")
    4462                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_bit")
    4463                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4464                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   89

    4465                      .dwendtag $C$DW$T$26
    4466              
    4467              
    4468              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4469                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_BITS")
    4470                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4471              $C$DW$663       .dwtag  DW_TAG_member
    4472                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
    4473                      .dwattr $C$DW$663, DW_AT_name("TXFFIL")
    4474                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_TXFFIL")
    4475                      .dwattr $C$DW$663, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4476                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4477                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$664       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$22)
    4480                      .dwattr $C$DW$664, DW_AT_name("TXFFIENA")
    4481                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_TXFFIENA")
    4482                      .dwattr $C$DW$664, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4483                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4484                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$665       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$22)
    4487                      .dwattr $C$DW$665, DW_AT_name("TXFFINTCLR")
    4488                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_TXFFINTCLR")
    4489                      .dwattr $C$DW$665, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4490                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4491                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4492              $C$DW$666       .dwtag  DW_TAG_member
    4493                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    4494                      .dwattr $C$DW$666, DW_AT_name("TXFFINT")
    4495                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_TXFFINT")
    4496                      .dwattr $C$DW$666, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4497                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4498                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4499              $C$DW$667       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$22)
    4501                      .dwattr $C$DW$667, DW_AT_name("TXFFST")
    4502                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_TXFFST")
    4503                      .dwattr $C$DW$667, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4504                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4505                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$668       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
    4508                      .dwattr $C$DW$668, DW_AT_name("TXFFRST")
    4509                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_TXFFRST")
    4510                      .dwattr $C$DW$668, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4511                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4512                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4513              $C$DW$669       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$22)
    4515                      .dwattr $C$DW$669, DW_AT_name("I2CFFEN")
    4516                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_I2CFFEN")
    4517                      .dwattr $C$DW$669, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4518                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4519                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   90

    4520              $C$DW$670       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$22)
    4522                      .dwattr $C$DW$670, DW_AT_name("rsvd1")
    4523                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_rsvd1")
    4524                      .dwattr $C$DW$670, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4525                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4526                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4527                      .dwendtag $C$DW$T$27
    4528              
    4529              
    4530              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4531                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_REG")
    4532                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4533              $C$DW$671       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$22)
    4535                      .dwattr $C$DW$671, DW_AT_name("all")
    4536                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_all")
    4537                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4538                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$672       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$27)
    4541                      .dwattr $C$DW$672, DW_AT_name("bit")
    4542                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_bit")
    4543                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4544                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4545                      .dwendtag $C$DW$T$28
    4546              
    4547              
    4548              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4549                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_BITS")
    4550                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4551              $C$DW$673       .dwtag  DW_TAG_member
    4552                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$22)
    4553                      .dwattr $C$DW$673, DW_AT_name("ARBL")
    4554                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_ARBL")
    4555                      .dwattr $C$DW$673, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4556                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4557                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4558              $C$DW$674       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$22)
    4560                      .dwattr $C$DW$674, DW_AT_name("NACK")
    4561                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_NACK")
    4562                      .dwattr $C$DW$674, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4563                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4564                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4565              $C$DW$675       .dwtag  DW_TAG_member
    4566                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$22)
    4567                      .dwattr $C$DW$675, DW_AT_name("ARDY")
    4568                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_ARDY")
    4569                      .dwattr $C$DW$675, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4570                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4571                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$676       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$22)
    4574                      .dwattr $C$DW$676, DW_AT_name("RRDY")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   91

    4575                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_RRDY")
    4576                      .dwattr $C$DW$676, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4577                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4578                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$677       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$22)
    4581                      .dwattr $C$DW$677, DW_AT_name("XRDY")
    4582                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_XRDY")
    4583                      .dwattr $C$DW$677, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4584                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4585                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$678       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$22)
    4588                      .dwattr $C$DW$678, DW_AT_name("SCD")
    4589                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_SCD")
    4590                      .dwattr $C$DW$678, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4591                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4592                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4593              $C$DW$679       .dwtag  DW_TAG_member
    4594                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$22)
    4595                      .dwattr $C$DW$679, DW_AT_name("AAS")
    4596                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_AAS")
    4597                      .dwattr $C$DW$679, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4598                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4599                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4600              $C$DW$680       .dwtag  DW_TAG_member
    4601                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$22)
    4602                      .dwattr $C$DW$680, DW_AT_name("rsvd")
    4603                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_rsvd")
    4604                      .dwattr $C$DW$680, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    4605                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4606                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4607                      .dwendtag $C$DW$T$29
    4608              
    4609              
    4610              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4611                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_REG")
    4612                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4613              $C$DW$681       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$22)
    4615                      .dwattr $C$DW$681, DW_AT_name("all")
    4616                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_all")
    4617                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4618                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$682       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$29)
    4621                      .dwattr $C$DW$682, DW_AT_name("bit")
    4622                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_bit")
    4623                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4624                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4625                      .dwendtag $C$DW$T$30
    4626              
    4627              
    4628              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4629                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_BITS")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   92

    4630                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    4631              $C$DW$683       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$22)
    4633                      .dwattr $C$DW$683, DW_AT_name("INTCODE")
    4634                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_INTCODE")
    4635                      .dwattr $C$DW$683, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4636                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4637                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$684       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$22)
    4640                      .dwattr $C$DW$684, DW_AT_name("rsvd1")
    4641                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd1")
    4642                      .dwattr $C$DW$684, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    4643                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4644                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4645                      .dwendtag $C$DW$T$31
    4646              
    4647              
    4648              $C$DW$T$32      .dwtag  DW_TAG_union_type
    4649                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_REG")
    4650                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    4651              $C$DW$685       .dwtag  DW_TAG_member
    4652                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$22)
    4653                      .dwattr $C$DW$685, DW_AT_name("all")
    4654                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_all")
    4655                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4656                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$686       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$31)
    4659                      .dwattr $C$DW$686, DW_AT_name("bit")
    4660                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_bit")
    4661                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4662                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4663                      .dwendtag $C$DW$T$32
    4664              
    4665              
    4666              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4667                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_BITS")
    4668                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4669              $C$DW$687       .dwtag  DW_TAG_member
    4670                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$22)
    4671                      .dwattr $C$DW$687, DW_AT_name("BC")
    4672                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_BC")
    4673                      .dwattr $C$DW$687, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4674                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4675                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$688       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$22)
    4678                      .dwattr $C$DW$688, DW_AT_name("FDF")
    4679                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_FDF")
    4680                      .dwattr $C$DW$688, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4681                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4682                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4683              $C$DW$689       .dwtag  DW_TAG_member
    4684                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   93

    4685                      .dwattr $C$DW$689, DW_AT_name("STB")
    4686                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_STB")
    4687                      .dwattr $C$DW$689, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4688                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4689                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4690              $C$DW$690       .dwtag  DW_TAG_member
    4691                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$22)
    4692                      .dwattr $C$DW$690, DW_AT_name("IRS")
    4693                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_IRS")
    4694                      .dwattr $C$DW$690, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4695                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4696                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4697              $C$DW$691       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$22)
    4699                      .dwattr $C$DW$691, DW_AT_name("DLB")
    4700                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_DLB")
    4701                      .dwattr $C$DW$691, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4702                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4703                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4704              $C$DW$692       .dwtag  DW_TAG_member
    4705                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$22)
    4706                      .dwattr $C$DW$692, DW_AT_name("RM")
    4707                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_RM")
    4708                      .dwattr $C$DW$692, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4709                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4710                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4711              $C$DW$693       .dwtag  DW_TAG_member
    4712                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$22)
    4713                      .dwattr $C$DW$693, DW_AT_name("XA")
    4714                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_XA")
    4715                      .dwattr $C$DW$693, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4716                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4717                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$694       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$22)
    4720                      .dwattr $C$DW$694, DW_AT_name("TRX")
    4721                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_TRX")
    4722                      .dwattr $C$DW$694, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4723                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4724                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4725              $C$DW$695       .dwtag  DW_TAG_member
    4726                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$22)
    4727                      .dwattr $C$DW$695, DW_AT_name("MST")
    4728                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_MST")
    4729                      .dwattr $C$DW$695, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4730                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4731                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4732              $C$DW$696       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$22)
    4734                      .dwattr $C$DW$696, DW_AT_name("STP")
    4735                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_STP")
    4736                      .dwattr $C$DW$696, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4737                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4738                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$697       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   94

    4740                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$22)
    4741                      .dwattr $C$DW$697, DW_AT_name("rsvd1")
    4742                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_rsvd1")
    4743                      .dwattr $C$DW$697, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4744                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4745                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4746              $C$DW$698       .dwtag  DW_TAG_member
    4747                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$22)
    4748                      .dwattr $C$DW$698, DW_AT_name("STT")
    4749                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_STT")
    4750                      .dwattr $C$DW$698, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4751                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4752                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4753              $C$DW$699       .dwtag  DW_TAG_member
    4754                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$22)
    4755                      .dwattr $C$DW$699, DW_AT_name("FREE")
    4756                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_FREE")
    4757                      .dwattr $C$DW$699, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4758                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4759                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4760              $C$DW$700       .dwtag  DW_TAG_member
    4761                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$22)
    4762                      .dwattr $C$DW$700, DW_AT_name("NACKMOD")
    4763                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_NACKMOD")
    4764                      .dwattr $C$DW$700, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4765                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4766                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4767                      .dwendtag $C$DW$T$33
    4768              
    4769              
    4770              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4771                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_REG")
    4772                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    4773              $C$DW$701       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$22)
    4775                      .dwattr $C$DW$701, DW_AT_name("all")
    4776                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_all")
    4777                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$702       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$33)
    4781                      .dwattr $C$DW$702, DW_AT_name("bit")
    4782                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_bit")
    4783                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4784                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4785                      .dwendtag $C$DW$T$34
    4786              
    4787              
    4788              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4789                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_BITS")
    4790                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4791              $C$DW$703       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$22)
    4793                      .dwattr $C$DW$703, DW_AT_name("IPSC")
    4794                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_IPSC")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   95

    4795                      .dwattr $C$DW$703, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4796                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4797                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$704       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$22)
    4800                      .dwattr $C$DW$704, DW_AT_name("rsvd1")
    4801                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd1")
    4802                      .dwattr $C$DW$704, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4803                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4804                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4805                      .dwendtag $C$DW$T$35
    4806              
    4807              
    4808              $C$DW$T$36      .dwtag  DW_TAG_union_type
    4809                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_REG")
    4810                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4811              $C$DW$705       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$22)
    4813                      .dwattr $C$DW$705, DW_AT_name("all")
    4814                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_all")
    4815                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$706       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$35)
    4819                      .dwattr $C$DW$706, DW_AT_name("bit")
    4820                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_bit")
    4821                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4823                      .dwendtag $C$DW$T$36
    4824              
    4825              
    4826              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4827                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_BITS")
    4828                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4829              $C$DW$707       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$22)
    4831                      .dwattr $C$DW$707, DW_AT_name("ARBL")
    4832                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ARBL")
    4833                      .dwattr $C$DW$707, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4834                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4835                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4836              $C$DW$708       .dwtag  DW_TAG_member
    4837                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$22)
    4838                      .dwattr $C$DW$708, DW_AT_name("NACK")
    4839                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_NACK")
    4840                      .dwattr $C$DW$708, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4841                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4842                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4843              $C$DW$709       .dwtag  DW_TAG_member
    4844                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$22)
    4845                      .dwattr $C$DW$709, DW_AT_name("ARDY")
    4846                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_ARDY")
    4847                      .dwattr $C$DW$709, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4848                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4849                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   96

    4850              $C$DW$710       .dwtag  DW_TAG_member
    4851                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$22)
    4852                      .dwattr $C$DW$710, DW_AT_name("RRDY")
    4853                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_RRDY")
    4854                      .dwattr $C$DW$710, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4855                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4856                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4857              $C$DW$711       .dwtag  DW_TAG_member
    4858                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$22)
    4859                      .dwattr $C$DW$711, DW_AT_name("XRDY")
    4860                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_XRDY")
    4861                      .dwattr $C$DW$711, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4862                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4863                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4864              $C$DW$712       .dwtag  DW_TAG_member
    4865                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$22)
    4866                      .dwattr $C$DW$712, DW_AT_name("SCD")
    4867                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_SCD")
    4868                      .dwattr $C$DW$712, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4869                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4870                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4871              $C$DW$713       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$22)
    4873                      .dwattr $C$DW$713, DW_AT_name("rsvd1")
    4874                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_rsvd1")
    4875                      .dwattr $C$DW$713, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4876                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4877                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$714       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$22)
    4880                      .dwattr $C$DW$714, DW_AT_name("AD0")
    4881                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_AD0")
    4882                      .dwattr $C$DW$714, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4883                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4884                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4885              $C$DW$715       .dwtag  DW_TAG_member
    4886                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$22)
    4887                      .dwattr $C$DW$715, DW_AT_name("AAS")
    4888                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_AAS")
    4889                      .dwattr $C$DW$715, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4890                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4891                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4892              $C$DW$716       .dwtag  DW_TAG_member
    4893                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$22)
    4894                      .dwattr $C$DW$716, DW_AT_name("XSMT")
    4895                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_XSMT")
    4896                      .dwattr $C$DW$716, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4897                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4899              $C$DW$717       .dwtag  DW_TAG_member
    4900                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$22)
    4901                      .dwattr $C$DW$717, DW_AT_name("RSFULL")
    4902                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_RSFULL")
    4903                      .dwattr $C$DW$717, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4904                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   97

    4905                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4906              $C$DW$718       .dwtag  DW_TAG_member
    4907                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$22)
    4908                      .dwattr $C$DW$718, DW_AT_name("BB")
    4909                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_BB")
    4910                      .dwattr $C$DW$718, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4911                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4912                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$719       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$22)
    4915                      .dwattr $C$DW$719, DW_AT_name("NACKSNT")
    4916                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_NACKSNT")
    4917                      .dwattr $C$DW$719, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4918                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4919                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4920              $C$DW$720       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$22)
    4922                      .dwattr $C$DW$720, DW_AT_name("SDIR")
    4923                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_SDIR")
    4924                      .dwattr $C$DW$720, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4925                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4926                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4927              $C$DW$721       .dwtag  DW_TAG_member
    4928                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$22)
    4929                      .dwattr $C$DW$721, DW_AT_name("rsvd2")
    4930                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd2")
    4931                      .dwattr $C$DW$721, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4932                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4933                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4934                      .dwendtag $C$DW$T$37
    4935              
    4936              
    4937              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4938                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_REG")
    4939                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4940              $C$DW$722       .dwtag  DW_TAG_member
    4941                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$22)
    4942                      .dwattr $C$DW$722, DW_AT_name("all")
    4943                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_all")
    4944                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$723       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$37)
    4948                      .dwattr $C$DW$723, DW_AT_name("bit")
    4949                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_bit")
    4950                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4951                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4952                      .dwendtag $C$DW$T$38
    4953              
    4954              
    4955              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4956                      .dwattr $C$DW$T$46, DW_AT_name("_ADC_Obj_")
    4957                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x6650)
    4958              $C$DW$724       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   98

    4960                      .dwattr $C$DW$724, DW_AT_name("ADCRESULT")
    4961                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_ADCRESULT")
    4962                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4963                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$725       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$41)
    4966                      .dwattr $C$DW$725, DW_AT_name("resvd_1")
    4967                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_resvd_1")
    4968                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4969                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4970              $C$DW$726       .dwtag  DW_TAG_member
    4971                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    4972                      .dwattr $C$DW$726, DW_AT_name("ADCCTL1")
    4973                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_ADCCTL1")
    4974                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4975                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4976              $C$DW$727       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$39)
    4978                      .dwattr $C$DW$727, DW_AT_name("ADCCTL2")
    4979                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_ADCCTL2")
    4980                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4981                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4982              $C$DW$728       .dwtag  DW_TAG_member
    4983                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$42)
    4984                      .dwattr $C$DW$728, DW_AT_name("rsvd_2")
    4985                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_rsvd_2")
    4986                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4987                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4988              $C$DW$729       .dwtag  DW_TAG_member
    4989                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$39)
    4990                      .dwattr $C$DW$729, DW_AT_name("ADCINTFLG")
    4991                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_ADCINTFLG")
    4992                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4993                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4994              $C$DW$730       .dwtag  DW_TAG_member
    4995                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$39)
    4996                      .dwattr $C$DW$730, DW_AT_name("ADCINTFLGCLR")
    4997                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4998                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4999                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5000              $C$DW$731       .dwtag  DW_TAG_member
    5001                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$39)
    5002                      .dwattr $C$DW$731, DW_AT_name("ADCINTOVF")
    5003                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_ADCINTOVF")
    5004                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5005                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5006              $C$DW$732       .dwtag  DW_TAG_member
    5007                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$39)
    5008                      .dwattr $C$DW$732, DW_AT_name("ADCINTOVFCLR")
    5009                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5010                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5011                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5012              $C$DW$733       .dwtag  DW_TAG_member
    5013                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$43)
    5014                      .dwattr $C$DW$733, DW_AT_name("INTSELxNy")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE   99

    5015                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_INTSELxNy")
    5016                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5017                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5018              $C$DW$734       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$44)
    5020                      .dwattr $C$DW$734, DW_AT_name("rsvd_3")
    5021                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_rsvd_3")
    5022                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5023                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5024              $C$DW$735       .dwtag  DW_TAG_member
    5025                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$39)
    5026                      .dwattr $C$DW$735, DW_AT_name("SOCPRICTRL")
    5027                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5028                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5029                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5030              $C$DW$736       .dwtag  DW_TAG_member
    5031                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$39)
    5032                      .dwattr $C$DW$736, DW_AT_name("rsvd_4")
    5033                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_rsvd_4")
    5034                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5035                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5036              $C$DW$737       .dwtag  DW_TAG_member
    5037                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$39)
    5038                      .dwattr $C$DW$737, DW_AT_name("ADCSAMPLEMODE")
    5039                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5040                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5041                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5042              $C$DW$738       .dwtag  DW_TAG_member
    5043                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$39)
    5044                      .dwattr $C$DW$738, DW_AT_name("rsvd_5")
    5045                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd_5")
    5046                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5047                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5048              $C$DW$739       .dwtag  DW_TAG_member
    5049                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$39)
    5050                      .dwattr $C$DW$739, DW_AT_name("ADCINTSOCSEL1")
    5051                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    5052                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5053                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5054              $C$DW$740       .dwtag  DW_TAG_member
    5055                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$39)
    5056                      .dwattr $C$DW$740, DW_AT_name("ADCINTSOCSEL2")
    5057                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5058                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5059                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5060              $C$DW$741       .dwtag  DW_TAG_member
    5061                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$42)
    5062                      .dwattr $C$DW$741, DW_AT_name("rsvd_6")
    5063                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_rsvd_6")
    5064                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5065                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5066              $C$DW$742       .dwtag  DW_TAG_member
    5067                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$39)
    5068                      .dwattr $C$DW$742, DW_AT_name("ADCSOCFLG1")
    5069                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ADCSOCFLG1")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  100

    5070                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5071                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5072              $C$DW$743       .dwtag  DW_TAG_member
    5073                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$39)
    5074                      .dwattr $C$DW$743, DW_AT_name("rsvd_7")
    5075                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_rsvd_7")
    5076                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5077                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5078              $C$DW$744       .dwtag  DW_TAG_member
    5079                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$39)
    5080                      .dwattr $C$DW$744, DW_AT_name("ADCSOCFRC1")
    5081                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5082                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5083                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5084              $C$DW$745       .dwtag  DW_TAG_member
    5085                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$39)
    5086                      .dwattr $C$DW$745, DW_AT_name("rsvd_8")
    5087                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_rsvd_8")
    5088                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5089                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5090              $C$DW$746       .dwtag  DW_TAG_member
    5091                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$39)
    5092                      .dwattr $C$DW$746, DW_AT_name("ADCSOCOVF1")
    5093                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5094                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5095                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5096              $C$DW$747       .dwtag  DW_TAG_member
    5097                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$39)
    5098                      .dwattr $C$DW$747, DW_AT_name("rsvd_9")
    5099                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_rsvd_9")
    5100                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5101                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5102              $C$DW$748       .dwtag  DW_TAG_member
    5103                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$39)
    5104                      .dwattr $C$DW$748, DW_AT_name("ADCSOCOVFCLR1")
    5105                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5106                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    5107                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5108              $C$DW$749       .dwtag  DW_TAG_member
    5109                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$39)
    5110                      .dwattr $C$DW$749, DW_AT_name("rsvd_10")
    5111                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_rsvd_10")
    5112                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5113                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5114              $C$DW$750       .dwtag  DW_TAG_member
    5115                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$40)
    5116                      .dwattr $C$DW$750, DW_AT_name("ADCSOCxCTL")
    5117                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5118                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5119                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5120              $C$DW$751       .dwtag  DW_TAG_member
    5121                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$40)
    5122                      .dwattr $C$DW$751, DW_AT_name("rsvd_11")
    5123                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_rsvd_11")
    5124                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  101

    5125                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5126              $C$DW$752       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$39)
    5128                      .dwattr $C$DW$752, DW_AT_name("ADCREFTRIM")
    5129                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5130                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5131                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5132              $C$DW$753       .dwtag  DW_TAG_member
    5133                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$39)
    5134                      .dwattr $C$DW$753, DW_AT_name("ADCOFFTRIM")
    5135                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5136                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5137                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5138              $C$DW$754       .dwtag  DW_TAG_member
    5139                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$45)
    5140                      .dwattr $C$DW$754, DW_AT_name("resvd_12")
    5141                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_resvd_12")
    5142                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5143                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5144              $C$DW$755       .dwtag  DW_TAG_member
    5145                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$39)
    5146                      .dwattr $C$DW$755, DW_AT_name("ADCREV")
    5147                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ADCREV")
    5148                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5149                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5150                      .dwendtag $C$DW$T$46
    5151              
    5152              $C$DW$T$249     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5153                      .dwattr $C$DW$T$249, DW_AT_type(*$C$DW$T$46)
    5154                      .dwattr $C$DW$T$249, DW_AT_language(DW_LANG_C)
    5155              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    5156                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$46)
    5157                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    5158              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5159                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    5160                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    5161              
    5162              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5163                      .dwattr $C$DW$T$49, DW_AT_name("_CLARKE_Obj_")
    5164                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    5165              $C$DW$756       .dwtag  DW_TAG_member
    5166                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$47)
    5167                      .dwattr $C$DW$756, DW_AT_name("alpha_sf")
    5168                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_alpha_sf")
    5169                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5170                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5171              $C$DW$757       .dwtag  DW_TAG_member
    5172                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$47)
    5173                      .dwattr $C$DW$757, DW_AT_name("beta_sf")
    5174                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_beta_sf")
    5175                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5176                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5177              $C$DW$758       .dwtag  DW_TAG_member
    5178                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$48)
    5179                      .dwattr $C$DW$758, DW_AT_name("numSensors")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  102

    5180                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_numSensors")
    5181                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5182                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5183                      .dwendtag $C$DW$T$49
    5184              
    5185              $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    5186                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$49)
    5187                      .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    5188              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    5189                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$49)
    5190                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    5191              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5192                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    5193                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    5194              
    5195              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5196                      .dwattr $C$DW$T$51, DW_AT_name("_CLK_Obj_")
    5197                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x11)
    5198              $C$DW$759       .dwtag  DW_TAG_member
    5199                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$39)
    5200                      .dwattr $C$DW$759, DW_AT_name("XCLK")
    5201                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_XCLK")
    5202                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5203                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5204              $C$DW$760       .dwtag  DW_TAG_member
    5205                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$39)
    5206                      .dwattr $C$DW$760, DW_AT_name("rsvd_1")
    5207                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_rsvd_1")
    5208                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5209                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5210              $C$DW$761       .dwtag  DW_TAG_member
    5211                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$39)
    5212                      .dwattr $C$DW$761, DW_AT_name("CLKCTL")
    5213                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_CLKCTL")
    5214                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5215                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5216              $C$DW$762       .dwtag  DW_TAG_member
    5217                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$50)
    5218                      .dwattr $C$DW$762, DW_AT_name("rsvd_2")
    5219                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_rsvd_2")
    5220                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5221                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5222              $C$DW$763       .dwtag  DW_TAG_member
    5223                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$39)
    5224                      .dwattr $C$DW$763, DW_AT_name("LOSPCP")
    5225                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_LOSPCP")
    5226                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5227                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5228              $C$DW$764       .dwtag  DW_TAG_member
    5229                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$39)
    5230                      .dwattr $C$DW$764, DW_AT_name("PCLKCR0")
    5231                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_PCLKCR0")
    5232                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5233                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5234              $C$DW$765       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  103

    5235                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$39)
    5236                      .dwattr $C$DW$765, DW_AT_name("PCLKCR1")
    5237                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_PCLKCR1")
    5238                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5239                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5240              $C$DW$766       .dwtag  DW_TAG_member
    5241                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$42)
    5242                      .dwattr $C$DW$766, DW_AT_name("rsvd_3")
    5243                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_rsvd_3")
    5244                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5245                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5246              $C$DW$767       .dwtag  DW_TAG_member
    5247                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$39)
    5248                      .dwattr $C$DW$767, DW_AT_name("PCLKCR3")
    5249                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_PCLKCR3")
    5250                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5251                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5252                      .dwendtag $C$DW$T$51
    5253              
    5254              $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    5255                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$51)
    5256                      .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    5257              $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5258                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    5259                      .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    5260              
    5261              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5262                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_Obj_")
    5263                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5264              $C$DW$768       .dwtag  DW_TAG_member
    5265                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$48)
    5266                      .dwattr $C$DW$768, DW_AT_name("tmp")
    5267                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_tmp")
    5268                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5269                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5270                      .dwendtag $C$DW$T$52
    5271              
    5272              $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    5273                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$52)
    5274                      .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    5275              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5276                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    5277                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    5278              
    5279              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    5280                      .dwattr $C$DW$T$55, DW_AT_name("_CPU_USAGE_Obj_")
    5281                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x16)
    5282              $C$DW$769       .dwtag  DW_TAG_member
    5283                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$53)
    5284                      .dwattr $C$DW$769, DW_AT_name("timerPeriod_cnts")
    5285                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    5286                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5287                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5288              $C$DW$770       .dwtag  DW_TAG_member
    5289                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  104

    5290                      .dwattr $C$DW$770, DW_AT_name("cnt_z0")
    5291                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_cnt_z0")
    5292                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5293                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5294              $C$DW$771       .dwtag  DW_TAG_member
    5295                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$53)
    5296                      .dwattr $C$DW$771, DW_AT_name("cnt_z1")
    5297                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_cnt_z1")
    5298                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5299                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5300              $C$DW$772       .dwtag  DW_TAG_member
    5301                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$53)
    5302                      .dwattr $C$DW$772, DW_AT_name("deltaCnt")
    5303                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_deltaCnt")
    5304                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5305                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5306              $C$DW$773       .dwtag  DW_TAG_member
    5307                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$53)
    5308                      .dwattr $C$DW$773, DW_AT_name("deltaCntAcc")
    5309                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_deltaCntAcc")
    5310                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5311                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5312              $C$DW$774       .dwtag  DW_TAG_member
    5313                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$53)
    5314                      .dwattr $C$DW$774, DW_AT_name("deltaCntAccNum")
    5315                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_deltaCntAccNum")
    5316                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5317                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5318              $C$DW$775       .dwtag  DW_TAG_member
    5319                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$53)
    5320                      .dwattr $C$DW$775, DW_AT_name("deltaCntAccNumMax")
    5321                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    5322                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5323                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5324              $C$DW$776       .dwtag  DW_TAG_member
    5325                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$53)
    5326                      .dwattr $C$DW$776, DW_AT_name("minDeltaCntObserved")
    5327                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    5328                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5329                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5330              $C$DW$777       .dwtag  DW_TAG_member
    5331                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$53)
    5332                      .dwattr $C$DW$777, DW_AT_name("avgDeltaCntObserved")
    5333                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    5334                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5335                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5336              $C$DW$778       .dwtag  DW_TAG_member
    5337                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$53)
    5338                      .dwattr $C$DW$778, DW_AT_name("maxDeltaCntObserved")
    5339                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    5340                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5341                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5342              $C$DW$779       .dwtag  DW_TAG_member
    5343                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$54)
    5344                      .dwattr $C$DW$779, DW_AT_name("flag_resetStats")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  105

    5345                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_flag_resetStats")
    5346                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5347                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5348                      .dwendtag $C$DW$T$55
    5349              
    5350              $C$DW$T$250     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    5351                      .dwattr $C$DW$T$250, DW_AT_type(*$C$DW$T$55)
    5352                      .dwattr $C$DW$T$250, DW_AT_language(DW_LANG_C)
    5353              $C$DW$T$251     .dwtag  DW_TAG_pointer_type
    5354                      .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$55)
    5355                      .dwattr $C$DW$T$251, DW_AT_address_class(0x20)
    5356              $C$DW$T$252     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    5357                      .dwattr $C$DW$T$252, DW_AT_type(*$C$DW$T$251)
    5358                      .dwattr $C$DW$T$252, DW_AT_language(DW_LANG_C)
    5359              
    5360              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    5361                      .dwattr $C$DW$T$87, DW_AT_name("_CTRL_Obj_")
    5362                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x108)
    5363              $C$DW$780       .dwtag  DW_TAG_member
    5364                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$56)
    5365                      .dwattr $C$DW$780, DW_AT_name("version")
    5366                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_version")
    5367                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5368                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5369              $C$DW$781       .dwtag  DW_TAG_member
    5370                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$58)
    5371                      .dwattr $C$DW$781, DW_AT_name("state")
    5372                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_state")
    5373                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5374                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5375              $C$DW$782       .dwtag  DW_TAG_member
    5376                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$58)
    5377                      .dwattr $C$DW$782, DW_AT_name("prevState")
    5378                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_prevState")
    5379                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5380                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5381              $C$DW$783       .dwtag  DW_TAG_member
    5382                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$60)
    5383                      .dwattr $C$DW$783, DW_AT_name("errorCode")
    5384                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_errorCode")
    5385                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5386                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5387              $C$DW$784       .dwtag  DW_TAG_member
    5388                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$62)
    5389                      .dwattr $C$DW$784, DW_AT_name("clarkeHandle_I")
    5390                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_clarkeHandle_I")
    5391                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5392                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5393              $C$DW$785       .dwtag  DW_TAG_member
    5394                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$63)
    5395                      .dwattr $C$DW$785, DW_AT_name("clarke_I")
    5396                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_clarke_I")
    5397                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5398                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5399              $C$DW$786       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  106

    5400                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$62)
    5401                      .dwattr $C$DW$786, DW_AT_name("clarkeHandle_V")
    5402                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_clarkeHandle_V")
    5403                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5404                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5405              $C$DW$787       .dwtag  DW_TAG_member
    5406                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$63)
    5407                      .dwattr $C$DW$787, DW_AT_name("clarke_V")
    5408                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_clarke_V")
    5409                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5410                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5411              $C$DW$788       .dwtag  DW_TAG_member
    5412                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$65)
    5413                      .dwattr $C$DW$788, DW_AT_name("estHandle")
    5414                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_estHandle")
    5415                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5416                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5417              $C$DW$789       .dwtag  DW_TAG_member
    5418                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$67)
    5419                      .dwattr $C$DW$789, DW_AT_name("parkHandle")
    5420                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_parkHandle")
    5421                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    5422                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5423              $C$DW$790       .dwtag  DW_TAG_member
    5424                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$68)
    5425                      .dwattr $C$DW$790, DW_AT_name("park")
    5426                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_park")
    5427                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5428                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    5429              $C$DW$791       .dwtag  DW_TAG_member
    5430                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$70)
    5431                      .dwattr $C$DW$791, DW_AT_name("pidHandle_Id")
    5432                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_pidHandle_Id")
    5433                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5434                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    5435              $C$DW$792       .dwtag  DW_TAG_member
    5436                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$71)
    5437                      .dwattr $C$DW$792, DW_AT_name("pid_Id")
    5438                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_pid_Id")
    5439                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    5440                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    5441              $C$DW$793       .dwtag  DW_TAG_member
    5442                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$70)
    5443                      .dwattr $C$DW$793, DW_AT_name("pidHandle_Iq")
    5444                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_pidHandle_Iq")
    5445                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    5446                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    5447              $C$DW$794       .dwtag  DW_TAG_member
    5448                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$71)
    5449                      .dwattr $C$DW$794, DW_AT_name("pid_Iq")
    5450                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_pid_Iq")
    5451                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5452                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    5453              $C$DW$795       .dwtag  DW_TAG_member
    5454                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  107

    5455                      .dwattr $C$DW$795, DW_AT_name("pidHandle_spd")
    5456                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_pidHandle_spd")
    5457                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5458                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    5459              $C$DW$796       .dwtag  DW_TAG_member
    5460                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$71)
    5461                      .dwattr $C$DW$796, DW_AT_name("pid_spd")
    5462                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_pid_spd")
    5463                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    5464                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    5465              $C$DW$797       .dwtag  DW_TAG_member
    5466                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$73)
    5467                      .dwattr $C$DW$797, DW_AT_name("iparkHandle")
    5468                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_iparkHandle")
    5469                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    5470                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    5471              $C$DW$798       .dwtag  DW_TAG_member
    5472                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$74)
    5473                      .dwattr $C$DW$798, DW_AT_name("ipark")
    5474                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_ipark")
    5475                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5476                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    5477              $C$DW$799       .dwtag  DW_TAG_member
    5478                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$76)
    5479                      .dwattr $C$DW$799, DW_AT_name("svgenHandle")
    5480                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_svgenHandle")
    5481                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    5482                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    5483              $C$DW$800       .dwtag  DW_TAG_member
    5484                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$77)
    5485                      .dwattr $C$DW$800, DW_AT_name("svgen")
    5486                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_svgen")
    5487                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    5488                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    5489              $C$DW$801       .dwtag  DW_TAG_member
    5490                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$79)
    5491                      .dwattr $C$DW$801, DW_AT_name("trajHandle_Id")
    5492                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_trajHandle_Id")
    5493                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    5494                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    5495              $C$DW$802       .dwtag  DW_TAG_member
    5496                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$80)
    5497                      .dwattr $C$DW$802, DW_AT_name("traj_Id")
    5498                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_traj_Id")
    5499                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    5500                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    5501              $C$DW$803       .dwtag  DW_TAG_member
    5502                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$79)
    5503                      .dwattr $C$DW$803, DW_AT_name("trajHandle_spd")
    5504                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_trajHandle_spd")
    5505                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    5506                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    5507              $C$DW$804       .dwtag  DW_TAG_member
    5508                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$80)
    5509                      .dwattr $C$DW$804, DW_AT_name("traj_spd")
TMS320C2000 Assembler PC v6.4.11 Thu Aug 04 15:58:27 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1992810                            PAGE  108

    5510                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_traj_spd")
    5511                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    5512                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    5513              $C$DW$805       .dwtag  DW_TAG_member
    5514                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$79)
    5515                      .dwattr $C$DW$805, DW_AT_name("trajHandle_spdMax")
    5516                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    5517                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    5518                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
