TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Sat Nov 26 19:25:36 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3169              $C$DW$503       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    3170              $C$DW$504       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    3171              $C$DW$505       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    3172              $C$DW$506       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    3173              $C$DW$507       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    3174              $C$DW$508       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3175              $C$DW$509       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3176              $C$DW$510       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   64

    3177              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3178              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3179                      .dwendtag $C$DW$T$214
    3180              
    3181              $C$DW$T$215     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3182                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
    3183                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    3184              
    3185              $C$DW$T$217     .dwtag  DW_TAG_enumeration_type
    3186                      .dwattr $C$DW$T$217, DW_AT_byte_size(0x01)
    3187              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3188              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3189              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3190              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3191              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3192              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3193              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3194              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3195              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3196              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3197              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3198              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3199                      .dwendtag $C$DW$T$217
    3200              
    3201              $C$DW$T$218     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3202                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    3203                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    3204              
    3205              $C$DW$T$220     .dwtag  DW_TAG_enumeration_type
    3206                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
    3207              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3208              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3209              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3210                      .dwendtag $C$DW$T$220
    3211              
    3212              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3213                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    3214                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    3215              
    3216              $C$DW$T$223     .dwtag  DW_TAG_enumeration_type
    3217                      .dwattr $C$DW$T$223, DW_AT_byte_size(0x01)
    3218              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3219              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3220                      .dwendtag $C$DW$T$223
    3221              
    3222              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3223                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
    3224                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    3225              
    3226              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3227                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3228                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3229              $C$DW$530       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$25)
    3231                      .dwattr $C$DW$530, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   65

    3232                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_ADCRESULT")
    3233                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3234                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    3235              $C$DW$531       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$26)
    3237                      .dwattr $C$DW$531, DW_AT_name("resvd_1")
    3238                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_resvd_1")
    3239                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3240                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    3241              $C$DW$532       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$24)
    3243                      .dwattr $C$DW$532, DW_AT_name("ADCCTL1")
    3244                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_ADCCTL1")
    3245                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3246                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    3247              $C$DW$533       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$24)
    3249                      .dwattr $C$DW$533, DW_AT_name("ADCCTL2")
    3250                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_ADCCTL2")
    3251                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3252                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$534       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$27)
    3255                      .dwattr $C$DW$534, DW_AT_name("rsvd_2")
    3256                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_rsvd_2")
    3257                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3258                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$535       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$24)
    3261                      .dwattr $C$DW$535, DW_AT_name("ADCINTFLG")
    3262                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_ADCINTFLG")
    3263                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3264                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    3265              $C$DW$536       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$24)
    3267                      .dwattr $C$DW$536, DW_AT_name("ADCINTFLGCLR")
    3268                      .dwattr $C$DW$536, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3269                      .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3270                      .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    3271              $C$DW$537       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$24)
    3273                      .dwattr $C$DW$537, DW_AT_name("ADCINTOVF")
    3274                      .dwattr $C$DW$537, DW_AT_TI_symbol_name("_ADCINTOVF")
    3275                      .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3276                      .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    3277              $C$DW$538       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$24)
    3279                      .dwattr $C$DW$538, DW_AT_name("ADCINTOVFCLR")
    3280                      .dwattr $C$DW$538, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3281                      .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3282                      .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    3283              $C$DW$539       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$28)
    3285                      .dwattr $C$DW$539, DW_AT_name("INTSELxNy")
    3286                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   66

    3287                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3288                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3289              $C$DW$540       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$29)
    3291                      .dwattr $C$DW$540, DW_AT_name("rsvd_3")
    3292                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd_3")
    3293                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3294                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3295              $C$DW$541       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$24)
    3297                      .dwattr $C$DW$541, DW_AT_name("SOCPRICTRL")
    3298                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3299                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3300                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3301              $C$DW$542       .dwtag  DW_TAG_member
    3302                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$24)
    3303                      .dwattr $C$DW$542, DW_AT_name("rsvd_4")
    3304                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_rsvd_4")
    3305                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3306                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3307              $C$DW$543       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$24)
    3309                      .dwattr $C$DW$543, DW_AT_name("ADCSAMPLEMODE")
    3310                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3311                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3312                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3313              $C$DW$544       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$24)
    3315                      .dwattr $C$DW$544, DW_AT_name("rsvd_5")
    3316                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_rsvd_5")
    3317                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3318                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3319              $C$DW$545       .dwtag  DW_TAG_member
    3320                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$24)
    3321                      .dwattr $C$DW$545, DW_AT_name("ADCINTSOCSEL1")
    3322                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3323                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3324                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3325              $C$DW$546       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$24)
    3327                      .dwattr $C$DW$546, DW_AT_name("ADCINTSOCSEL2")
    3328                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3329                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3330                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3331              $C$DW$547       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$27)
    3333                      .dwattr $C$DW$547, DW_AT_name("rsvd_6")
    3334                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_rsvd_6")
    3335                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3336                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3337              $C$DW$548       .dwtag  DW_TAG_member
    3338                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$24)
    3339                      .dwattr $C$DW$548, DW_AT_name("ADCSOCFLG1")
    3340                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3341                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   67

    3342                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3343              $C$DW$549       .dwtag  DW_TAG_member
    3344                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$24)
    3345                      .dwattr $C$DW$549, DW_AT_name("rsvd_7")
    3346                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_7")
    3347                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3348                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3349              $C$DW$550       .dwtag  DW_TAG_member
    3350                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$24)
    3351                      .dwattr $C$DW$550, DW_AT_name("ADCSOCFRC1")
    3352                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3353                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3354                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3355              $C$DW$551       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$24)
    3357                      .dwattr $C$DW$551, DW_AT_name("rsvd_8")
    3358                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_rsvd_8")
    3359                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3360                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3361              $C$DW$552       .dwtag  DW_TAG_member
    3362                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$24)
    3363                      .dwattr $C$DW$552, DW_AT_name("ADCSOCOVF1")
    3364                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3365                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3366                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3367              $C$DW$553       .dwtag  DW_TAG_member
    3368                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    3369                      .dwattr $C$DW$553, DW_AT_name("rsvd_9")
    3370                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_rsvd_9")
    3371                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3372                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3373              $C$DW$554       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$24)
    3375                      .dwattr $C$DW$554, DW_AT_name("ADCSOCOVFCLR1")
    3376                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3377                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3378                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3379              $C$DW$555       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$24)
    3381                      .dwattr $C$DW$555, DW_AT_name("rsvd_10")
    3382                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_10")
    3383                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3384                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3385              $C$DW$556       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$25)
    3387                      .dwattr $C$DW$556, DW_AT_name("ADCSOCxCTL")
    3388                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3389                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3390                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3391              $C$DW$557       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$25)
    3393                      .dwattr $C$DW$557, DW_AT_name("rsvd_11")
    3394                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_11")
    3395                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3396                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   68

    3397              $C$DW$558       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$24)
    3399                      .dwattr $C$DW$558, DW_AT_name("ADCREFTRIM")
    3400                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3401                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3402                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3403              $C$DW$559       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$24)
    3405                      .dwattr $C$DW$559, DW_AT_name("ADCOFFTRIM")
    3406                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3407                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3408                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3409              $C$DW$560       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$30)
    3411                      .dwattr $C$DW$560, DW_AT_name("resvd_12")
    3412                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_resvd_12")
    3413                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3414                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$561       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    3417                      .dwattr $C$DW$561, DW_AT_name("ADCREV")
    3418                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCREV")
    3419                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3420                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3421                      .dwendtag $C$DW$T$31
    3422              
    3423              $C$DW$T$226     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3424                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$31)
    3425                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    3426              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3427                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$31)
    3428                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3429              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3430                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3431                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3432              
    3433              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3434                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3435                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3436              $C$DW$562       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$32)
    3438                      .dwattr $C$DW$562, DW_AT_name("alpha_sf")
    3439                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_alpha_sf")
    3440                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3441                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3442              $C$DW$563       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$32)
    3444                      .dwattr $C$DW$563, DW_AT_name("beta_sf")
    3445                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_beta_sf")
    3446                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3447                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3448              $C$DW$564       .dwtag  DW_TAG_member
    3449                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$33)
    3450                      .dwattr $C$DW$564, DW_AT_name("numSensors")
    3451                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_numSensors")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   69

    3452                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3453                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3454                      .dwendtag $C$DW$T$34
    3455              
    3456              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3457                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3458                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3459              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3460                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3461                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3462              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3463                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3464                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3465              
    3466              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3467                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3468                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3469              $C$DW$565       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$24)
    3471                      .dwattr $C$DW$565, DW_AT_name("XCLK")
    3472                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_XCLK")
    3473                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3474                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3475              $C$DW$566       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$24)
    3477                      .dwattr $C$DW$566, DW_AT_name("rsvd_1")
    3478                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_1")
    3479                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3480                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3481              $C$DW$567       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$24)
    3483                      .dwattr $C$DW$567, DW_AT_name("CLKCTL")
    3484                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_CLKCTL")
    3485                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3486                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3487              $C$DW$568       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$35)
    3489                      .dwattr $C$DW$568, DW_AT_name("rsvd_2")
    3490                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_2")
    3491                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3492                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$569       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$24)
    3495                      .dwattr $C$DW$569, DW_AT_name("LOSPCP")
    3496                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_LOSPCP")
    3497                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3498                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$570       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$24)
    3501                      .dwattr $C$DW$570, DW_AT_name("PCLKCR0")
    3502                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_PCLKCR0")
    3503                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3504                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3505              $C$DW$571       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   70

    3507                      .dwattr $C$DW$571, DW_AT_name("PCLKCR1")
    3508                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_PCLKCR1")
    3509                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3510                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$572       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$27)
    3513                      .dwattr $C$DW$572, DW_AT_name("rsvd_3")
    3514                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_3")
    3515                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3516                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3517              $C$DW$573       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    3519                      .dwattr $C$DW$573, DW_AT_name("PCLKCR3")
    3520                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_PCLKCR3")
    3521                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3522                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3523                      .dwendtag $C$DW$T$36
    3524              
    3525              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    3526                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$36)
    3527                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    3528              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3529                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    3530                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3531              
    3532              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3533                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3534                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3535              $C$DW$574       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$33)
    3537                      .dwattr $C$DW$574, DW_AT_name("tmp")
    3538                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_tmp")
    3539                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3540                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3541                      .dwendtag $C$DW$T$37
    3542              
    3543              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3544                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$37)
    3545                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3546              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3547                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    3548                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3549              
    3550              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3551                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3552                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3553              $C$DW$575       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$38)
    3555                      .dwattr $C$DW$575, DW_AT_name("version")
    3556                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_version")
    3557                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3558                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3559              $C$DW$576       .dwtag  DW_TAG_member
    3560                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$40)
    3561                      .dwattr $C$DW$576, DW_AT_name("state")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   71

    3562                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_state")
    3563                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3564                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3565              $C$DW$577       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$40)
    3567                      .dwattr $C$DW$577, DW_AT_name("prevState")
    3568                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_prevState")
    3569                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3570                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3571              $C$DW$578       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$42)
    3573                      .dwattr $C$DW$578, DW_AT_name("errorCode")
    3574                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_errorCode")
    3575                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3576                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3577              $C$DW$579       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$44)
    3579                      .dwattr $C$DW$579, DW_AT_name("clarkeHandle_I")
    3580                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3581                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3582                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3583              $C$DW$580       .dwtag  DW_TAG_member
    3584                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$45)
    3585                      .dwattr $C$DW$580, DW_AT_name("clarke_I")
    3586                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_clarke_I")
    3587                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3588                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3589              $C$DW$581       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$44)
    3591                      .dwattr $C$DW$581, DW_AT_name("clarkeHandle_V")
    3592                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3593                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3594                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3595              $C$DW$582       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$45)
    3597                      .dwattr $C$DW$582, DW_AT_name("clarke_V")
    3598                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_clarke_V")
    3599                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3600                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3601              $C$DW$583       .dwtag  DW_TAG_member
    3602                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$47)
    3603                      .dwattr $C$DW$583, DW_AT_name("estHandle")
    3604                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_estHandle")
    3605                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3606                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3607              $C$DW$584       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$49)
    3609                      .dwattr $C$DW$584, DW_AT_name("parkHandle")
    3610                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_parkHandle")
    3611                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3612                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3613              $C$DW$585       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$50)
    3615                      .dwattr $C$DW$585, DW_AT_name("park")
    3616                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_park")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   72

    3617                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3618                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3619              $C$DW$586       .dwtag  DW_TAG_member
    3620                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$52)
    3621                      .dwattr $C$DW$586, DW_AT_name("pidHandle_Id")
    3622                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_pidHandle_Id")
    3623                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3624                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3625              $C$DW$587       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$53)
    3627                      .dwattr $C$DW$587, DW_AT_name("pid_Id")
    3628                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_pid_Id")
    3629                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3630                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3631              $C$DW$588       .dwtag  DW_TAG_member
    3632                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$52)
    3633                      .dwattr $C$DW$588, DW_AT_name("pidHandle_Iq")
    3634                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3635                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3636                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3637              $C$DW$589       .dwtag  DW_TAG_member
    3638                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$53)
    3639                      .dwattr $C$DW$589, DW_AT_name("pid_Iq")
    3640                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_pid_Iq")
    3641                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3642                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3643              $C$DW$590       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$52)
    3645                      .dwattr $C$DW$590, DW_AT_name("pidHandle_spd")
    3646                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_pidHandle_spd")
    3647                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3648                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3649              $C$DW$591       .dwtag  DW_TAG_member
    3650                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$53)
    3651                      .dwattr $C$DW$591, DW_AT_name("pid_spd")
    3652                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_pid_spd")
    3653                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3654                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3655              $C$DW$592       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$55)
    3657                      .dwattr $C$DW$592, DW_AT_name("iparkHandle")
    3658                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_iparkHandle")
    3659                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3660                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3661              $C$DW$593       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$56)
    3663                      .dwattr $C$DW$593, DW_AT_name("ipark")
    3664                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ipark")
    3665                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3666                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$594       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$58)
    3669                      .dwattr $C$DW$594, DW_AT_name("svgenHandle")
    3670                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_svgenHandle")
    3671                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   73

    3672                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3673              $C$DW$595       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$59)
    3675                      .dwattr $C$DW$595, DW_AT_name("svgen")
    3676                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_svgen")
    3677                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3678                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3679              $C$DW$596       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$61)
    3681                      .dwattr $C$DW$596, DW_AT_name("trajHandle_Id")
    3682                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_trajHandle_Id")
    3683                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3684                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3685              $C$DW$597       .dwtag  DW_TAG_member
    3686                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$62)
    3687                      .dwattr $C$DW$597, DW_AT_name("traj_Id")
    3688                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_traj_Id")
    3689                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3690                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3691              $C$DW$598       .dwtag  DW_TAG_member
    3692                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$61)
    3693                      .dwattr $C$DW$598, DW_AT_name("trajHandle_spd")
    3694                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_trajHandle_spd")
    3695                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3696                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3697              $C$DW$599       .dwtag  DW_TAG_member
    3698                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$62)
    3699                      .dwattr $C$DW$599, DW_AT_name("traj_spd")
    3700                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_traj_spd")
    3701                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3702                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3703              $C$DW$600       .dwtag  DW_TAG_member
    3704                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$61)
    3705                      .dwattr $C$DW$600, DW_AT_name("trajHandle_spdMax")
    3706                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3707                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3708                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3709              $C$DW$601       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$62)
    3711                      .dwattr $C$DW$601, DW_AT_name("traj_spdMax")
    3712                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_traj_spdMax")
    3713                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3714                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3715              $C$DW$602       .dwtag  DW_TAG_member
    3716                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$63)
    3717                      .dwattr $C$DW$602, DW_AT_name("motorParams")
    3718                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_motorParams")
    3719                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3720                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3721              $C$DW$603       .dwtag  DW_TAG_member
    3722                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$66)
    3723                      .dwattr $C$DW$603, DW_AT_name("waitTimes")
    3724                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_waitTimes")
    3725                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3726                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   74

    3727              $C$DW$604       .dwtag  DW_TAG_member
    3728                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$65)
    3729                      .dwattr $C$DW$604, DW_AT_name("counter_state")
    3730                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_counter_state")
    3731                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3732                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3733              $C$DW$605       .dwtag  DW_TAG_member
    3734                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$67)
    3735                      .dwattr $C$DW$605, DW_AT_name("numIsrTicksPerCtrlTick")
    3736                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3737                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3738                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3739              $C$DW$606       .dwtag  DW_TAG_member
    3740                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$67)
    3741                      .dwattr $C$DW$606, DW_AT_name("numCtrlTicksPerCurrentTick")
    3742                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3743                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3744                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3745              $C$DW$607       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$67)
    3747                      .dwattr $C$DW$607, DW_AT_name("numCtrlTicksPerSpeedTick")
    3748                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3749                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3750                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$608       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$67)
    3753                      .dwattr $C$DW$608, DW_AT_name("numCtrlTicksPerTrajTick")
    3754                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3755                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3756                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$609       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$65)
    3759                      .dwattr $C$DW$609, DW_AT_name("ctrlFreq_Hz")
    3760                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3761                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3762                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3763              $C$DW$610       .dwtag  DW_TAG_member
    3764                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$65)
    3765                      .dwattr $C$DW$610, DW_AT_name("trajFreq_Hz")
    3766                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3767                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3768                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3769              $C$DW$611       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$32)
    3771                      .dwattr $C$DW$611, DW_AT_name("trajPeriod_sec")
    3772                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3773                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3774                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3775              $C$DW$612       .dwtag  DW_TAG_member
    3776                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$68)
    3777                      .dwattr $C$DW$612, DW_AT_name("ctrlPeriod_sec")
    3778                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3779                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3780                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3781              $C$DW$613       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   75

    3782                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$32)
    3783                      .dwattr $C$DW$613, DW_AT_name("maxVsMag_pu")
    3784                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3785                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3786                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3787              $C$DW$614       .dwtag  DW_TAG_member
    3788                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$69)
    3789                      .dwattr $C$DW$614, DW_AT_name("Iab_in")
    3790                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_Iab_in")
    3791                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3792                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3793              $C$DW$615       .dwtag  DW_TAG_member
    3794                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$69)
    3795                      .dwattr $C$DW$615, DW_AT_name("Iab_filt")
    3796                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_Iab_filt")
    3797                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3798                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$616       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$69)
    3801                      .dwattr $C$DW$616, DW_AT_name("Idq_in")
    3802                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_Idq_in")
    3803                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3804                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    3805              $C$DW$617       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$69)
    3807                      .dwattr $C$DW$617, DW_AT_name("Vab_in")
    3808                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_Vab_in")
    3809                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3810                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    3811              $C$DW$618       .dwtag  DW_TAG_member
    3812                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$32)
    3813                      .dwattr $C$DW$618, DW_AT_name("spd_out")
    3814                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_spd_out")
    3815                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3816                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$619       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$69)
    3819                      .dwattr $C$DW$619, DW_AT_name("Vab_out")
    3820                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_Vab_out")
    3821                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3822                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    3823              $C$DW$620       .dwtag  DW_TAG_member
    3824                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$69)
    3825                      .dwattr $C$DW$620, DW_AT_name("Vdq_out")
    3826                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_Vdq_out")
    3827                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3828                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    3829              $C$DW$621       .dwtag  DW_TAG_member
    3830                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$68)
    3831                      .dwattr $C$DW$621, DW_AT_name("Rhf")
    3832                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_Rhf")
    3833                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3834                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    3835              $C$DW$622       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   76

    3837                      .dwattr $C$DW$622, DW_AT_name("Lhf")
    3838                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_Lhf")
    3839                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3840                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$623       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$68)
    3843                      .dwattr $C$DW$623, DW_AT_name("RoverL")
    3844                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_RoverL")
    3845                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3846                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    3847              $C$DW$624       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$32)
    3849                      .dwattr $C$DW$624, DW_AT_name("Kp_Id")
    3850                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_Kp_Id")
    3851                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3852                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$625       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$32)
    3855                      .dwattr $C$DW$625, DW_AT_name("Kp_Iq")
    3856                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_Kp_Iq")
    3857                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3858                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    3859              $C$DW$626       .dwtag  DW_TAG_member
    3860                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$32)
    3861                      .dwattr $C$DW$626, DW_AT_name("Kp_spd")
    3862                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_Kp_spd")
    3863                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3864                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    3865              $C$DW$627       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$32)
    3867                      .dwattr $C$DW$627, DW_AT_name("Ki_Id")
    3868                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_Ki_Id")
    3869                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3870                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    3871              $C$DW$628       .dwtag  DW_TAG_member
    3872                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$32)
    3873                      .dwattr $C$DW$628, DW_AT_name("Ki_Iq")
    3874                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_Ki_Iq")
    3875                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3876                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    3877              $C$DW$629       .dwtag  DW_TAG_member
    3878                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$32)
    3879                      .dwattr $C$DW$629, DW_AT_name("Ki_spd")
    3880                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Ki_spd")
    3881                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3882                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$630       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$32)
    3885                      .dwattr $C$DW$630, DW_AT_name("Kd_Id")
    3886                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Kd_Id")
    3887                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3888                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    3889              $C$DW$631       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$32)
    3891                      .dwattr $C$DW$631, DW_AT_name("Kd_Iq")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   77

    3892                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Kd_Iq")
    3893                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3894                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    3895              $C$DW$632       .dwtag  DW_TAG_member
    3896                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$32)
    3897                      .dwattr $C$DW$632, DW_AT_name("Kd_spd")
    3898                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Kd_spd")
    3899                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3900                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    3901              $C$DW$633       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$32)
    3903                      .dwattr $C$DW$633, DW_AT_name("Ui_Id")
    3904                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_Ui_Id")
    3905                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3906                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$634       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$32)
    3909                      .dwattr $C$DW$634, DW_AT_name("Ui_Iq")
    3910                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Ui_Iq")
    3911                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3912                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$635       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$32)
    3915                      .dwattr $C$DW$635, DW_AT_name("Ui_spd")
    3916                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Ui_spd")
    3917                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3918                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    3919              $C$DW$636       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$69)
    3921                      .dwattr $C$DW$636, DW_AT_name("Idq_ref")
    3922                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Idq_ref")
    3923                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3924                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$637       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$32)
    3927                      .dwattr $C$DW$637, DW_AT_name("IdRated")
    3928                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_IdRated")
    3929                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3930                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$638       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$32)
    3933                      .dwattr $C$DW$638, DW_AT_name("spd_ref")
    3934                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_spd_ref")
    3935                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3936                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$639       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$32)
    3939                      .dwattr $C$DW$639, DW_AT_name("spd_max")
    3940                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_spd_max")
    3941                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3942                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    3943              $C$DW$640       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$67)
    3945                      .dwattr $C$DW$640, DW_AT_name("counter_current")
    3946                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_counter_current")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   78

    3947                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3948                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$641       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$67)
    3951                      .dwattr $C$DW$641, DW_AT_name("counter_isr")
    3952                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_counter_isr")
    3953                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3954                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$642       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$67)
    3957                      .dwattr $C$DW$642, DW_AT_name("counter_speed")
    3958                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_counter_speed")
    3959                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3960                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    3961              $C$DW$643       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$67)
    3963                      .dwattr $C$DW$643, DW_AT_name("counter_traj")
    3964                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_counter_traj")
    3965                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3966                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$644       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$70)
    3969                      .dwattr $C$DW$644, DW_AT_name("flag_enableCtrl")
    3970                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3971                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3972                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$645       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$70)
    3975                      .dwattr $C$DW$645, DW_AT_name("flag_enableDcBusComp")
    3976                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3977                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3978                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$646       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$70)
    3981                      .dwattr $C$DW$646, DW_AT_name("flag_enablePowerWarp")
    3982                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3983                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3984                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$647       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$70)
    3987                      .dwattr $C$DW$647, DW_AT_name("flag_enableOffset")
    3988                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_flag_enableOffset")
    3989                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3990                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$648       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$70)
    3993                      .dwattr $C$DW$648, DW_AT_name("flag_enableSpeedCtrl")
    3994                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3995                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3996                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$649       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$70)
    3999                      .dwattr $C$DW$649, DW_AT_name("flag_enableUserMotorParams")
    4000                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4001                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   79

    4002                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$650       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$69)
    4005                      .dwattr $C$DW$650, DW_AT_name("Idq_offset_pu")
    4006                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4007                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4008                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$651       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$69)
    4011                      .dwattr $C$DW$651, DW_AT_name("Vdq_offset_pu")
    4012                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4013                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4014                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$652       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$32)
    4017                      .dwattr $C$DW$652, DW_AT_name("angle_pu")
    4018                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_angle_pu")
    4019                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4020                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$653       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$32)
    4023                      .dwattr $C$DW$653, DW_AT_name("speed_ref_pu")
    4024                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_speed_ref_pu")
    4025                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4026                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$654       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$32)
    4029                      .dwattr $C$DW$654, DW_AT_name("speed_fb_pu")
    4030                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_speed_fb_pu")
    4031                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4032                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$655       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$32)
    4035                      .dwattr $C$DW$655, DW_AT_name("speed_outMax_pu")
    4036                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4037                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4038                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$656       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$70)
    4041                      .dwattr $C$DW$656, DW_AT_name("flag_enableCurrentCtrl")
    4042                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4043                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4044                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4045                      .dwendtag $C$DW$T$71
    4046              
    4047              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4048                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$71)
    4049                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4050              $C$DW$T$228     .dwtag  DW_TAG_pointer_type
    4051                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    4052                      .dwattr $C$DW$T$228, DW_AT_address_class(0x20)
    4053              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    4054                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$71)
    4055                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    4056              $C$DW$T$200     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   80

    4057                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    4058                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    4059              $C$DW$657       .dwtag  DW_TAG_TI_far_type
    4060                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$200)
    4061              $C$DW$T$229     .dwtag  DW_TAG_const_type
    4062                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$657)
    4063              
    4064              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4065                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4066                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4067              $C$DW$658       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$23)
    4069                      .dwattr $C$DW$658, DW_AT_name("rsvd")
    4070                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd")
    4071                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4072                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$659       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$73)
    4075                      .dwattr $C$DW$659, DW_AT_name("targetProc")
    4076                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_targetProc")
    4077                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4078                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4079              $C$DW$660       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    4081                      .dwattr $C$DW$660, DW_AT_name("major")
    4082                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_major")
    4083                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4084                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$661       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    4087                      .dwattr $C$DW$661, DW_AT_name("minor")
    4088                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_minor")
    4089                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4090                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4091                      .dwendtag $C$DW$T$74
    4092              
    4093              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4094                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    4095                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4096              $C$DW$T$237     .dwtag  DW_TAG_pointer_type
    4097                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$38)
    4098                      .dwattr $C$DW$T$237, DW_AT_address_class(0x20)
    4099              
    4100              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4101                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8301_Obj_")
    4102                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    4103              $C$DW$662       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$76)
    4105                      .dwattr $C$DW$662, DW_AT_name("spiHandle")
    4106                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_spiHandle")
    4107                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4108                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$663       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$78)
    4111                      .dwattr $C$DW$663, DW_AT_name("gpioHandle")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   81

    4112                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_gpioHandle")
    4113                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4114                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$664       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$80)
    4117                      .dwattr $C$DW$664, DW_AT_name("gpioNumber")
    4118                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_gpioNumber")
    4119                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4120                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$665       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$70)
    4123                      .dwattr $C$DW$665, DW_AT_name("RxTimeOut")
    4124                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_RxTimeOut")
    4125                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4126                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$666       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$70)
    4129                      .dwattr $C$DW$666, DW_AT_name("enableTimeOut")
    4130                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_enableTimeOut")
    4131                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4132                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4133                      .dwendtag $C$DW$T$81
    4134              
    4135              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    4136                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$81)
    4137                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    4138              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    4139                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$81)
    4140                      .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    4141              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    4142                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    4143                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4144              
    4145              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    4146                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4147                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x05)
    4148              $C$DW$667       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$83)
    4150                      .dwattr $C$DW$667, DW_AT_name("DRV8301_CURRENT")
    4151                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4152                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4153                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$668       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$85)
    4156                      .dwattr $C$DW$668, DW_AT_name("DRV8301_RESET")
    4157                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4158                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4159                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$669       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$87)
    4162                      .dwattr $C$DW$669, DW_AT_name("PWM_MODE")
    4163                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_PWM_MODE")
    4164                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4165                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$670       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   82

    4167                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$89)
    4168                      .dwattr $C$DW$670, DW_AT_name("OC_MODE")
    4169                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_OC_MODE")
    4170                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4171                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$671       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$91)
    4174                      .dwattr $C$DW$671, DW_AT_name("OC_ADJ_SET")
    4175                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4176                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4177                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4178                      .dwendtag $C$DW$T$92
    4179              
    4180              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4181                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$92)
    4182                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    4183              
    4184              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    4185                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4186                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x04)
    4187              $C$DW$672       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$94)
    4189                      .dwattr $C$DW$672, DW_AT_name("OCTW_SET")
    4190                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_OCTW_SET")
    4191                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4192                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4193              $C$DW$673       .dwtag  DW_TAG_member
    4194                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$96)
    4195                      .dwattr $C$DW$673, DW_AT_name("GAIN")
    4196                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_GAIN")
    4197                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4198                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4199              $C$DW$674       .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$98)
    4201                      .dwattr $C$DW$674, DW_AT_name("DC_CAL_CH1p2")
    4202                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4203                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4204                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$675       .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$100)
    4207                      .dwattr $C$DW$675, DW_AT_name("OC_TOFF")
    4208                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_OC_TOFF")
    4209                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4210                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4211                      .dwendtag $C$DW$T$101
    4212              
    4213              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4214                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$101)
    4215                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4216              
    4217              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    4218                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4219                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x0b)
    4220              $C$DW$676       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   83

    4222                      .dwattr $C$DW$676, DW_AT_name("FAULT")
    4223                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_FAULT")
    4224                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4225                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$677       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$70)
    4228                      .dwattr $C$DW$677, DW_AT_name("GVDD_UV")
    4229                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_GVDD_UV")
    4230                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4231                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$678       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$70)
    4234                      .dwattr $C$DW$678, DW_AT_name("PVDD_UV")
    4235                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_PVDD_UV")
    4236                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4237                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$679       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$70)
    4240                      .dwattr $C$DW$679, DW_AT_name("OTSD")
    4241                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_OTSD")
    4242                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4243                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4244              $C$DW$680       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$70)
    4246                      .dwattr $C$DW$680, DW_AT_name("OTW")
    4247                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_OTW")
    4248                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4249                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$681       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    4252                      .dwattr $C$DW$681, DW_AT_name("FETHA_OC")
    4253                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_FETHA_OC")
    4254                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4255                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4256              $C$DW$682       .dwtag  DW_TAG_member
    4257                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$70)
    4258                      .dwattr $C$DW$682, DW_AT_name("FETLA_OC")
    4259                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_FETLA_OC")
    4260                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4261                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4262              $C$DW$683       .dwtag  DW_TAG_member
    4263                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$70)
    4264                      .dwattr $C$DW$683, DW_AT_name("FETHB_OC")
    4265                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_FETHB_OC")
    4266                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4267                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4268              $C$DW$684       .dwtag  DW_TAG_member
    4269                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$70)
    4270                      .dwattr $C$DW$684, DW_AT_name("FETLB_OC")
    4271                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_FETLB_OC")
    4272                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4273                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4274              $C$DW$685       .dwtag  DW_TAG_member
    4275                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$70)
    4276                      .dwattr $C$DW$685, DW_AT_name("FETHC_OC")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   84

    4277                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_FETHC_OC")
    4278                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4279                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4280              $C$DW$686       .dwtag  DW_TAG_member
    4281                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$70)
    4282                      .dwattr $C$DW$686, DW_AT_name("FETLC_OC")
    4283                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_FETLC_OC")
    4284                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4285                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4286                      .dwendtag $C$DW$T$102
    4287              
    4288              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4289                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$102)
    4290                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4291              
    4292              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    4293                      .dwattr $C$DW$T$103, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4294                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    4295              $C$DW$687       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$70)
    4297                      .dwattr $C$DW$687, DW_AT_name("GVDD_OV")
    4298                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_GVDD_OV")
    4299                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4300                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4301              $C$DW$688       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$23)
    4303                      .dwattr $C$DW$688, DW_AT_name("DeviceID")
    4304                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_DeviceID")
    4305                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4306                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4307                      .dwendtag $C$DW$T$103
    4308              
    4309              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4310                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$103)
    4311                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4312              
    4313              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    4314                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4315                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x18)
    4316              $C$DW$689       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$104)
    4318                      .dwattr $C$DW$689, DW_AT_name("Stat_Reg_1")
    4319                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4320                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4321                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$690       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$105)
    4324                      .dwattr $C$DW$690, DW_AT_name("Stat_Reg_2")
    4325                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4326                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4327                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$691       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$106)
    4330                      .dwattr $C$DW$691, DW_AT_name("Ctrl_Reg_1")
    4331                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 19:25:36 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3412010                            PAGE   85

    4332                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4333                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4334              $C$DW$692       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$107)
    4336                      .dwattr $C$DW$692, DW_AT_name("Ctrl_Reg_2")
    4337                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4338                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4339                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4340              $C$DW$693       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$70)
    4342                      .dwattr $C$DW$693, DW_AT_name("SndCmd")
    4343                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_SndCmd")
    4344                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4345                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4346              $C$DW$694       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$70)
    4348                      .dwattr $C$DW$694, DW_AT_name("RcvCmd")
    4349                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_RcvCmd")
    4350                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4351                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4352                      .dwendtag $C$DW$T$108
    4353              
    4354              $C$DW$T$240     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    4355                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$108)
    4356                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    4357              $C$DW$T$241     .dwtag  DW_TAG_pointer_type
    4358                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    4359                      .dwattr $C$DW$T$241, DW_AT_address_class(0x20)
    4360              
    4361              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4362                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4363                      .dwattr $C$DW$T$19, DW_AT_declaration
    4364                      .dwendtag $C$DW$T$19
    4365              
    4366              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4367                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$19)
    4368                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4369              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    4370                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
