TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Thu Jun 09 16:34:51 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_reset")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_reset")

    9271                      .dwattr $C$DW$1663, DW_AT_type(*$C$DW$T$310)
    9272              $C$DW$T$311     .dwtag  DW_TAG_const_type
    9273                      .dwattr $C$DW$T$311, DW_AT_type(*$C$DW$1663)
    9274              
    9275              $C$DW$T$312     .dwtag  DW_TAG_enumeration_type
    9276                      .dwattr $C$DW$T$312, DW_AT_byte_size(0x01)
    9277              $C$DW$1664      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9278              $C$DW$1665      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
    9279                      .dwendtag $C$DW$T$312
    9280              
    9281              $C$DW$T$313     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9282                      .dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$312)
    9283                      .dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
    9284              $C$DW$1666      .dwtag  DW_TAG_TI_far_type
    9285                      .dwattr $C$DW$1666, DW_AT_type(*$C$DW$T$313)
    9286              $C$DW$T$314     .dwtag  DW_TAG_const_type
    9287                      .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$1666)
    9288              
    9289              $C$DW$T$315     .dwtag  DW_TAG_enumeration_type
    9290                      .dwattr $C$DW$T$315, DW_AT_byte_size(0x01)
    9291              $C$DW$1667      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9292              $C$DW$1668      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9293                      .dwendtag $C$DW$T$315
    9294              
    9295              $C$DW$T$316     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9296                      .dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$315)
    9297                      .dwattr $C$DW$T$316, DW_AT_language(DW_LANG_C)
    9298              $C$DW$1669      .dwtag  DW_TAG_TI_far_type
    9299                      .dwattr $C$DW$1669, DW_AT_type(*$C$DW$T$316)
    9300              $C$DW$T$317     .dwtag  DW_TAG_const_type
    9301                      .dwattr $C$DW$T$317, DW_AT_type(*$C$DW$1669)
    9302              
    9303              $C$DW$T$318     .dwtag  DW_TAG_enumeration_type
    9304                      .dwattr $C$DW$T$318, DW_AT_byte_size(0x01)
    9305              $C$DW$1670      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9306              $C$DW$1671      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9307              $C$DW$1672      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9308                      .dwendtag $C$DW$T$318
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  179

    9309              
    9310              $C$DW$T$319     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9311                      .dwattr $C$DW$T$319, DW_AT_type(*$C$DW$T$318)
    9312                      .dwattr $C$DW$T$319, DW_AT_language(DW_LANG_C)
    9313              $C$DW$1673      .dwtag  DW_TAG_TI_far_type
    9314                      .dwattr $C$DW$1673, DW_AT_type(*$C$DW$T$319)
    9315              $C$DW$T$320     .dwtag  DW_TAG_const_type
    9316                      .dwattr $C$DW$T$320, DW_AT_type(*$C$DW$1673)
    9317              
    9318              $C$DW$T$321     .dwtag  DW_TAG_enumeration_type
    9319                      .dwattr $C$DW$T$321, DW_AT_byte_size(0x01)
    9320              $C$DW$1674      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    9321              $C$DW$1675      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    9322              $C$DW$1676      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    9323                      .dwendtag $C$DW$T$321
    9324              
    9325              $C$DW$T$322     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    9326                      .dwattr $C$DW$T$322, DW_AT_type(*$C$DW$T$321)
    9327                      .dwattr $C$DW$T$322, DW_AT_language(DW_LANG_C)
    9328              $C$DW$1677      .dwtag  DW_TAG_TI_far_type
    9329                      .dwattr $C$DW$1677, DW_AT_type(*$C$DW$T$322)
    9330              $C$DW$T$323     .dwtag  DW_TAG_const_type
    9331                      .dwattr $C$DW$T$323, DW_AT_type(*$C$DW$1677)
    9332              
    9333              $C$DW$T$324     .dwtag  DW_TAG_enumeration_type
    9334                      .dwattr $C$DW$T$324, DW_AT_byte_size(0x01)
    9335              $C$DW$1678      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9336              $C$DW$1679      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9337                      .dwendtag $C$DW$T$324
    9338              
    9339              $C$DW$T$325     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9340                      .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$324)
    9341                      .dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
    9342              
    9343              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9344                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    9345                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    9346              $C$DW$1680      .dwtag  DW_TAG_member
    9347                      .dwattr $C$DW$1680, DW_AT_type(*$C$DW$T$23)
    9348                      .dwattr $C$DW$1680, DW_AT_name("ADCRESULT")
    9349                      .dwattr $C$DW$1680, DW_AT_TI_symbol_name("_ADCRESULT")
    9350                      .dwattr $C$DW$1680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9351                      .dwattr $C$DW$1680, DW_AT_accessibility(DW_ACCESS_public)
    9352              $C$DW$1681      .dwtag  DW_TAG_member
    9353                      .dwattr $C$DW$1681, DW_AT_type(*$C$DW$T$24)
    9354                      .dwattr $C$DW$1681, DW_AT_name("resvd_1")
    9355                      .dwattr $C$DW$1681, DW_AT_TI_symbol_name("_resvd_1")
    9356                      .dwattr $C$DW$1681, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9357                      .dwattr $C$DW$1681, DW_AT_accessibility(DW_ACCESS_public)
    9358              $C$DW$1682      .dwtag  DW_TAG_member
    9359                      .dwattr $C$DW$1682, DW_AT_type(*$C$DW$T$22)
    9360                      .dwattr $C$DW$1682, DW_AT_name("ADCCTL1")
    9361                      .dwattr $C$DW$1682, DW_AT_TI_symbol_name("_ADCCTL1")
    9362                      .dwattr $C$DW$1682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9363                      .dwattr $C$DW$1682, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  180

    9364              $C$DW$1683      .dwtag  DW_TAG_member
    9365                      .dwattr $C$DW$1683, DW_AT_type(*$C$DW$T$22)
    9366                      .dwattr $C$DW$1683, DW_AT_name("ADCCTL2")
    9367                      .dwattr $C$DW$1683, DW_AT_TI_symbol_name("_ADCCTL2")
    9368                      .dwattr $C$DW$1683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9369                      .dwattr $C$DW$1683, DW_AT_accessibility(DW_ACCESS_public)
    9370              $C$DW$1684      .dwtag  DW_TAG_member
    9371                      .dwattr $C$DW$1684, DW_AT_type(*$C$DW$T$25)
    9372                      .dwattr $C$DW$1684, DW_AT_name("rsvd_2")
    9373                      .dwattr $C$DW$1684, DW_AT_TI_symbol_name("_rsvd_2")
    9374                      .dwattr $C$DW$1684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9375                      .dwattr $C$DW$1684, DW_AT_accessibility(DW_ACCESS_public)
    9376              $C$DW$1685      .dwtag  DW_TAG_member
    9377                      .dwattr $C$DW$1685, DW_AT_type(*$C$DW$T$22)
    9378                      .dwattr $C$DW$1685, DW_AT_name("ADCINTFLG")
    9379                      .dwattr $C$DW$1685, DW_AT_TI_symbol_name("_ADCINTFLG")
    9380                      .dwattr $C$DW$1685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9381                      .dwattr $C$DW$1685, DW_AT_accessibility(DW_ACCESS_public)
    9382              $C$DW$1686      .dwtag  DW_TAG_member
    9383                      .dwattr $C$DW$1686, DW_AT_type(*$C$DW$T$22)
    9384                      .dwattr $C$DW$1686, DW_AT_name("ADCINTFLGCLR")
    9385                      .dwattr $C$DW$1686, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9386                      .dwattr $C$DW$1686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9387                      .dwattr $C$DW$1686, DW_AT_accessibility(DW_ACCESS_public)
    9388              $C$DW$1687      .dwtag  DW_TAG_member
    9389                      .dwattr $C$DW$1687, DW_AT_type(*$C$DW$T$22)
    9390                      .dwattr $C$DW$1687, DW_AT_name("ADCINTOVF")
    9391                      .dwattr $C$DW$1687, DW_AT_TI_symbol_name("_ADCINTOVF")
    9392                      .dwattr $C$DW$1687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9393                      .dwattr $C$DW$1687, DW_AT_accessibility(DW_ACCESS_public)
    9394              $C$DW$1688      .dwtag  DW_TAG_member
    9395                      .dwattr $C$DW$1688, DW_AT_type(*$C$DW$T$22)
    9396                      .dwattr $C$DW$1688, DW_AT_name("ADCINTOVFCLR")
    9397                      .dwattr $C$DW$1688, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9398                      .dwattr $C$DW$1688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9399                      .dwattr $C$DW$1688, DW_AT_accessibility(DW_ACCESS_public)
    9400              $C$DW$1689      .dwtag  DW_TAG_member
    9401                      .dwattr $C$DW$1689, DW_AT_type(*$C$DW$T$26)
    9402                      .dwattr $C$DW$1689, DW_AT_name("INTSELxNy")
    9403                      .dwattr $C$DW$1689, DW_AT_TI_symbol_name("_INTSELxNy")
    9404                      .dwattr $C$DW$1689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9405                      .dwattr $C$DW$1689, DW_AT_accessibility(DW_ACCESS_public)
    9406              $C$DW$1690      .dwtag  DW_TAG_member
    9407                      .dwattr $C$DW$1690, DW_AT_type(*$C$DW$T$27)
    9408                      .dwattr $C$DW$1690, DW_AT_name("rsvd_3")
    9409                      .dwattr $C$DW$1690, DW_AT_TI_symbol_name("_rsvd_3")
    9410                      .dwattr $C$DW$1690, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9411                      .dwattr $C$DW$1690, DW_AT_accessibility(DW_ACCESS_public)
    9412              $C$DW$1691      .dwtag  DW_TAG_member
    9413                      .dwattr $C$DW$1691, DW_AT_type(*$C$DW$T$22)
    9414                      .dwattr $C$DW$1691, DW_AT_name("SOCPRICTRL")
    9415                      .dwattr $C$DW$1691, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9416                      .dwattr $C$DW$1691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9417                      .dwattr $C$DW$1691, DW_AT_accessibility(DW_ACCESS_public)
    9418              $C$DW$1692      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  181

    9419                      .dwattr $C$DW$1692, DW_AT_type(*$C$DW$T$22)
    9420                      .dwattr $C$DW$1692, DW_AT_name("rsvd_4")
    9421                      .dwattr $C$DW$1692, DW_AT_TI_symbol_name("_rsvd_4")
    9422                      .dwattr $C$DW$1692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9423                      .dwattr $C$DW$1692, DW_AT_accessibility(DW_ACCESS_public)
    9424              $C$DW$1693      .dwtag  DW_TAG_member
    9425                      .dwattr $C$DW$1693, DW_AT_type(*$C$DW$T$22)
    9426                      .dwattr $C$DW$1693, DW_AT_name("ADCSAMPLEMODE")
    9427                      .dwattr $C$DW$1693, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9428                      .dwattr $C$DW$1693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9429                      .dwattr $C$DW$1693, DW_AT_accessibility(DW_ACCESS_public)
    9430              $C$DW$1694      .dwtag  DW_TAG_member
    9431                      .dwattr $C$DW$1694, DW_AT_type(*$C$DW$T$22)
    9432                      .dwattr $C$DW$1694, DW_AT_name("rsvd_5")
    9433                      .dwattr $C$DW$1694, DW_AT_TI_symbol_name("_rsvd_5")
    9434                      .dwattr $C$DW$1694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9435                      .dwattr $C$DW$1694, DW_AT_accessibility(DW_ACCESS_public)
    9436              $C$DW$1695      .dwtag  DW_TAG_member
    9437                      .dwattr $C$DW$1695, DW_AT_type(*$C$DW$T$22)
    9438                      .dwattr $C$DW$1695, DW_AT_name("ADCINTSOCSEL1")
    9439                      .dwattr $C$DW$1695, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9440                      .dwattr $C$DW$1695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9441                      .dwattr $C$DW$1695, DW_AT_accessibility(DW_ACCESS_public)
    9442              $C$DW$1696      .dwtag  DW_TAG_member
    9443                      .dwattr $C$DW$1696, DW_AT_type(*$C$DW$T$22)
    9444                      .dwattr $C$DW$1696, DW_AT_name("ADCINTSOCSEL2")
    9445                      .dwattr $C$DW$1696, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9446                      .dwattr $C$DW$1696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9447                      .dwattr $C$DW$1696, DW_AT_accessibility(DW_ACCESS_public)
    9448              $C$DW$1697      .dwtag  DW_TAG_member
    9449                      .dwattr $C$DW$1697, DW_AT_type(*$C$DW$T$25)
    9450                      .dwattr $C$DW$1697, DW_AT_name("rsvd_6")
    9451                      .dwattr $C$DW$1697, DW_AT_TI_symbol_name("_rsvd_6")
    9452                      .dwattr $C$DW$1697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9453                      .dwattr $C$DW$1697, DW_AT_accessibility(DW_ACCESS_public)
    9454              $C$DW$1698      .dwtag  DW_TAG_member
    9455                      .dwattr $C$DW$1698, DW_AT_type(*$C$DW$T$22)
    9456                      .dwattr $C$DW$1698, DW_AT_name("ADCSOCFLG1")
    9457                      .dwattr $C$DW$1698, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9458                      .dwattr $C$DW$1698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9459                      .dwattr $C$DW$1698, DW_AT_accessibility(DW_ACCESS_public)
    9460              $C$DW$1699      .dwtag  DW_TAG_member
    9461                      .dwattr $C$DW$1699, DW_AT_type(*$C$DW$T$22)
    9462                      .dwattr $C$DW$1699, DW_AT_name("rsvd_7")
    9463                      .dwattr $C$DW$1699, DW_AT_TI_symbol_name("_rsvd_7")
    9464                      .dwattr $C$DW$1699, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9465                      .dwattr $C$DW$1699, DW_AT_accessibility(DW_ACCESS_public)
    9466              $C$DW$1700      .dwtag  DW_TAG_member
    9467                      .dwattr $C$DW$1700, DW_AT_type(*$C$DW$T$22)
    9468                      .dwattr $C$DW$1700, DW_AT_name("ADCSOCFRC1")
    9469                      .dwattr $C$DW$1700, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9470                      .dwattr $C$DW$1700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9471                      .dwattr $C$DW$1700, DW_AT_accessibility(DW_ACCESS_public)
    9472              $C$DW$1701      .dwtag  DW_TAG_member
    9473                      .dwattr $C$DW$1701, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  182

    9474                      .dwattr $C$DW$1701, DW_AT_name("rsvd_8")
    9475                      .dwattr $C$DW$1701, DW_AT_TI_symbol_name("_rsvd_8")
    9476                      .dwattr $C$DW$1701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9477                      .dwattr $C$DW$1701, DW_AT_accessibility(DW_ACCESS_public)
    9478              $C$DW$1702      .dwtag  DW_TAG_member
    9479                      .dwattr $C$DW$1702, DW_AT_type(*$C$DW$T$22)
    9480                      .dwattr $C$DW$1702, DW_AT_name("ADCSOCOVF1")
    9481                      .dwattr $C$DW$1702, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9482                      .dwattr $C$DW$1702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9483                      .dwattr $C$DW$1702, DW_AT_accessibility(DW_ACCESS_public)
    9484              $C$DW$1703      .dwtag  DW_TAG_member
    9485                      .dwattr $C$DW$1703, DW_AT_type(*$C$DW$T$22)
    9486                      .dwattr $C$DW$1703, DW_AT_name("rsvd_9")
    9487                      .dwattr $C$DW$1703, DW_AT_TI_symbol_name("_rsvd_9")
    9488                      .dwattr $C$DW$1703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9489                      .dwattr $C$DW$1703, DW_AT_accessibility(DW_ACCESS_public)
    9490              $C$DW$1704      .dwtag  DW_TAG_member
    9491                      .dwattr $C$DW$1704, DW_AT_type(*$C$DW$T$22)
    9492                      .dwattr $C$DW$1704, DW_AT_name("ADCSOCOVFCLR1")
    9493                      .dwattr $C$DW$1704, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9494                      .dwattr $C$DW$1704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9495                      .dwattr $C$DW$1704, DW_AT_accessibility(DW_ACCESS_public)
    9496              $C$DW$1705      .dwtag  DW_TAG_member
    9497                      .dwattr $C$DW$1705, DW_AT_type(*$C$DW$T$22)
    9498                      .dwattr $C$DW$1705, DW_AT_name("rsvd_10")
    9499                      .dwattr $C$DW$1705, DW_AT_TI_symbol_name("_rsvd_10")
    9500                      .dwattr $C$DW$1705, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9501                      .dwattr $C$DW$1705, DW_AT_accessibility(DW_ACCESS_public)
    9502              $C$DW$1706      .dwtag  DW_TAG_member
    9503                      .dwattr $C$DW$1706, DW_AT_type(*$C$DW$T$23)
    9504                      .dwattr $C$DW$1706, DW_AT_name("ADCSOCxCTL")
    9505                      .dwattr $C$DW$1706, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9506                      .dwattr $C$DW$1706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9507                      .dwattr $C$DW$1706, DW_AT_accessibility(DW_ACCESS_public)
    9508              $C$DW$1707      .dwtag  DW_TAG_member
    9509                      .dwattr $C$DW$1707, DW_AT_type(*$C$DW$T$23)
    9510                      .dwattr $C$DW$1707, DW_AT_name("rsvd_11")
    9511                      .dwattr $C$DW$1707, DW_AT_TI_symbol_name("_rsvd_11")
    9512                      .dwattr $C$DW$1707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9513                      .dwattr $C$DW$1707, DW_AT_accessibility(DW_ACCESS_public)
    9514              $C$DW$1708      .dwtag  DW_TAG_member
    9515                      .dwattr $C$DW$1708, DW_AT_type(*$C$DW$T$22)
    9516                      .dwattr $C$DW$1708, DW_AT_name("ADCREFTRIM")
    9517                      .dwattr $C$DW$1708, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9518                      .dwattr $C$DW$1708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9519                      .dwattr $C$DW$1708, DW_AT_accessibility(DW_ACCESS_public)
    9520              $C$DW$1709      .dwtag  DW_TAG_member
    9521                      .dwattr $C$DW$1709, DW_AT_type(*$C$DW$T$22)
    9522                      .dwattr $C$DW$1709, DW_AT_name("ADCOFFTRIM")
    9523                      .dwattr $C$DW$1709, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9524                      .dwattr $C$DW$1709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9525                      .dwattr $C$DW$1709, DW_AT_accessibility(DW_ACCESS_public)
    9526              $C$DW$1710      .dwtag  DW_TAG_member
    9527                      .dwattr $C$DW$1710, DW_AT_type(*$C$DW$T$28)
    9528                      .dwattr $C$DW$1710, DW_AT_name("resvd_12")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  183

    9529                      .dwattr $C$DW$1710, DW_AT_TI_symbol_name("_resvd_12")
    9530                      .dwattr $C$DW$1710, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9531                      .dwattr $C$DW$1710, DW_AT_accessibility(DW_ACCESS_public)
    9532              $C$DW$1711      .dwtag  DW_TAG_member
    9533                      .dwattr $C$DW$1711, DW_AT_type(*$C$DW$T$22)
    9534                      .dwattr $C$DW$1711, DW_AT_name("ADCREV")
    9535                      .dwattr $C$DW$1711, DW_AT_TI_symbol_name("_ADCREV")
    9536                      .dwattr $C$DW$1711, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9537                      .dwattr $C$DW$1711, DW_AT_accessibility(DW_ACCESS_public)
    9538                      .dwendtag $C$DW$T$29
    9539              
    9540              $C$DW$T$327     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9541                      .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$29)
    9542                      .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
    9543              $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    9544                      .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$29)
    9545                      .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    9546              $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9547                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
    9548                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    9549              
    9550              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    9551                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    9552                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    9553              $C$DW$1712      .dwtag  DW_TAG_member
    9554                      .dwattr $C$DW$1712, DW_AT_type(*$C$DW$T$22)
    9555                      .dwattr $C$DW$1712, DW_AT_name("XCLK")
    9556                      .dwattr $C$DW$1712, DW_AT_TI_symbol_name("_XCLK")
    9557                      .dwattr $C$DW$1712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9558                      .dwattr $C$DW$1712, DW_AT_accessibility(DW_ACCESS_public)
    9559              $C$DW$1713      .dwtag  DW_TAG_member
    9560                      .dwattr $C$DW$1713, DW_AT_type(*$C$DW$T$22)
    9561                      .dwattr $C$DW$1713, DW_AT_name("rsvd_1")
    9562                      .dwattr $C$DW$1713, DW_AT_TI_symbol_name("_rsvd_1")
    9563                      .dwattr $C$DW$1713, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9564                      .dwattr $C$DW$1713, DW_AT_accessibility(DW_ACCESS_public)
    9565              $C$DW$1714      .dwtag  DW_TAG_member
    9566                      .dwattr $C$DW$1714, DW_AT_type(*$C$DW$T$22)
    9567                      .dwattr $C$DW$1714, DW_AT_name("CLKCTL")
    9568                      .dwattr $C$DW$1714, DW_AT_TI_symbol_name("_CLKCTL")
    9569                      .dwattr $C$DW$1714, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9570                      .dwattr $C$DW$1714, DW_AT_accessibility(DW_ACCESS_public)
    9571              $C$DW$1715      .dwtag  DW_TAG_member
    9572                      .dwattr $C$DW$1715, DW_AT_type(*$C$DW$T$30)
    9573                      .dwattr $C$DW$1715, DW_AT_name("rsvd_2")
    9574                      .dwattr $C$DW$1715, DW_AT_TI_symbol_name("_rsvd_2")
    9575                      .dwattr $C$DW$1715, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9576                      .dwattr $C$DW$1715, DW_AT_accessibility(DW_ACCESS_public)
    9577              $C$DW$1716      .dwtag  DW_TAG_member
    9578                      .dwattr $C$DW$1716, DW_AT_type(*$C$DW$T$22)
    9579                      .dwattr $C$DW$1716, DW_AT_name("LOSPCP")
    9580                      .dwattr $C$DW$1716, DW_AT_TI_symbol_name("_LOSPCP")
    9581                      .dwattr $C$DW$1716, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9582                      .dwattr $C$DW$1716, DW_AT_accessibility(DW_ACCESS_public)
    9583              $C$DW$1717      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  184

    9584                      .dwattr $C$DW$1717, DW_AT_type(*$C$DW$T$22)
    9585                      .dwattr $C$DW$1717, DW_AT_name("PCLKCR0")
    9586                      .dwattr $C$DW$1717, DW_AT_TI_symbol_name("_PCLKCR0")
    9587                      .dwattr $C$DW$1717, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9588                      .dwattr $C$DW$1717, DW_AT_accessibility(DW_ACCESS_public)
    9589              $C$DW$1718      .dwtag  DW_TAG_member
    9590                      .dwattr $C$DW$1718, DW_AT_type(*$C$DW$T$22)
    9591                      .dwattr $C$DW$1718, DW_AT_name("PCLKCR1")
    9592                      .dwattr $C$DW$1718, DW_AT_TI_symbol_name("_PCLKCR1")
    9593                      .dwattr $C$DW$1718, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9594                      .dwattr $C$DW$1718, DW_AT_accessibility(DW_ACCESS_public)
    9595              $C$DW$1719      .dwtag  DW_TAG_member
    9596                      .dwattr $C$DW$1719, DW_AT_type(*$C$DW$T$25)
    9597                      .dwattr $C$DW$1719, DW_AT_name("rsvd_3")
    9598                      .dwattr $C$DW$1719, DW_AT_TI_symbol_name("_rsvd_3")
    9599                      .dwattr $C$DW$1719, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9600                      .dwattr $C$DW$1719, DW_AT_accessibility(DW_ACCESS_public)
    9601              $C$DW$1720      .dwtag  DW_TAG_member
    9602                      .dwattr $C$DW$1720, DW_AT_type(*$C$DW$T$22)
    9603                      .dwattr $C$DW$1720, DW_AT_name("PCLKCR3")
    9604                      .dwattr $C$DW$1720, DW_AT_TI_symbol_name("_PCLKCR3")
    9605                      .dwattr $C$DW$1720, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9606                      .dwattr $C$DW$1720, DW_AT_accessibility(DW_ACCESS_public)
    9607                      .dwendtag $C$DW$T$31
    9608              
    9609              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    9610                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$31)
    9611                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    9612              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9613                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    9614                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    9615              
    9616              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9617                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    9618                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    9619              $C$DW$1721      .dwtag  DW_TAG_member
    9620                      .dwattr $C$DW$1721, DW_AT_type(*$C$DW$T$32)
    9621                      .dwattr $C$DW$1721, DW_AT_name("tmp")
    9622                      .dwattr $C$DW$1721, DW_AT_TI_symbol_name("_tmp")
    9623                      .dwattr $C$DW$1721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9624                      .dwattr $C$DW$1721, DW_AT_accessibility(DW_ACCESS_public)
    9625                      .dwendtag $C$DW$T$33
    9626              
    9627              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9628                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$33)
    9629                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
    9630              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    9631                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    9632                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    9633              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9634                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    9635                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    9636              
    9637              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9638                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8301_Obj_")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  185

    9639                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    9640              $C$DW$1722      .dwtag  DW_TAG_member
    9641                      .dwattr $C$DW$1722, DW_AT_type(*$C$DW$T$35)
    9642                      .dwattr $C$DW$1722, DW_AT_name("spiHandle")
    9643                      .dwattr $C$DW$1722, DW_AT_TI_symbol_name("_spiHandle")
    9644                      .dwattr $C$DW$1722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9645                      .dwattr $C$DW$1722, DW_AT_accessibility(DW_ACCESS_public)
    9646              $C$DW$1723      .dwtag  DW_TAG_member
    9647                      .dwattr $C$DW$1723, DW_AT_type(*$C$DW$T$37)
    9648                      .dwattr $C$DW$1723, DW_AT_name("gpioHandle")
    9649                      .dwattr $C$DW$1723, DW_AT_TI_symbol_name("_gpioHandle")
    9650                      .dwattr $C$DW$1723, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9651                      .dwattr $C$DW$1723, DW_AT_accessibility(DW_ACCESS_public)
    9652              $C$DW$1724      .dwtag  DW_TAG_member
    9653                      .dwattr $C$DW$1724, DW_AT_type(*$C$DW$T$39)
    9654                      .dwattr $C$DW$1724, DW_AT_name("gpioNumber")
    9655                      .dwattr $C$DW$1724, DW_AT_TI_symbol_name("_gpioNumber")
    9656                      .dwattr $C$DW$1724, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9657                      .dwattr $C$DW$1724, DW_AT_accessibility(DW_ACCESS_public)
    9658              $C$DW$1725      .dwtag  DW_TAG_member
    9659                      .dwattr $C$DW$1725, DW_AT_type(*$C$DW$T$40)
    9660                      .dwattr $C$DW$1725, DW_AT_name("RxTimeOut")
    9661                      .dwattr $C$DW$1725, DW_AT_TI_symbol_name("_RxTimeOut")
    9662                      .dwattr $C$DW$1725, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9663                      .dwattr $C$DW$1725, DW_AT_accessibility(DW_ACCESS_public)
    9664              $C$DW$1726      .dwtag  DW_TAG_member
    9665                      .dwattr $C$DW$1726, DW_AT_type(*$C$DW$T$40)
    9666                      .dwattr $C$DW$1726, DW_AT_name("enableTimeOut")
    9667                      .dwattr $C$DW$1726, DW_AT_TI_symbol_name("_enableTimeOut")
    9668                      .dwattr $C$DW$1726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9669                      .dwattr $C$DW$1726, DW_AT_accessibility(DW_ACCESS_public)
    9670                      .dwendtag $C$DW$T$41
    9671              
    9672              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    9673                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$41)
    9674                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    9675              $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    9676                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$41)
    9677                      .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    9678              $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    9679                      .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    9680                      .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    9681              
    9682              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    9683                      .dwattr $C$DW$T$52, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9684                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    9685              $C$DW$1727      .dwtag  DW_TAG_member
    9686                      .dwattr $C$DW$1727, DW_AT_type(*$C$DW$T$43)
    9687                      .dwattr $C$DW$1727, DW_AT_name("DRV8301_CURRENT")
    9688                      .dwattr $C$DW$1727, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9689                      .dwattr $C$DW$1727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9690                      .dwattr $C$DW$1727, DW_AT_accessibility(DW_ACCESS_public)
    9691              $C$DW$1728      .dwtag  DW_TAG_member
    9692                      .dwattr $C$DW$1728, DW_AT_type(*$C$DW$T$45)
    9693                      .dwattr $C$DW$1728, DW_AT_name("DRV8301_RESET")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  186

    9694                      .dwattr $C$DW$1728, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9695                      .dwattr $C$DW$1728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9696                      .dwattr $C$DW$1728, DW_AT_accessibility(DW_ACCESS_public)
    9697              $C$DW$1729      .dwtag  DW_TAG_member
    9698                      .dwattr $C$DW$1729, DW_AT_type(*$C$DW$T$47)
    9699                      .dwattr $C$DW$1729, DW_AT_name("PWM_MODE")
    9700                      .dwattr $C$DW$1729, DW_AT_TI_symbol_name("_PWM_MODE")
    9701                      .dwattr $C$DW$1729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9702                      .dwattr $C$DW$1729, DW_AT_accessibility(DW_ACCESS_public)
    9703              $C$DW$1730      .dwtag  DW_TAG_member
    9704                      .dwattr $C$DW$1730, DW_AT_type(*$C$DW$T$49)
    9705                      .dwattr $C$DW$1730, DW_AT_name("OC_MODE")
    9706                      .dwattr $C$DW$1730, DW_AT_TI_symbol_name("_OC_MODE")
    9707                      .dwattr $C$DW$1730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9708                      .dwattr $C$DW$1730, DW_AT_accessibility(DW_ACCESS_public)
    9709              $C$DW$1731      .dwtag  DW_TAG_member
    9710                      .dwattr $C$DW$1731, DW_AT_type(*$C$DW$T$51)
    9711                      .dwattr $C$DW$1731, DW_AT_name("OC_ADJ_SET")
    9712                      .dwattr $C$DW$1731, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9713                      .dwattr $C$DW$1731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9714                      .dwattr $C$DW$1731, DW_AT_accessibility(DW_ACCESS_public)
    9715                      .dwendtag $C$DW$T$52
    9716              
    9717              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9718                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$52)
    9719                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    9720              
    9721              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    9722                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9723                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    9724              $C$DW$1732      .dwtag  DW_TAG_member
    9725                      .dwattr $C$DW$1732, DW_AT_type(*$C$DW$T$54)
    9726                      .dwattr $C$DW$1732, DW_AT_name("OCTW_SET")
    9727                      .dwattr $C$DW$1732, DW_AT_TI_symbol_name("_OCTW_SET")
    9728                      .dwattr $C$DW$1732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9729                      .dwattr $C$DW$1732, DW_AT_accessibility(DW_ACCESS_public)
    9730              $C$DW$1733      .dwtag  DW_TAG_member
    9731                      .dwattr $C$DW$1733, DW_AT_type(*$C$DW$T$56)
    9732                      .dwattr $C$DW$1733, DW_AT_name("GAIN")
    9733                      .dwattr $C$DW$1733, DW_AT_TI_symbol_name("_GAIN")
    9734                      .dwattr $C$DW$1733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9735                      .dwattr $C$DW$1733, DW_AT_accessibility(DW_ACCESS_public)
    9736              $C$DW$1734      .dwtag  DW_TAG_member
    9737                      .dwattr $C$DW$1734, DW_AT_type(*$C$DW$T$58)
    9738                      .dwattr $C$DW$1734, DW_AT_name("DC_CAL_CH1p2")
    9739                      .dwattr $C$DW$1734, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9740                      .dwattr $C$DW$1734, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9741                      .dwattr $C$DW$1734, DW_AT_accessibility(DW_ACCESS_public)
    9742              $C$DW$1735      .dwtag  DW_TAG_member
    9743                      .dwattr $C$DW$1735, DW_AT_type(*$C$DW$T$60)
    9744                      .dwattr $C$DW$1735, DW_AT_name("OC_TOFF")
    9745                      .dwattr $C$DW$1735, DW_AT_TI_symbol_name("_OC_TOFF")
    9746                      .dwattr $C$DW$1735, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9747                      .dwattr $C$DW$1735, DW_AT_accessibility(DW_ACCESS_public)
    9748                      .dwendtag $C$DW$T$61
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  187

    9749              
    9750              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9751                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$61)
    9752                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    9753              
    9754              $C$DW$T$62      .dwtag  DW_TAG_structure_type
    9755                      .dwattr $C$DW$T$62, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9756                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x0b)
    9757              $C$DW$1736      .dwtag  DW_TAG_member
    9758                      .dwattr $C$DW$1736, DW_AT_type(*$C$DW$T$40)
    9759                      .dwattr $C$DW$1736, DW_AT_name("FAULT")
    9760                      .dwattr $C$DW$1736, DW_AT_TI_symbol_name("_FAULT")
    9761                      .dwattr $C$DW$1736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9762                      .dwattr $C$DW$1736, DW_AT_accessibility(DW_ACCESS_public)
    9763              $C$DW$1737      .dwtag  DW_TAG_member
    9764                      .dwattr $C$DW$1737, DW_AT_type(*$C$DW$T$40)
    9765                      .dwattr $C$DW$1737, DW_AT_name("GVDD_UV")
    9766                      .dwattr $C$DW$1737, DW_AT_TI_symbol_name("_GVDD_UV")
    9767                      .dwattr $C$DW$1737, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9768                      .dwattr $C$DW$1737, DW_AT_accessibility(DW_ACCESS_public)
    9769              $C$DW$1738      .dwtag  DW_TAG_member
    9770                      .dwattr $C$DW$1738, DW_AT_type(*$C$DW$T$40)
    9771                      .dwattr $C$DW$1738, DW_AT_name("PVDD_UV")
    9772                      .dwattr $C$DW$1738, DW_AT_TI_symbol_name("_PVDD_UV")
    9773                      .dwattr $C$DW$1738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9774                      .dwattr $C$DW$1738, DW_AT_accessibility(DW_ACCESS_public)
    9775              $C$DW$1739      .dwtag  DW_TAG_member
    9776                      .dwattr $C$DW$1739, DW_AT_type(*$C$DW$T$40)
    9777                      .dwattr $C$DW$1739, DW_AT_name("OTSD")
    9778                      .dwattr $C$DW$1739, DW_AT_TI_symbol_name("_OTSD")
    9779                      .dwattr $C$DW$1739, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9780                      .dwattr $C$DW$1739, DW_AT_accessibility(DW_ACCESS_public)
    9781              $C$DW$1740      .dwtag  DW_TAG_member
    9782                      .dwattr $C$DW$1740, DW_AT_type(*$C$DW$T$40)
    9783                      .dwattr $C$DW$1740, DW_AT_name("OTW")
    9784                      .dwattr $C$DW$1740, DW_AT_TI_symbol_name("_OTW")
    9785                      .dwattr $C$DW$1740, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9786                      .dwattr $C$DW$1740, DW_AT_accessibility(DW_ACCESS_public)
    9787              $C$DW$1741      .dwtag  DW_TAG_member
    9788                      .dwattr $C$DW$1741, DW_AT_type(*$C$DW$T$40)
    9789                      .dwattr $C$DW$1741, DW_AT_name("FETHA_OC")
    9790                      .dwattr $C$DW$1741, DW_AT_TI_symbol_name("_FETHA_OC")
    9791                      .dwattr $C$DW$1741, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9792                      .dwattr $C$DW$1741, DW_AT_accessibility(DW_ACCESS_public)
    9793              $C$DW$1742      .dwtag  DW_TAG_member
    9794                      .dwattr $C$DW$1742, DW_AT_type(*$C$DW$T$40)
    9795                      .dwattr $C$DW$1742, DW_AT_name("FETLA_OC")
    9796                      .dwattr $C$DW$1742, DW_AT_TI_symbol_name("_FETLA_OC")
    9797                      .dwattr $C$DW$1742, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9798                      .dwattr $C$DW$1742, DW_AT_accessibility(DW_ACCESS_public)
    9799              $C$DW$1743      .dwtag  DW_TAG_member
    9800                      .dwattr $C$DW$1743, DW_AT_type(*$C$DW$T$40)
    9801                      .dwattr $C$DW$1743, DW_AT_name("FETHB_OC")
    9802                      .dwattr $C$DW$1743, DW_AT_TI_symbol_name("_FETHB_OC")
    9803                      .dwattr $C$DW$1743, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  188

    9804                      .dwattr $C$DW$1743, DW_AT_accessibility(DW_ACCESS_public)
    9805              $C$DW$1744      .dwtag  DW_TAG_member
    9806                      .dwattr $C$DW$1744, DW_AT_type(*$C$DW$T$40)
    9807                      .dwattr $C$DW$1744, DW_AT_name("FETLB_OC")
    9808                      .dwattr $C$DW$1744, DW_AT_TI_symbol_name("_FETLB_OC")
    9809                      .dwattr $C$DW$1744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9810                      .dwattr $C$DW$1744, DW_AT_accessibility(DW_ACCESS_public)
    9811              $C$DW$1745      .dwtag  DW_TAG_member
    9812                      .dwattr $C$DW$1745, DW_AT_type(*$C$DW$T$40)
    9813                      .dwattr $C$DW$1745, DW_AT_name("FETHC_OC")
    9814                      .dwattr $C$DW$1745, DW_AT_TI_symbol_name("_FETHC_OC")
    9815                      .dwattr $C$DW$1745, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    9816                      .dwattr $C$DW$1745, DW_AT_accessibility(DW_ACCESS_public)
    9817              $C$DW$1746      .dwtag  DW_TAG_member
    9818                      .dwattr $C$DW$1746, DW_AT_type(*$C$DW$T$40)
    9819                      .dwattr $C$DW$1746, DW_AT_name("FETLC_OC")
    9820                      .dwattr $C$DW$1746, DW_AT_TI_symbol_name("_FETLC_OC")
    9821                      .dwattr $C$DW$1746, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9822                      .dwattr $C$DW$1746, DW_AT_accessibility(DW_ACCESS_public)
    9823                      .dwendtag $C$DW$T$62
    9824              
    9825              $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    9826                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$62)
    9827                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    9828              
    9829              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    9830                      .dwattr $C$DW$T$63, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    9831                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x02)
    9832              $C$DW$1747      .dwtag  DW_TAG_member
    9833                      .dwattr $C$DW$1747, DW_AT_type(*$C$DW$T$40)
    9834                      .dwattr $C$DW$1747, DW_AT_name("GVDD_OV")
    9835                      .dwattr $C$DW$1747, DW_AT_TI_symbol_name("_GVDD_OV")
    9836                      .dwattr $C$DW$1747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9837                      .dwattr $C$DW$1747, DW_AT_accessibility(DW_ACCESS_public)
    9838              $C$DW$1748      .dwtag  DW_TAG_member
    9839                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$21)
    9840                      .dwattr $C$DW$1748, DW_AT_name("DeviceID")
    9841                      .dwattr $C$DW$1748, DW_AT_TI_symbol_name("_DeviceID")
    9842                      .dwattr $C$DW$1748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9843                      .dwattr $C$DW$1748, DW_AT_accessibility(DW_ACCESS_public)
    9844                      .dwendtag $C$DW$T$63
    9845              
    9846              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    9847                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    9848                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    9849              
    9850              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    9851                      .dwattr $C$DW$T$68, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    9852                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x18)
    9853              $C$DW$1749      .dwtag  DW_TAG_member
    9854                      .dwattr $C$DW$1749, DW_AT_type(*$C$DW$T$64)
    9855                      .dwattr $C$DW$1749, DW_AT_name("Stat_Reg_1")
    9856                      .dwattr $C$DW$1749, DW_AT_TI_symbol_name("_Stat_Reg_1")
    9857                      .dwattr $C$DW$1749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9858                      .dwattr $C$DW$1749, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  189

    9859              $C$DW$1750      .dwtag  DW_TAG_member
    9860                      .dwattr $C$DW$1750, DW_AT_type(*$C$DW$T$65)
    9861                      .dwattr $C$DW$1750, DW_AT_name("Stat_Reg_2")
    9862                      .dwattr $C$DW$1750, DW_AT_TI_symbol_name("_Stat_Reg_2")
    9863                      .dwattr $C$DW$1750, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9864                      .dwattr $C$DW$1750, DW_AT_accessibility(DW_ACCESS_public)
    9865              $C$DW$1751      .dwtag  DW_TAG_member
    9866                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$66)
    9867                      .dwattr $C$DW$1751, DW_AT_name("Ctrl_Reg_1")
    9868                      .dwattr $C$DW$1751, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    9869                      .dwattr $C$DW$1751, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9870                      .dwattr $C$DW$1751, DW_AT_accessibility(DW_ACCESS_public)
    9871              $C$DW$1752      .dwtag  DW_TAG_member
    9872                      .dwattr $C$DW$1752, DW_AT_type(*$C$DW$T$67)
    9873                      .dwattr $C$DW$1752, DW_AT_name("Ctrl_Reg_2")
    9874                      .dwattr $C$DW$1752, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    9875                      .dwattr $C$DW$1752, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9876                      .dwattr $C$DW$1752, DW_AT_accessibility(DW_ACCESS_public)
    9877              $C$DW$1753      .dwtag  DW_TAG_member
    9878                      .dwattr $C$DW$1753, DW_AT_type(*$C$DW$T$40)
    9879                      .dwattr $C$DW$1753, DW_AT_name("SndCmd")
    9880                      .dwattr $C$DW$1753, DW_AT_TI_symbol_name("_SndCmd")
    9881                      .dwattr $C$DW$1753, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    9882                      .dwattr $C$DW$1753, DW_AT_accessibility(DW_ACCESS_public)
    9883              $C$DW$1754      .dwtag  DW_TAG_member
    9884                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$40)
    9885                      .dwattr $C$DW$1754, DW_AT_name("RcvCmd")
    9886                      .dwattr $C$DW$1754, DW_AT_TI_symbol_name("_RcvCmd")
    9887                      .dwattr $C$DW$1754, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    9888                      .dwattr $C$DW$1754, DW_AT_accessibility(DW_ACCESS_public)
    9889                      .dwendtag $C$DW$T$68
    9890              
    9891              $C$DW$T$343     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    9892                      .dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$68)
    9893                      .dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
    9894              $C$DW$T$344     .dwtag  DW_TAG_pointer_type
    9895                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
    9896                      .dwattr $C$DW$T$344, DW_AT_address_class(0x20)
    9897              
    9898              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    9899                      .dwattr $C$DW$T$70, DW_AT_name("_FILTER_FO_")
    9900                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    9901              $C$DW$1755      .dwtag  DW_TAG_member
    9902                      .dwattr $C$DW$1755, DW_AT_type(*$C$DW$T$69)
    9903                      .dwattr $C$DW$1755, DW_AT_name("a1")
    9904                      .dwattr $C$DW$1755, DW_AT_TI_symbol_name("_a1")
    9905                      .dwattr $C$DW$1755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9906                      .dwattr $C$DW$1755, DW_AT_accessibility(DW_ACCESS_public)
    9907              $C$DW$1756      .dwtag  DW_TAG_member
    9908                      .dwattr $C$DW$1756, DW_AT_type(*$C$DW$T$69)
    9909                      .dwattr $C$DW$1756, DW_AT_name("b0")
    9910                      .dwattr $C$DW$1756, DW_AT_TI_symbol_name("_b0")
    9911                      .dwattr $C$DW$1756, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9912                      .dwattr $C$DW$1756, DW_AT_accessibility(DW_ACCESS_public)
    9913              $C$DW$1757      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  190

    9914                      .dwattr $C$DW$1757, DW_AT_type(*$C$DW$T$69)
    9915                      .dwattr $C$DW$1757, DW_AT_name("b1")
    9916                      .dwattr $C$DW$1757, DW_AT_TI_symbol_name("_b1")
    9917                      .dwattr $C$DW$1757, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9918                      .dwattr $C$DW$1757, DW_AT_accessibility(DW_ACCESS_public)
    9919              $C$DW$1758      .dwtag  DW_TAG_member
    9920                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$69)
    9921                      .dwattr $C$DW$1758, DW_AT_name("x1")
    9922                      .dwattr $C$DW$1758, DW_AT_TI_symbol_name("_x1")
    9923                      .dwattr $C$DW$1758, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9924                      .dwattr $C$DW$1758, DW_AT_accessibility(DW_ACCESS_public)
    9925              $C$DW$1759      .dwtag  DW_TAG_member
    9926                      .dwattr $C$DW$1759, DW_AT_type(*$C$DW$T$69)
    9927                      .dwattr $C$DW$1759, DW_AT_name("y1")
    9928                      .dwattr $C$DW$1759, DW_AT_TI_symbol_name("_y1")
    9929                      .dwattr $C$DW$1759, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9930                      .dwattr $C$DW$1759, DW_AT_accessibility(DW_ACCESS_public)
    9931                      .dwendtag $C$DW$T$70
    9932              
    9933              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    9934                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$70)
    9935                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    9936              
    9937              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    9938                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    9939                      .dwattr $C$DW$T$19, DW_AT_declaration
    9940                      .dwendtag $C$DW$T$19
    9941              
    9942              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    9943                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$19)
    9944                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    9945              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    9946                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    9947                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    9948              
    9949              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    9950                      .dwattr $C$DW$T$71, DW_AT_name("_FLASH_Obj_")
    9951                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x08)
    9952              $C$DW$1760      .dwtag  DW_TAG_member
    9953                      .dwattr $C$DW$1760, DW_AT_type(*$C$DW$T$22)
    9954                      .dwattr $C$DW$1760, DW_AT_name("FOPT")
    9955                      .dwattr $C$DW$1760, DW_AT_TI_symbol_name("_FOPT")
    9956                      .dwattr $C$DW$1760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9957                      .dwattr $C$DW$1760, DW_AT_accessibility(DW_ACCESS_public)
    9958              $C$DW$1761      .dwtag  DW_TAG_member
    9959                      .dwattr $C$DW$1761, DW_AT_type(*$C$DW$T$22)
    9960                      .dwattr $C$DW$1761, DW_AT_name("rsvd_1")
    9961                      .dwattr $C$DW$1761, DW_AT_TI_symbol_name("_rsvd_1")
    9962                      .dwattr $C$DW$1761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9963                      .dwattr $C$DW$1761, DW_AT_accessibility(DW_ACCESS_public)
    9964              $C$DW$1762      .dwtag  DW_TAG_member
    9965                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$22)
    9966                      .dwattr $C$DW$1762, DW_AT_name("FPWR")
    9967                      .dwattr $C$DW$1762, DW_AT_TI_symbol_name("_FPWR")
    9968                      .dwattr $C$DW$1762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  191

    9969                      .dwattr $C$DW$1762, DW_AT_accessibility(DW_ACCESS_public)
    9970              $C$DW$1763      .dwtag  DW_TAG_member
    9971                      .dwattr $C$DW$1763, DW_AT_type(*$C$DW$T$22)
    9972                      .dwattr $C$DW$1763, DW_AT_name("FSTATUS")
    9973                      .dwattr $C$DW$1763, DW_AT_TI_symbol_name("_FSTATUS")
    9974                      .dwattr $C$DW$1763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9975                      .dwattr $C$DW$1763, DW_AT_accessibility(DW_ACCESS_public)
    9976              $C$DW$1764      .dwtag  DW_TAG_member
    9977                      .dwattr $C$DW$1764, DW_AT_type(*$C$DW$T$22)
    9978                      .dwattr $C$DW$1764, DW_AT_name("FSTDBYWAIT")
    9979                      .dwattr $C$DW$1764, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    9980                      .dwattr $C$DW$1764, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9981                      .dwattr $C$DW$1764, DW_AT_accessibility(DW_ACCESS_public)
    9982              $C$DW$1765      .dwtag  DW_TAG_member
    9983                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$22)
    9984                      .dwattr $C$DW$1765, DW_AT_name("FACTIVEWAIT")
    9985                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    9986                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9987                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
    9988              $C$DW$1766      .dwtag  DW_TAG_member
    9989                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$22)
    9990                      .dwattr $C$DW$1766, DW_AT_name("FBANKWAIT")
    9991                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_FBANKWAIT")
    9992                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9993                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
    9994              $C$DW$1767      .dwtag  DW_TAG_member
    9995                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$22)
    9996                      .dwattr $C$DW$1767, DW_AT_name("FOTPWAIT")
    9997                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_FOTPWAIT")
    9998                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9999                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
   10000                      .dwendtag $C$DW$T$71
   10001              
   10002              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
   10003                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$71)
   10004                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
   10005              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   10006                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
   10007                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
   10008              
   10009              $C$DW$T$76      .dwtag  DW_TAG_structure_type
   10010                      .dwattr $C$DW$T$76, DW_AT_name("_GPIO_Obj_")
   10011                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x6a)
   10012              $C$DW$1768      .dwtag  DW_TAG_member
   10013                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$73)
   10014                      .dwattr $C$DW$1768, DW_AT_name("GPACTRL")
   10015                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_GPACTRL")
   10016                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10017                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
   10018              $C$DW$1769      .dwtag  DW_TAG_member
   10019                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$73)
   10020                      .dwattr $C$DW$1769, DW_AT_name("GPAQSEL1")
   10021                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_GPAQSEL1")
   10022                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10023                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  192

   10024              $C$DW$1770      .dwtag  DW_TAG_member
   10025                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$73)
   10026                      .dwattr $C$DW$1770, DW_AT_name("GPAQSEL2")
   10027                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_GPAQSEL2")
   10028                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10029                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
   10030              $C$DW$1771      .dwtag  DW_TAG_member
   10031                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$73)
   10032                      .dwattr $C$DW$1771, DW_AT_name("GPAMUX1")
   10033                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_GPAMUX1")
   10034                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10035                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
   10036              $C$DW$1772      .dwtag  DW_TAG_member
   10037                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$73)
   10038                      .dwattr $C$DW$1772, DW_AT_name("GPAMUX2")
   10039                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_GPAMUX2")
   10040                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10041                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
   10042              $C$DW$1773      .dwtag  DW_TAG_member
   10043                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$73)
   10044                      .dwattr $C$DW$1773, DW_AT_name("GPADIR")
   10045                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_GPADIR")
   10046                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10047                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
   10048              $C$DW$1774      .dwtag  DW_TAG_member
   10049                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$73)
   10050                      .dwattr $C$DW$1774, DW_AT_name("GPAPUD")
   10051                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_GPAPUD")
   10052                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10053                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
   10054              $C$DW$1775      .dwtag  DW_TAG_member
   10055                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$25)
   10056                      .dwattr $C$DW$1775, DW_AT_name("rsvd_1")
   10057                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_rsvd_1")
   10058                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10059                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
   10060              $C$DW$1776      .dwtag  DW_TAG_member
   10061                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$73)
   10062                      .dwattr $C$DW$1776, DW_AT_name("GPBCTRL")
   10063                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_GPBCTRL")
   10064                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10065                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
   10066              $C$DW$1777      .dwtag  DW_TAG_member
   10067                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$73)
   10068                      .dwattr $C$DW$1777, DW_AT_name("GPBQSEL1")
   10069                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_GPBQSEL1")
   10070                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   10071                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
   10072              $C$DW$1778      .dwtag  DW_TAG_member
   10073                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$25)
   10074                      .dwattr $C$DW$1778, DW_AT_name("rsvd_2")
   10075                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_rsvd_2")
   10076                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   10077                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
   10078              $C$DW$1779      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  193

   10079                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$73)
   10080                      .dwattr $C$DW$1779, DW_AT_name("GPBMUX1")
   10081                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_GPBMUX1")
   10082                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10083                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
   10084              $C$DW$1780      .dwtag  DW_TAG_member
   10085                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$25)
   10086                      .dwattr $C$DW$1780, DW_AT_name("rsvd_3")
   10087                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_rsvd_3")
   10088                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   10089                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
   10090              $C$DW$1781      .dwtag  DW_TAG_member
   10091                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$73)
   10092                      .dwattr $C$DW$1781, DW_AT_name("GPBDIR")
   10093                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_GPBDIR")
   10094                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   10095                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
   10096              $C$DW$1782      .dwtag  DW_TAG_member
   10097                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$73)
   10098                      .dwattr $C$DW$1782, DW_AT_name("GPBPUD")
   10099                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_GPBPUD")
   10100                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   10101                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
   10102              $C$DW$1783      .dwtag  DW_TAG_member
   10103                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$74)
   10104                      .dwattr $C$DW$1783, DW_AT_name("rsvd_4")
   10105                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_rsvd_4")
   10106                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   10107                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
   10108              $C$DW$1784      .dwtag  DW_TAG_member
   10109                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$73)
   10110                      .dwattr $C$DW$1784, DW_AT_name("AIOMUX1")
   10111                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_AIOMUX1")
   10112                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   10113                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
   10114              $C$DW$1785      .dwtag  DW_TAG_member
   10115                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$25)
   10116                      .dwattr $C$DW$1785, DW_AT_name("rsvd_5")
   10117                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_rsvd_5")
   10118                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   10119                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
   10120              $C$DW$1786      .dwtag  DW_TAG_member
   10121                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$73)
   10122                      .dwattr $C$DW$1786, DW_AT_name("AIODIR")
   10123                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_AIODIR")
   10124                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10125                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
   10126              $C$DW$1787      .dwtag  DW_TAG_member
   10127                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$75)
   10128                      .dwattr $C$DW$1787, DW_AT_name("rsvd_6")
   10129                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_rsvd_6")
   10130                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   10131                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
   10132              $C$DW$1788      .dwtag  DW_TAG_member
   10133                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  194

   10134                      .dwattr $C$DW$1788, DW_AT_name("GPADAT")
   10135                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_GPADAT")
   10136                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10137                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
   10138              $C$DW$1789      .dwtag  DW_TAG_member
   10139                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$73)
   10140                      .dwattr $C$DW$1789, DW_AT_name("GPASET")
   10141                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_GPASET")
   10142                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   10143                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
   10144              $C$DW$1790      .dwtag  DW_TAG_member
   10145                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$73)
   10146                      .dwattr $C$DW$1790, DW_AT_name("GPACLEAR")
   10147                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_GPACLEAR")
   10148                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   10149                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
   10150              $C$DW$1791      .dwtag  DW_TAG_member
   10151                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$73)
   10152                      .dwattr $C$DW$1791, DW_AT_name("GPATOGGLE")
   10153                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_GPATOGGLE")
   10154                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10155                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
   10156              $C$DW$1792      .dwtag  DW_TAG_member
   10157                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$73)
   10158                      .dwattr $C$DW$1792, DW_AT_name("GPBDAT")
   10159                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_GPBDAT")
   10160                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   10161                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
   10162              $C$DW$1793      .dwtag  DW_TAG_member
   10163                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$73)
   10164                      .dwattr $C$DW$1793, DW_AT_name("GPBSET")
   10165                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_GPBSET")
   10166                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   10167                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
   10168              $C$DW$1794      .dwtag  DW_TAG_member
   10169                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$73)
   10170                      .dwattr $C$DW$1794, DW_AT_name("GPBCLEAR")
   10171                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_GPBCLEAR")
   10172                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10173                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
   10174              $C$DW$1795      .dwtag  DW_TAG_member
   10175                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$73)
   10176                      .dwattr $C$DW$1795, DW_AT_name("GPBTOGGLE")
   10177                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_GPBTOGGLE")
   10178                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   10179                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
   10180              $C$DW$1796      .dwtag  DW_TAG_member
   10181                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$30)
   10182                      .dwattr $C$DW$1796, DW_AT_name("rsvd_7")
   10183                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_rsvd_7")
   10184                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   10185                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
   10186              $C$DW$1797      .dwtag  DW_TAG_member
   10187                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$73)
   10188                      .dwattr $C$DW$1797, DW_AT_name("AIODAT")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  195

   10189                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_AIODAT")
   10190                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   10191                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
   10192              $C$DW$1798      .dwtag  DW_TAG_member
   10193                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$73)
   10194                      .dwattr $C$DW$1798, DW_AT_name("AIOSET")
   10195                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_AIOSET")
   10196                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10197                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
   10198              $C$DW$1799      .dwtag  DW_TAG_member
   10199                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$73)
   10200                      .dwattr $C$DW$1799, DW_AT_name("AIOCLEAR")
   10201                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_AIOCLEAR")
   10202                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10203                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
   10204              $C$DW$1800      .dwtag  DW_TAG_member
   10205                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$73)
   10206                      .dwattr $C$DW$1800, DW_AT_name("AIOTOGGLE")
   10207                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_AIOTOGGLE")
   10208                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10209                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
   10210              $C$DW$1801      .dwtag  DW_TAG_member
   10211                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$27)
   10212                      .dwattr $C$DW$1801, DW_AT_name("GPIOXINTnSEL")
   10213                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   10214                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10215                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
   10216              $C$DW$1802      .dwtag  DW_TAG_member
   10217                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$26)
   10218                      .dwattr $C$DW$1802, DW_AT_name("rsvd_8")
   10219                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_rsvd_8")
   10220                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   10221                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
   10222              $C$DW$1803      .dwtag  DW_TAG_member
   10223                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$73)
   10224                      .dwattr $C$DW$1803, DW_AT_name("GPIOLPMSEL")
   10225                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   10226                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   10227                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
   10228                      .dwendtag $C$DW$T$76
   10229              
   10230              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
   10231                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$76)
   10232                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
   10233              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   10234                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
   10235                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
   10236              
   10237              $C$DW$T$78      .dwtag  DW_TAG_structure_type
   10238                      .dwattr $C$DW$T$78, DW_AT_name("_HAL_AdcData_t_")
   10239                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x10)
   10240              $C$DW$1804      .dwtag  DW_TAG_member
   10241                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$77)
   10242                      .dwattr $C$DW$1804, DW_AT_name("I")
   10243                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_I")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  196

   10244                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10245                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
   10246              $C$DW$1805      .dwtag  DW_TAG_member
   10247                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$77)
   10248                      .dwattr $C$DW$1805, DW_AT_name("V")
   10249                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_V")
   10250                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10251                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
   10252              $C$DW$1806      .dwtag  DW_TAG_member
   10253                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$69)
   10254                      .dwattr $C$DW$1806, DW_AT_name("dcBus")
   10255                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_dcBus")
   10256                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   10257                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
   10258              $C$DW$1807      .dwtag  DW_TAG_member
   10259                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$12)
   10260                      .dwattr $C$DW$1807, DW_AT_name("accel")
   10261                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_accel")
   10262                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   10263                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
   10264                      .dwendtag $C$DW$T$78
   10265              
   10266              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   10267                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$78)
   10268                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   10269              
   10270              $C$DW$T$113     .dwtag  DW_TAG_structure_type
   10271                      .dwattr $C$DW$T$113, DW_AT_name("_HAL_Obj_")
   10272                      .dwattr $C$DW$T$113, DW_AT_byte_size(0xc4)
   10273              $C$DW$1808      .dwtag  DW_TAG_member
   10274                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$80)
   10275                      .dwattr $C$DW$1808, DW_AT_name("adcHandle")
   10276                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_adcHandle")
   10277                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10278                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
   10279              $C$DW$1809      .dwtag  DW_TAG_member
   10280                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$82)
   10281                      .dwattr $C$DW$1809, DW_AT_name("clkHandle")
   10282                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_clkHandle")
   10283                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10284                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
   10285              $C$DW$1810      .dwtag  DW_TAG_member
   10286                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$84)
   10287                      .dwattr $C$DW$1810, DW_AT_name("cpuHandle")
   10288                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_cpuHandle")
   10289                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10290                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
   10291              $C$DW$1811      .dwtag  DW_TAG_member
   10292                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$86)
   10293                      .dwattr $C$DW$1811, DW_AT_name("flashHandle")
   10294                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_flashHandle")
   10295                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10296                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
   10297              $C$DW$1812      .dwtag  DW_TAG_member
   10298                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  197

   10299                      .dwattr $C$DW$1812, DW_AT_name("gpioHandle")
   10300                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_gpioHandle")
   10301                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10302                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
   10303              $C$DW$1813      .dwtag  DW_TAG_member
   10304                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$89)
   10305                      .dwattr $C$DW$1813, DW_AT_name("offsetHandle_I")
   10306                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_offsetHandle_I")
   10307                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10308                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
   10309              $C$DW$1814      .dwtag  DW_TAG_member
   10310                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$91)
   10311                      .dwattr $C$DW$1814, DW_AT_name("offset_I")
   10312                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_offset_I")
   10313                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10314                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
   10315              $C$DW$1815      .dwtag  DW_TAG_member
   10316                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$89)
   10317                      .dwattr $C$DW$1815, DW_AT_name("offsetHandle_V")
   10318                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_offsetHandle_V")
   10319                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   10320                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
   10321              $C$DW$1816      .dwtag  DW_TAG_member
   10322                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$91)
   10323                      .dwattr $C$DW$1816, DW_AT_name("offset_V")
   10324                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_offset_V")
   10325                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   10326                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
   10327              $C$DW$1817      .dwtag  DW_TAG_member
   10328                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$93)
   10329                      .dwattr $C$DW$1817, DW_AT_name("oscHandle")
   10330                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_oscHandle")
   10331                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
   10332                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
   10333              $C$DW$1818      .dwtag  DW_TAG_member
   10334                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$95)
   10335                      .dwattr $C$DW$1818, DW_AT_name("pieHandle")
   10336                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_pieHandle")
   10337                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
   10338                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
   10339              $C$DW$1819      .dwtag  DW_TAG_member
   10340                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$97)
   10341                      .dwattr $C$DW$1819, DW_AT_name("pllHandle")
   10342                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_pllHandle")
   10343                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
   10344                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
   10345              $C$DW$1820      .dwtag  DW_TAG_member
   10346                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$100)
   10347                      .dwattr $C$DW$1820, DW_AT_name("pwmHandle")
   10348                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_pwmHandle")
   10349                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
   10350                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
   10351              $C$DW$1821      .dwtag  DW_TAG_member
   10352                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$100)
   10353                      .dwattr $C$DW$1821, DW_AT_name("pwmDacHandle")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  198

   10354                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_pwmDacHandle")
   10355                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
   10356                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
   10357              $C$DW$1822      .dwtag  DW_TAG_member
   10358                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$102)
   10359                      .dwattr $C$DW$1822, DW_AT_name("pwrHandle")
   10360                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_pwrHandle")
   10361                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
   10362                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
   10363              $C$DW$1823      .dwtag  DW_TAG_member
   10364                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$105)
   10365                      .dwattr $C$DW$1823, DW_AT_name("timerHandle")
   10366                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_timerHandle")
   10367                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
   10368                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
   10369              $C$DW$1824      .dwtag  DW_TAG_member
   10370                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$107)
   10371                      .dwattr $C$DW$1824, DW_AT_name("wdogHandle")
   10372                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_wdogHandle")
   10373                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
   10374                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
   10375              $C$DW$1825      .dwtag  DW_TAG_member
   10376                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$108)
   10377                      .dwattr $C$DW$1825, DW_AT_name("adcBias")
   10378                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_adcBias")
   10379                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
   10380                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
   10381              $C$DW$1826      .dwtag  DW_TAG_member
   10382                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$69)
   10383                      .dwattr $C$DW$1826, DW_AT_name("current_sf")
   10384                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_current_sf")
   10385                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
   10386                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
   10387              $C$DW$1827      .dwtag  DW_TAG_member
   10388                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$69)
   10389                      .dwattr $C$DW$1827, DW_AT_name("voltage_sf")
   10390                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_voltage_sf")
   10391                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
   10392                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
   10393              $C$DW$1828      .dwtag  DW_TAG_member
   10394                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$32)
   10395                      .dwattr $C$DW$1828, DW_AT_name("numCurrentSensors")
   10396                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_numCurrentSensors")
   10397                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
   10398                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
   10399              $C$DW$1829      .dwtag  DW_TAG_member
   10400                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$32)
   10401                      .dwattr $C$DW$1829, DW_AT_name("numVoltageSensors")
   10402                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_numVoltageSensors")
   10403                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
   10404                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
   10405              $C$DW$1830      .dwtag  DW_TAG_member
   10406                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$35)
   10407                      .dwattr $C$DW$1830, DW_AT_name("spiAHandle")
   10408                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_spiAHandle")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  199

   10409                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
   10410                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
   10411              $C$DW$1831      .dwtag  DW_TAG_member
   10412                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$109)
   10413                      .dwattr $C$DW$1831, DW_AT_name("spiA")
   10414                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_spiA")
   10415                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
   10416                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10417              $C$DW$1832      .dwtag  DW_TAG_member
   10418                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$111)
   10419                      .dwattr $C$DW$1832, DW_AT_name("drv8301Handle")
   10420                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_drv8301Handle")
   10421                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
   10422                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10423              $C$DW$1833      .dwtag  DW_TAG_member
   10424                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$112)
   10425                      .dwattr $C$DW$1833, DW_AT_name("drv8301")
   10426                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_drv8301")
   10427                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
   10428                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10429                      .dwendtag $C$DW$T$113
   10430              
   10431              $C$DW$T$354     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
   10432                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$113)
   10433                      .dwattr $C$DW$T$354, DW_AT_language(DW_LANG_C)
   10434              $C$DW$T$355     .dwtag  DW_TAG_pointer_type
   10435                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$354)
   10436                      .dwattr $C$DW$T$355, DW_AT_address_class(0x20)
   10437              $C$DW$T$356     .dwtag  DW_TAG_pointer_type
   10438                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$113)
   10439                      .dwattr $C$DW$T$356, DW_AT_address_class(0x20)
   10440              $C$DW$T$357     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
   10441                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$356)
   10442                      .dwattr $C$DW$T$357, DW_AT_language(DW_LANG_C)
   10443              $C$DW$1834      .dwtag  DW_TAG_TI_far_type
   10444                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$357)
   10445              $C$DW$T$358     .dwtag  DW_TAG_const_type
   10446                      .dwattr $C$DW$T$358, DW_AT_type(*$C$DW$1834)
   10447              
   10448              $C$DW$T$115     .dwtag  DW_TAG_structure_type
   10449                      .dwattr $C$DW$T$115, DW_AT_name("_MATH_vec3_")
   10450                      .dwattr $C$DW$T$115, DW_AT_byte_size(0x06)
   10451              $C$DW$1835      .dwtag  DW_TAG_member
   10452                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$114)
   10453                      .dwattr $C$DW$1835, DW_AT_name("value")
   10454                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_value")
   10455                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10456                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
   10457                      .dwendtag $C$DW$T$115
   10458              
   10459              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec3")
   10460                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$115)
   10461                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
   10462              
   10463              $C$DW$T$119     .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:34:51 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2264810                            PAGE  200

   10464                      .dwattr $C$DW$T$119, DW_AT_name("_OFFSET_")
   10465                      .dwattr $C$DW$T$119, DW_AT_byte_size(0x10)
   10466              $C$DW$1836      .dwtag  DW_TAG_member
   10467                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$69)
   10468                      .dwattr $C$DW$1836, DW_AT_name("value")
   10469                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_value")
   10470                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10471                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10472              $C$DW$1837      .dwtag  DW_TAG_member
   10473                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$69)
   10474                      .dwattr $C$DW$1837, DW_AT_name("bias")
   10475                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_bias")
   10476                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10477                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10478              $C$DW$1838      .dwtag  DW_TAG_member
   10479                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$116)
   10480                      .dwattr $C$DW$1838, DW_AT_name("filter")
   10481                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_filter")
   10482                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10483                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10484              $C$DW$1839      .dwtag  DW_TAG_member
   10485                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$118)
   10486                      .dwattr $C$DW$1839, DW_AT_name("filterHandle")
   10487                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_filterHandle")
   10488                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
