TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:58:57 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4322              $C$DW$605       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_9"), DW_AT_const_value(0x08)
    4323              $C$DW$606       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_1HP"), DW_AT_const_value(0x09)
    4324              $C$DW$607       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_2HP"), DW_AT_const_value(0x0a)
    4325              $C$DW$608       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_9HP"), DW_AT_const_value(0x0e)
    4326                      .dwendtag $C$DW$T$199
    4327              
    4328              $C$DW$T$200     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntNumber_e")
    4329                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    4330                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    4331              
    4332              $C$DW$T$202     .dwtag  DW_TAG_enumeration_type
    4333                      .dwattr $C$DW$T$202, DW_AT_byte_size(0x01)
    4334              $C$DW$609       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_0"), DW_AT_const_value(0x00)
    4335              $C$DW$610       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_1"), DW_AT_const_value(0x01)
    4336              $C$DW$611       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_2"), DW_AT_const_value(0x02)
    4337              $C$DW$612       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_3"), DW_AT_const_value(0x03)
    4338              $C$DW$613       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    4339              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    4340              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    4341              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    4342              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    4343              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    4344              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    4345              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    4346              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    4347              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    4348              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    4349              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    4350                      .dwendtag $C$DW$T$202
    4351              
    4352              $C$DW$T$203     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4353                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$202)
    4354                      .dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
    4355              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   89

    4356              $C$DW$T$205     .dwtag  DW_TAG_enumeration_type
    4357                      .dwattr $C$DW$T$205, DW_AT_byte_size(0x01)
    4358              $C$DW$625       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4359              $C$DW$626       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4360              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4361              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4362              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4363              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4364              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4365              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4366              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4367              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4368              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4369              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4370                      .dwendtag $C$DW$T$205
    4371              
    4372              $C$DW$T$206     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4373                      .dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$205)
    4374                      .dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
    4375              
    4376              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4377                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_BITS")
    4378                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4379              $C$DW$637       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$22)
    4381                      .dwattr $C$DW$637, DW_AT_name("BCM")
    4382                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_BCM")
    4383                      .dwattr $C$DW$637, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4384                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4385                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$638       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$22)
    4388                      .dwattr $C$DW$638, DW_AT_name("rsvd1")
    4389                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_rsvd1")
    4390                      .dwattr $C$DW$638, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4391                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4392                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4393                      .dwendtag $C$DW$T$23
    4394              
    4395              
    4396              $C$DW$T$24      .dwtag  DW_TAG_union_type
    4397                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_REG")
    4398                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4399              $C$DW$639       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$22)
    4401                      .dwattr $C$DW$639, DW_AT_name("all")
    4402                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_all")
    4403                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4405              $C$DW$640       .dwtag  DW_TAG_member
    4406                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$23)
    4407                      .dwattr $C$DW$640, DW_AT_name("bit")
    4408                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_bit")
    4409                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4410                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   90

    4411                      .dwendtag $C$DW$T$24
    4412              
    4413              
    4414              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4415                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_BITS")
    4416                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4417              $C$DW$641       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$22)
    4419                      .dwattr $C$DW$641, DW_AT_name("RXFFIL")
    4420                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_RXFFIL")
    4421                      .dwattr $C$DW$641, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4422                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$642       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$22)
    4426                      .dwattr $C$DW$642, DW_AT_name("RXFFIENA")
    4427                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_RXFFIENA")
    4428                      .dwattr $C$DW$642, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4429                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4430                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$643       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$22)
    4433                      .dwattr $C$DW$643, DW_AT_name("RXFFINTCLR")
    4434                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_RXFFINTCLR")
    4435                      .dwattr $C$DW$643, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4436                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4437                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$644       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$22)
    4440                      .dwattr $C$DW$644, DW_AT_name("RXFFINT")
    4441                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_RXFFINT")
    4442                      .dwattr $C$DW$644, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4443                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$645       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$22)
    4447                      .dwattr $C$DW$645, DW_AT_name("RXFFST")
    4448                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_RXFFST")
    4449                      .dwattr $C$DW$645, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4450                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4451                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$646       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$22)
    4454                      .dwattr $C$DW$646, DW_AT_name("RXFFRST")
    4455                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_RXFFRST")
    4456                      .dwattr $C$DW$646, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4457                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4458                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$647       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$22)
    4461                      .dwattr $C$DW$647, DW_AT_name("rsvd1")
    4462                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_rsvd1")
    4463                      .dwattr $C$DW$647, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4464                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4465                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   91

    4466                      .dwendtag $C$DW$T$25
    4467              
    4468              
    4469              $C$DW$T$26      .dwtag  DW_TAG_union_type
    4470                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_REG")
    4471                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4472              $C$DW$648       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$22)
    4474                      .dwattr $C$DW$648, DW_AT_name("all")
    4475                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_all")
    4476                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4477                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$649       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$25)
    4480                      .dwattr $C$DW$649, DW_AT_name("bit")
    4481                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_bit")
    4482                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4483                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4484                      .dwendtag $C$DW$T$26
    4485              
    4486              
    4487              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4488                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_BITS")
    4489                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4490              $C$DW$650       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
    4492                      .dwattr $C$DW$650, DW_AT_name("TXFFIL")
    4493                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_TXFFIL")
    4494                      .dwattr $C$DW$650, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    4495                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4496                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$651       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$22)
    4499                      .dwattr $C$DW$651, DW_AT_name("TXFFIENA")
    4500                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_TXFFIENA")
    4501                      .dwattr $C$DW$651, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4502                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4503                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4504              $C$DW$652       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
    4506                      .dwattr $C$DW$652, DW_AT_name("TXFFINTCLR")
    4507                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_TXFFINTCLR")
    4508                      .dwattr $C$DW$652, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4509                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$653       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$22)
    4513                      .dwattr $C$DW$653, DW_AT_name("TXFFINT")
    4514                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_TXFFINT")
    4515                      .dwattr $C$DW$653, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4516                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4517                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$654       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$22)
    4520                      .dwattr $C$DW$654, DW_AT_name("TXFFST")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   92

    4521                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_TXFFST")
    4522                      .dwattr $C$DW$654, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    4523                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4524                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4525              $C$DW$655       .dwtag  DW_TAG_member
    4526                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$22)
    4527                      .dwattr $C$DW$655, DW_AT_name("TXFFRST")
    4528                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_TXFFRST")
    4529                      .dwattr $C$DW$655, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4530                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4531                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$656       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$22)
    4534                      .dwattr $C$DW$656, DW_AT_name("I2CFFEN")
    4535                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_I2CFFEN")
    4536                      .dwattr $C$DW$656, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4537                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4538                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$657       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$22)
    4541                      .dwattr $C$DW$657, DW_AT_name("rsvd1")
    4542                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_rsvd1")
    4543                      .dwattr $C$DW$657, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4544                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4545                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4546                      .dwendtag $C$DW$T$27
    4547              
    4548              
    4549              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4550                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_REG")
    4551                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    4552              $C$DW$658       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$22)
    4554                      .dwattr $C$DW$658, DW_AT_name("all")
    4555                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_all")
    4556                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4557                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4558              $C$DW$659       .dwtag  DW_TAG_member
    4559                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$27)
    4560                      .dwattr $C$DW$659, DW_AT_name("bit")
    4561                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_bit")
    4562                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4563                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4564                      .dwendtag $C$DW$T$28
    4565              
    4566              
    4567              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4568                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_BITS")
    4569                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4570              $C$DW$660       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$22)
    4572                      .dwattr $C$DW$660, DW_AT_name("ARBL")
    4573                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_ARBL")
    4574                      .dwattr $C$DW$660, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4575                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   93

    4576                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$661       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$22)
    4579                      .dwattr $C$DW$661, DW_AT_name("NACK")
    4580                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_NACK")
    4581                      .dwattr $C$DW$661, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4582                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4583                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$662       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$22)
    4586                      .dwattr $C$DW$662, DW_AT_name("ARDY")
    4587                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ARDY")
    4588                      .dwattr $C$DW$662, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4589                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4590                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$663       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$22)
    4593                      .dwattr $C$DW$663, DW_AT_name("RRDY")
    4594                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_RRDY")
    4595                      .dwattr $C$DW$663, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4596                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4597                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$664       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$22)
    4600                      .dwattr $C$DW$664, DW_AT_name("XRDY")
    4601                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_XRDY")
    4602                      .dwattr $C$DW$664, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4603                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4604                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4605              $C$DW$665       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$22)
    4607                      .dwattr $C$DW$665, DW_AT_name("SCD")
    4608                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_SCD")
    4609                      .dwattr $C$DW$665, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4610                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4611                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$666       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$22)
    4614                      .dwattr $C$DW$666, DW_AT_name("AAS")
    4615                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_AAS")
    4616                      .dwattr $C$DW$666, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4617                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4618                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$667       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$22)
    4621                      .dwattr $C$DW$667, DW_AT_name("rsvd")
    4622                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd")
    4623                      .dwattr $C$DW$667, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    4624                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4625                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4626                      .dwendtag $C$DW$T$29
    4627              
    4628              
    4629              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4630                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_REG")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   94

    4631                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4632              $C$DW$668       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$22)
    4634                      .dwattr $C$DW$668, DW_AT_name("all")
    4635                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_all")
    4636                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4637                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$669       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$29)
    4640                      .dwattr $C$DW$669, DW_AT_name("bit")
    4641                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_bit")
    4642                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4643                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4644                      .dwendtag $C$DW$T$30
    4645              
    4646              
    4647              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4648                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_BITS")
    4649                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    4650              $C$DW$670       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$22)
    4652                      .dwattr $C$DW$670, DW_AT_name("INTCODE")
    4653                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_INTCODE")
    4654                      .dwattr $C$DW$670, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4655                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4656                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4657              $C$DW$671       .dwtag  DW_TAG_member
    4658                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$22)
    4659                      .dwattr $C$DW$671, DW_AT_name("rsvd1")
    4660                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd1")
    4661                      .dwattr $C$DW$671, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    4662                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4663                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4664                      .dwendtag $C$DW$T$31
    4665              
    4666              
    4667              $C$DW$T$32      .dwtag  DW_TAG_union_type
    4668                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_REG")
    4669                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    4670              $C$DW$672       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$22)
    4672                      .dwattr $C$DW$672, DW_AT_name("all")
    4673                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_all")
    4674                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4675                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$673       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    4678                      .dwattr $C$DW$673, DW_AT_name("bit")
    4679                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_bit")
    4680                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4681                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4682                      .dwendtag $C$DW$T$32
    4683              
    4684              
    4685              $C$DW$T$33      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   95

    4686                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_BITS")
    4687                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    4688              $C$DW$674       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$22)
    4690                      .dwattr $C$DW$674, DW_AT_name("BC")
    4691                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_BC")
    4692                      .dwattr $C$DW$674, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4693                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4694                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4695              $C$DW$675       .dwtag  DW_TAG_member
    4696                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$22)
    4697                      .dwattr $C$DW$675, DW_AT_name("FDF")
    4698                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_FDF")
    4699                      .dwattr $C$DW$675, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4700                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4701                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4702              $C$DW$676       .dwtag  DW_TAG_member
    4703                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$22)
    4704                      .dwattr $C$DW$676, DW_AT_name("STB")
    4705                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_STB")
    4706                      .dwattr $C$DW$676, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4707                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4708                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4709              $C$DW$677       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$22)
    4711                      .dwattr $C$DW$677, DW_AT_name("IRS")
    4712                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_IRS")
    4713                      .dwattr $C$DW$677, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4714                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4715                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4716              $C$DW$678       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$22)
    4718                      .dwattr $C$DW$678, DW_AT_name("DLB")
    4719                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_DLB")
    4720                      .dwattr $C$DW$678, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4721                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4723              $C$DW$679       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$22)
    4725                      .dwattr $C$DW$679, DW_AT_name("RM")
    4726                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_RM")
    4727                      .dwattr $C$DW$679, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4728                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4729                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$680       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$22)
    4732                      .dwattr $C$DW$680, DW_AT_name("XA")
    4733                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_XA")
    4734                      .dwattr $C$DW$680, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4735                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4736                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$681       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$22)
    4739                      .dwattr $C$DW$681, DW_AT_name("TRX")
    4740                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_TRX")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   96

    4741                      .dwattr $C$DW$681, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4742                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4743                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4744              $C$DW$682       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$22)
    4746                      .dwattr $C$DW$682, DW_AT_name("MST")
    4747                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_MST")
    4748                      .dwattr $C$DW$682, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4749                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$683       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$22)
    4753                      .dwattr $C$DW$683, DW_AT_name("STP")
    4754                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_STP")
    4755                      .dwattr $C$DW$683, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4756                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4758              $C$DW$684       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$22)
    4760                      .dwattr $C$DW$684, DW_AT_name("rsvd1")
    4761                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_rsvd1")
    4762                      .dwattr $C$DW$684, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4763                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$685       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$22)
    4767                      .dwattr $C$DW$685, DW_AT_name("STT")
    4768                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_STT")
    4769                      .dwattr $C$DW$685, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4770                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$686       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$22)
    4774                      .dwattr $C$DW$686, DW_AT_name("FREE")
    4775                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_FREE")
    4776                      .dwattr $C$DW$686, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4777                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$687       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$22)
    4781                      .dwattr $C$DW$687, DW_AT_name("NACKMOD")
    4782                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_NACKMOD")
    4783                      .dwattr $C$DW$687, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4784                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4785                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4786                      .dwendtag $C$DW$T$33
    4787              
    4788              
    4789              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4790                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_REG")
    4791                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    4792              $C$DW$688       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$22)
    4794                      .dwattr $C$DW$688, DW_AT_name("all")
    4795                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   97

    4796                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4797                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4798              $C$DW$689       .dwtag  DW_TAG_member
    4799                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$33)
    4800                      .dwattr $C$DW$689, DW_AT_name("bit")
    4801                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_bit")
    4802                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4803                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4804                      .dwendtag $C$DW$T$34
    4805              
    4806              
    4807              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4808                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_BITS")
    4809                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4810              $C$DW$690       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$22)
    4812                      .dwattr $C$DW$690, DW_AT_name("IPSC")
    4813                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_IPSC")
    4814                      .dwattr $C$DW$690, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4815                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$691       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$22)
    4819                      .dwattr $C$DW$691, DW_AT_name("rsvd1")
    4820                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd1")
    4821                      .dwattr $C$DW$691, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4822                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4823                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4824                      .dwendtag $C$DW$T$35
    4825              
    4826              
    4827              $C$DW$T$36      .dwtag  DW_TAG_union_type
    4828                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_REG")
    4829                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4830              $C$DW$692       .dwtag  DW_TAG_member
    4831                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$22)
    4832                      .dwattr $C$DW$692, DW_AT_name("all")
    4833                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_all")
    4834                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4835                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4836              $C$DW$693       .dwtag  DW_TAG_member
    4837                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$35)
    4838                      .dwattr $C$DW$693, DW_AT_name("bit")
    4839                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_bit")
    4840                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4841                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4842                      .dwendtag $C$DW$T$36
    4843              
    4844              
    4845              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4846                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_BITS")
    4847                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4848              $C$DW$694       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$22)
    4850                      .dwattr $C$DW$694, DW_AT_name("ARBL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   98

    4851                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ARBL")
    4852                      .dwattr $C$DW$694, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4853                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4854                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4855              $C$DW$695       .dwtag  DW_TAG_member
    4856                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$22)
    4857                      .dwattr $C$DW$695, DW_AT_name("NACK")
    4858                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_NACK")
    4859                      .dwattr $C$DW$695, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4860                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4861                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4862              $C$DW$696       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$22)
    4864                      .dwattr $C$DW$696, DW_AT_name("ARDY")
    4865                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ARDY")
    4866                      .dwattr $C$DW$696, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4867                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4868                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$697       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$22)
    4871                      .dwattr $C$DW$697, DW_AT_name("RRDY")
    4872                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_RRDY")
    4873                      .dwattr $C$DW$697, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4874                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4875                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4876              $C$DW$698       .dwtag  DW_TAG_member
    4877                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$22)
    4878                      .dwattr $C$DW$698, DW_AT_name("XRDY")
    4879                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_XRDY")
    4880                      .dwattr $C$DW$698, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4881                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4882                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4883              $C$DW$699       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$22)
    4885                      .dwattr $C$DW$699, DW_AT_name("SCD")
    4886                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_SCD")
    4887                      .dwattr $C$DW$699, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4888                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4889                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$700       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$22)
    4892                      .dwattr $C$DW$700, DW_AT_name("rsvd1")
    4893                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd1")
    4894                      .dwattr $C$DW$700, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4895                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4896                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4897              $C$DW$701       .dwtag  DW_TAG_member
    4898                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$22)
    4899                      .dwattr $C$DW$701, DW_AT_name("AD0")
    4900                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_AD0")
    4901                      .dwattr $C$DW$701, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4902                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4903                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4904              $C$DW$702       .dwtag  DW_TAG_member
    4905                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE   99

    4906                      .dwattr $C$DW$702, DW_AT_name("AAS")
    4907                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_AAS")
    4908                      .dwattr $C$DW$702, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4909                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4910                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4911              $C$DW$703       .dwtag  DW_TAG_member
    4912                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$22)
    4913                      .dwattr $C$DW$703, DW_AT_name("XSMT")
    4914                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_XSMT")
    4915                      .dwattr $C$DW$703, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4916                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4917                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4918              $C$DW$704       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$22)
    4920                      .dwattr $C$DW$704, DW_AT_name("RSFULL")
    4921                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_RSFULL")
    4922                      .dwattr $C$DW$704, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4923                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4924                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4925              $C$DW$705       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$22)
    4927                      .dwattr $C$DW$705, DW_AT_name("BB")
    4928                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_BB")
    4929                      .dwattr $C$DW$705, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4930                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4931                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4932              $C$DW$706       .dwtag  DW_TAG_member
    4933                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$22)
    4934                      .dwattr $C$DW$706, DW_AT_name("NACKSNT")
    4935                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_NACKSNT")
    4936                      .dwattr $C$DW$706, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4937                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4938                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4939              $C$DW$707       .dwtag  DW_TAG_member
    4940                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$22)
    4941                      .dwattr $C$DW$707, DW_AT_name("SDIR")
    4942                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_SDIR")
    4943                      .dwattr $C$DW$707, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4944                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4945                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4946              $C$DW$708       .dwtag  DW_TAG_member
    4947                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$22)
    4948                      .dwattr $C$DW$708, DW_AT_name("rsvd2")
    4949                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_rsvd2")
    4950                      .dwattr $C$DW$708, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4951                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4952                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4953                      .dwendtag $C$DW$T$37
    4954              
    4955              
    4956              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4957                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_REG")
    4958                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4959              $C$DW$709       .dwtag  DW_TAG_member
    4960                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  100

    4961                      .dwattr $C$DW$709, DW_AT_name("all")
    4962                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_all")
    4963                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4964                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4965              $C$DW$710       .dwtag  DW_TAG_member
    4966                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$37)
    4967                      .dwattr $C$DW$710, DW_AT_name("bit")
    4968                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_bit")
    4969                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4970                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4971                      .dwendtag $C$DW$T$38
    4972              
    4973              
    4974              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4975                      .dwattr $C$DW$T$46, DW_AT_name("_ADC_Obj_")
    4976                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x6650)
    4977              $C$DW$711       .dwtag  DW_TAG_member
    4978                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$40)
    4979                      .dwattr $C$DW$711, DW_AT_name("ADCRESULT")
    4980                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_ADCRESULT")
    4981                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4982                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4983              $C$DW$712       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$41)
    4985                      .dwattr $C$DW$712, DW_AT_name("resvd_1")
    4986                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_resvd_1")
    4987                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4988                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$713       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$39)
    4991                      .dwattr $C$DW$713, DW_AT_name("ADCCTL1")
    4992                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_ADCCTL1")
    4993                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4994                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$714       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$39)
    4997                      .dwattr $C$DW$714, DW_AT_name("ADCCTL2")
    4998                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_ADCCTL2")
    4999                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    5000                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$715       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$42)
    5003                      .dwattr $C$DW$715, DW_AT_name("rsvd_2")
    5004                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_2")
    5005                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    5006                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    5007              $C$DW$716       .dwtag  DW_TAG_member
    5008                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$39)
    5009                      .dwattr $C$DW$716, DW_AT_name("ADCINTFLG")
    5010                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_ADCINTFLG")
    5011                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    5012                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    5013              $C$DW$717       .dwtag  DW_TAG_member
    5014                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$39)
    5015                      .dwattr $C$DW$717, DW_AT_name("ADCINTFLGCLR")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  101

    5016                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    5017                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    5018                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    5019              $C$DW$718       .dwtag  DW_TAG_member
    5020                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$39)
    5021                      .dwattr $C$DW$718, DW_AT_name("ADCINTOVF")
    5022                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ADCINTOVF")
    5023                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    5024                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$719       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$39)
    5027                      .dwattr $C$DW$719, DW_AT_name("ADCINTOVFCLR")
    5028                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    5029                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    5030                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    5031              $C$DW$720       .dwtag  DW_TAG_member
    5032                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$43)
    5033                      .dwattr $C$DW$720, DW_AT_name("INTSELxNy")
    5034                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_INTSELxNy")
    5035                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    5036                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    5037              $C$DW$721       .dwtag  DW_TAG_member
    5038                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$44)
    5039                      .dwattr $C$DW$721, DW_AT_name("rsvd_3")
    5040                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_3")
    5041                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    5042                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$722       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$39)
    5045                      .dwattr $C$DW$722, DW_AT_name("SOCPRICTRL")
    5046                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_SOCPRICTRL")
    5047                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    5048                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    5049              $C$DW$723       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$39)
    5051                      .dwattr $C$DW$723, DW_AT_name("rsvd_4")
    5052                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_rsvd_4")
    5053                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    5054                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$724       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$39)
    5057                      .dwattr $C$DW$724, DW_AT_name("ADCSAMPLEMODE")
    5058                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    5059                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    5060                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$725       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$39)
    5063                      .dwattr $C$DW$725, DW_AT_name("rsvd_5")
    5064                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_rsvd_5")
    5065                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    5066                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$726       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    5069                      .dwattr $C$DW$726, DW_AT_name("ADCINTSOCSEL1")
    5070                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  102

    5071                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    5072                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$727       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$39)
    5075                      .dwattr $C$DW$727, DW_AT_name("ADCINTSOCSEL2")
    5076                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    5077                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    5078                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5079              $C$DW$728       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$42)
    5081                      .dwattr $C$DW$728, DW_AT_name("rsvd_6")
    5082                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_rsvd_6")
    5083                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    5084                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$729       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$39)
    5087                      .dwattr $C$DW$729, DW_AT_name("ADCSOCFLG1")
    5088                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    5089                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    5090                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5091              $C$DW$730       .dwtag  DW_TAG_member
    5092                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$39)
    5093                      .dwattr $C$DW$730, DW_AT_name("rsvd_7")
    5094                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_rsvd_7")
    5095                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    5096                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5097              $C$DW$731       .dwtag  DW_TAG_member
    5098                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$39)
    5099                      .dwattr $C$DW$731, DW_AT_name("ADCSOCFRC1")
    5100                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    5101                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    5102                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5103              $C$DW$732       .dwtag  DW_TAG_member
    5104                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$39)
    5105                      .dwattr $C$DW$732, DW_AT_name("rsvd_8")
    5106                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_rsvd_8")
    5107                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    5108                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5109              $C$DW$733       .dwtag  DW_TAG_member
    5110                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$39)
    5111                      .dwattr $C$DW$733, DW_AT_name("ADCSOCOVF1")
    5112                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    5113                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    5114                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5115              $C$DW$734       .dwtag  DW_TAG_member
    5116                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$39)
    5117                      .dwattr $C$DW$734, DW_AT_name("rsvd_9")
    5118                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_rsvd_9")
    5119                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    5120                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5121              $C$DW$735       .dwtag  DW_TAG_member
    5122                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$39)
    5123                      .dwattr $C$DW$735, DW_AT_name("ADCSOCOVFCLR1")
    5124                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    5125                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  103

    5126                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5127              $C$DW$736       .dwtag  DW_TAG_member
    5128                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$39)
    5129                      .dwattr $C$DW$736, DW_AT_name("rsvd_10")
    5130                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_rsvd_10")
    5131                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    5132                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$737       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$40)
    5135                      .dwattr $C$DW$737, DW_AT_name("ADCSOCxCTL")
    5136                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    5137                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    5138                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5139              $C$DW$738       .dwtag  DW_TAG_member
    5140                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$40)
    5141                      .dwattr $C$DW$738, DW_AT_name("rsvd_11")
    5142                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd_11")
    5143                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    5144                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5145              $C$DW$739       .dwtag  DW_TAG_member
    5146                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$39)
    5147                      .dwattr $C$DW$739, DW_AT_name("ADCREFTRIM")
    5148                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_ADCREFTRIM")
    5149                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    5150                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5151              $C$DW$740       .dwtag  DW_TAG_member
    5152                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$39)
    5153                      .dwattr $C$DW$740, DW_AT_name("ADCOFFTRIM")
    5154                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    5155                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    5156                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5157              $C$DW$741       .dwtag  DW_TAG_member
    5158                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$45)
    5159                      .dwattr $C$DW$741, DW_AT_name("resvd_12")
    5160                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_resvd_12")
    5161                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    5162                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5163              $C$DW$742       .dwtag  DW_TAG_member
    5164                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$39)
    5165                      .dwattr $C$DW$742, DW_AT_name("ADCREV")
    5166                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ADCREV")
    5167                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    5168                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5169                      .dwendtag $C$DW$T$46
    5170              
    5171              $C$DW$T$208     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    5172                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$46)
    5173                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    5174              $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    5175                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$46)
    5176                      .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    5177              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    5178                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    5179                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    5180              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  104

    5181              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    5182                      .dwattr $C$DW$T$49, DW_AT_name("_CLARKE_Obj_")
    5183                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    5184              $C$DW$743       .dwtag  DW_TAG_member
    5185                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$47)
    5186                      .dwattr $C$DW$743, DW_AT_name("alpha_sf")
    5187                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_alpha_sf")
    5188                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5189                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5190              $C$DW$744       .dwtag  DW_TAG_member
    5191                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$47)
    5192                      .dwattr $C$DW$744, DW_AT_name("beta_sf")
    5193                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_beta_sf")
    5194                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5195                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5196              $C$DW$745       .dwtag  DW_TAG_member
    5197                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$48)
    5198                      .dwattr $C$DW$745, DW_AT_name("numSensors")
    5199                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_numSensors")
    5200                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5201                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5202                      .dwendtag $C$DW$T$49
    5203              
    5204              $C$DW$T$209     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    5205                      .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$49)
    5206                      .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    5207              $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    5208                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$49)
    5209                      .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    5210              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    5211                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$210)
    5212                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    5213              $C$DW$746       .dwtag  DW_TAG_TI_far_type
    5214                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$211)
    5215              $C$DW$T$212     .dwtag  DW_TAG_const_type
    5216                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$746)
    5217              
    5218              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5219                      .dwattr $C$DW$T$51, DW_AT_name("_CLK_Obj_")
    5220                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x11)
    5221              $C$DW$747       .dwtag  DW_TAG_member
    5222                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$39)
    5223                      .dwattr $C$DW$747, DW_AT_name("XCLK")
    5224                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_XCLK")
    5225                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5226                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5227              $C$DW$748       .dwtag  DW_TAG_member
    5228                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$39)
    5229                      .dwattr $C$DW$748, DW_AT_name("rsvd_1")
    5230                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_rsvd_1")
    5231                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5232                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5233              $C$DW$749       .dwtag  DW_TAG_member
    5234                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$39)
    5235                      .dwattr $C$DW$749, DW_AT_name("CLKCTL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  105

    5236                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_CLKCTL")
    5237                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5238                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5239              $C$DW$750       .dwtag  DW_TAG_member
    5240                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$50)
    5241                      .dwattr $C$DW$750, DW_AT_name("rsvd_2")
    5242                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_rsvd_2")
    5243                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5244                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5245              $C$DW$751       .dwtag  DW_TAG_member
    5246                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$39)
    5247                      .dwattr $C$DW$751, DW_AT_name("LOSPCP")
    5248                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_LOSPCP")
    5249                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5250                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5251              $C$DW$752       .dwtag  DW_TAG_member
    5252                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$39)
    5253                      .dwattr $C$DW$752, DW_AT_name("PCLKCR0")
    5254                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_PCLKCR0")
    5255                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5256                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5257              $C$DW$753       .dwtag  DW_TAG_member
    5258                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$39)
    5259                      .dwattr $C$DW$753, DW_AT_name("PCLKCR1")
    5260                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_PCLKCR1")
    5261                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5262                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5263              $C$DW$754       .dwtag  DW_TAG_member
    5264                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$42)
    5265                      .dwattr $C$DW$754, DW_AT_name("rsvd_3")
    5266                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_rsvd_3")
    5267                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5268                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5269              $C$DW$755       .dwtag  DW_TAG_member
    5270                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$39)
    5271                      .dwattr $C$DW$755, DW_AT_name("PCLKCR3")
    5272                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_PCLKCR3")
    5273                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5274                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5275                      .dwendtag $C$DW$T$51
    5276              
    5277              $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    5278                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$51)
    5279                      .dwattr $C$DW$T$102, DW_AT_address_class(0x20)
    5280              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    5281                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    5282                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    5283              
    5284              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    5285                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_Obj_")
    5286                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    5287              $C$DW$756       .dwtag  DW_TAG_member
    5288                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$48)
    5289                      .dwattr $C$DW$756, DW_AT_name("tmp")
    5290                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_tmp")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  106

    5291                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5292                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5293                      .dwendtag $C$DW$T$52
    5294              
    5295              $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    5296                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$52)
    5297                      .dwattr $C$DW$T$104, DW_AT_address_class(0x20)
    5298              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    5299                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    5300                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    5301              
    5302              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    5303                      .dwattr $C$DW$T$55, DW_AT_name("_CTRL_Version_")
    5304                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    5305              $C$DW$757       .dwtag  DW_TAG_member
    5306                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$22)
    5307                      .dwattr $C$DW$757, DW_AT_name("rsvd")
    5308                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_rsvd")
    5309                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5310                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5311              $C$DW$758       .dwtag  DW_TAG_member
    5312                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$54)
    5313                      .dwattr $C$DW$758, DW_AT_name("targetProc")
    5314                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_targetProc")
    5315                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5316                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5317              $C$DW$759       .dwtag  DW_TAG_member
    5318                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$22)
    5319                      .dwattr $C$DW$759, DW_AT_name("major")
    5320                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_major")
    5321                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5322                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5323              $C$DW$760       .dwtag  DW_TAG_member
    5324                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$22)
    5325                      .dwattr $C$DW$760, DW_AT_name("minor")
    5326                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_minor")
    5327                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5328                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5329                      .dwendtag $C$DW$T$55
    5330              
    5331              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5332                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$55)
    5333                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    5334              
    5335              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    5336                      .dwattr $C$DW$T$63, DW_AT_name("_DRV8301_Obj_")
    5337                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    5338              $C$DW$761       .dwtag  DW_TAG_member
    5339                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$57)
    5340                      .dwattr $C$DW$761, DW_AT_name("spiHandle")
    5341                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_spiHandle")
    5342                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5343                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5344              $C$DW$762       .dwtag  DW_TAG_member
    5345                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  107

    5346                      .dwattr $C$DW$762, DW_AT_name("gpioHandle")
    5347                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_gpioHandle")
    5348                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5349                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5350              $C$DW$763       .dwtag  DW_TAG_member
    5351                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$61)
    5352                      .dwattr $C$DW$763, DW_AT_name("gpioNumber")
    5353                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_gpioNumber")
    5354                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5355                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5356              $C$DW$764       .dwtag  DW_TAG_member
    5357                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$62)
    5358                      .dwattr $C$DW$764, DW_AT_name("RxTimeOut")
    5359                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_RxTimeOut")
    5360                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5361                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5362              $C$DW$765       .dwtag  DW_TAG_member
    5363                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$62)
    5364                      .dwattr $C$DW$765, DW_AT_name("enableTimeOut")
    5365                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_enableTimeOut")
    5366                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5367                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5368                      .dwendtag $C$DW$T$63
    5369              
    5370              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    5371                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$63)
    5372                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    5373              $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    5374                      .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$63)
    5375                      .dwattr $C$DW$T$131, DW_AT_address_class(0x20)
    5376              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    5377                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    5378                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    5379              
    5380              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5381                      .dwattr $C$DW$T$74, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5382                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x05)
    5383              $C$DW$766       .dwtag  DW_TAG_member
    5384                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$65)
    5385                      .dwattr $C$DW$766, DW_AT_name("DRV8301_CURRENT")
    5386                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5387                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5388                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5389              $C$DW$767       .dwtag  DW_TAG_member
    5390                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$67)
    5391                      .dwattr $C$DW$767, DW_AT_name("DRV8301_RESET")
    5392                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5393                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5394                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5395              $C$DW$768       .dwtag  DW_TAG_member
    5396                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$69)
    5397                      .dwattr $C$DW$768, DW_AT_name("PWM_MODE")
    5398                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_PWM_MODE")
    5399                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5400                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  108

    5401              $C$DW$769       .dwtag  DW_TAG_member
    5402                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$71)
    5403                      .dwattr $C$DW$769, DW_AT_name("OC_MODE")
    5404                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_OC_MODE")
    5405                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5406                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5407              $C$DW$770       .dwtag  DW_TAG_member
    5408                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$73)
    5409                      .dwattr $C$DW$770, DW_AT_name("OC_ADJ_SET")
    5410                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5411                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5412                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5413                      .dwendtag $C$DW$T$74
    5414              
    5415              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5416                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$74)
    5417                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    5418              
    5419              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    5420                      .dwattr $C$DW$T$83, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5421                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x04)
    5422              $C$DW$771       .dwtag  DW_TAG_member
    5423                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$76)
    5424                      .dwattr $C$DW$771, DW_AT_name("OCTW_SET")
    5425                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_OCTW_SET")
    5426                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5427                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5428              $C$DW$772       .dwtag  DW_TAG_member
    5429                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$78)
    5430                      .dwattr $C$DW$772, DW_AT_name("GAIN")
    5431                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_GAIN")
    5432                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5433                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5434              $C$DW$773       .dwtag  DW_TAG_member
    5435                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$80)
    5436                      .dwattr $C$DW$773, DW_AT_name("DC_CAL_CH1p2")
    5437                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5438                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5439                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5440              $C$DW$774       .dwtag  DW_TAG_member
    5441                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$82)
    5442                      .dwattr $C$DW$774, DW_AT_name("OC_TOFF")
    5443                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_OC_TOFF")
    5444                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5445                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5446                      .dwendtag $C$DW$T$83
    5447              
    5448              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5449                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$83)
    5450                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    5451              
    5452              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    5453                      .dwattr $C$DW$T$84, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5454                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x0b)
    5455              $C$DW$775       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  109

    5456                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$62)
    5457                      .dwattr $C$DW$775, DW_AT_name("FAULT")
    5458                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_FAULT")
    5459                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5460                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5461              $C$DW$776       .dwtag  DW_TAG_member
    5462                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$62)
    5463                      .dwattr $C$DW$776, DW_AT_name("GVDD_UV")
    5464                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_GVDD_UV")
    5465                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5466                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5467              $C$DW$777       .dwtag  DW_TAG_member
    5468                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$62)
    5469                      .dwattr $C$DW$777, DW_AT_name("PVDD_UV")
    5470                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_PVDD_UV")
    5471                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5472                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5473              $C$DW$778       .dwtag  DW_TAG_member
    5474                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$62)
    5475                      .dwattr $C$DW$778, DW_AT_name("OTSD")
    5476                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_OTSD")
    5477                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5478                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5479              $C$DW$779       .dwtag  DW_TAG_member
    5480                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$62)
    5481                      .dwattr $C$DW$779, DW_AT_name("OTW")
    5482                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_OTW")
    5483                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5484                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5485              $C$DW$780       .dwtag  DW_TAG_member
    5486                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$62)
    5487                      .dwattr $C$DW$780, DW_AT_name("FETHA_OC")
    5488                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FETHA_OC")
    5489                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5490                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    5491              $C$DW$781       .dwtag  DW_TAG_member
    5492                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$62)
    5493                      .dwattr $C$DW$781, DW_AT_name("FETLA_OC")
    5494                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FETLA_OC")
    5495                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5496                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5497              $C$DW$782       .dwtag  DW_TAG_member
    5498                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$62)
    5499                      .dwattr $C$DW$782, DW_AT_name("FETHB_OC")
    5500                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_FETHB_OC")
    5501                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5502                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5503              $C$DW$783       .dwtag  DW_TAG_member
    5504                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$62)
    5505                      .dwattr $C$DW$783, DW_AT_name("FETLB_OC")
    5506                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_FETLB_OC")
    5507                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5508                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5509              $C$DW$784       .dwtag  DW_TAG_member
    5510                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:57 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0350410                            PAGE  110

    5511                      .dwattr $C$DW$784, DW_AT_name("FETHC_OC")
    5512                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_FETHC_OC")
    5513                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5514                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5515              $C$DW$785       .dwtag  DW_TAG_member
    5516                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$62)
    5517                      .dwattr $C$DW$785, DW_AT_name("FETLC_OC")
    5518                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_FETLC_OC")
    5519                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5520                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5521                      .dwendtag $C$DW$T$84
    5522              
    5523              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5524                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$84)
    5525                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    5526              
    5527              $C$DW$T$85      .dwtag  DW_TAG_structure_type
    5528                      .dwattr $C$DW$T$85, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5529                      .dwattr $C$DW$T$85, DW_AT_byte_size(0x02)
    5530              $C$DW$786       .dwtag  DW_TAG_member
    5531                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$62)
    5532                      .dwattr $C$DW$786, DW_AT_name("GVDD_OV")
    5533                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_GVDD_OV")
    5534                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5535                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5536              $C$DW$787       .dwtag  DW_TAG_member
    5537                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$22)
    5538                      .dwattr $C$DW$787, DW_AT_name("DeviceID")
    5539                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_DeviceID")
    5540                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5541                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5542                      .dwendtag $C$DW$T$85
    5543              
    5544              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    5545                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$85)
    5546                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    5547              
    5548              $C$DW$T$90      .dwtag  DW_TAG_structure_type
