TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:58:58 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    2527              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_Low"), DW_AT_const_value(0x4
    2528              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    2529              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    2530              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    2531              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    2532              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    2533              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    2534              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    2535              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    2536              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2537              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2538              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2539              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2540              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2541              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2542              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2543              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2544              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2545              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2546              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2547              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2548              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2549              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2550              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2551              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2552              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2553              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2554              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2555              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2556              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2557              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2558              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2559              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2560              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2561              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2562              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2563                      .dwendtag $C$DW$T$74
    2564              
    2565              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   52

    2566                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2567                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2568              $C$DW$314       .dwtag  DW_TAG_TI_far_type
    2569                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$75)
    2570              $C$DW$T$77      .dwtag  DW_TAG_const_type
    2571                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$314)
    2572              
    2573              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2574                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2575                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2576              $C$DW$315       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    2578                      .dwattr $C$DW$315, DW_AT_name("alpha_sf")
    2579                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_alpha_sf")
    2580                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2582              $C$DW$316       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2584                      .dwattr $C$DW$316, DW_AT_name("beta_sf")
    2585                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_beta_sf")
    2586                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2587                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$317       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$22)
    2590                      .dwattr $C$DW$317, DW_AT_name("numSensors")
    2591                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_numSensors")
    2592                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2593                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2594                      .dwendtag $C$DW$T$23
    2595              
    2596              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2597                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2598                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2599              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2600                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2601                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2602              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2603                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2604                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2605              
    2606              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2607                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2608                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2609              $C$DW$318       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$24)
    2611                      .dwattr $C$DW$318, DW_AT_name("version")
    2612                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_version")
    2613                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2615              $C$DW$319       .dwtag  DW_TAG_member
    2616                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$26)
    2617                      .dwattr $C$DW$319, DW_AT_name("state")
    2618                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_state")
    2619                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2620                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   53

    2621              $C$DW$320       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$26)
    2623                      .dwattr $C$DW$320, DW_AT_name("prevState")
    2624                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_prevState")
    2625                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2626                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2627              $C$DW$321       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$28)
    2629                      .dwattr $C$DW$321, DW_AT_name("errorCode")
    2630                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_errorCode")
    2631                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2632                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2633              $C$DW$322       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$30)
    2635                      .dwattr $C$DW$322, DW_AT_name("clarkeHandle_I")
    2636                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2637                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2638                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$323       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$31)
    2641                      .dwattr $C$DW$323, DW_AT_name("clarke_I")
    2642                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_clarke_I")
    2643                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2644                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2645              $C$DW$324       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$30)
    2647                      .dwattr $C$DW$324, DW_AT_name("clarkeHandle_V")
    2648                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_clarkeHandle_V")
    2649                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2650                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2651              $C$DW$325       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$31)
    2653                      .dwattr $C$DW$325, DW_AT_name("clarke_V")
    2654                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_clarke_V")
    2655                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2656                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2657              $C$DW$326       .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$33)
    2659                      .dwattr $C$DW$326, DW_AT_name("estHandle")
    2660                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_estHandle")
    2661                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2662                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2663              $C$DW$327       .dwtag  DW_TAG_member
    2664                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$35)
    2665                      .dwattr $C$DW$327, DW_AT_name("parkHandle")
    2666                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_parkHandle")
    2667                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2668                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2669              $C$DW$328       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$36)
    2671                      .dwattr $C$DW$328, DW_AT_name("park")
    2672                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_park")
    2673                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2674                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2675              $C$DW$329       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   54

    2676                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$38)
    2677                      .dwattr $C$DW$329, DW_AT_name("pidHandle_Id")
    2678                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_pidHandle_Id")
    2679                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2680                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2681              $C$DW$330       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$39)
    2683                      .dwattr $C$DW$330, DW_AT_name("pid_Id")
    2684                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_pid_Id")
    2685                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2686                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2687              $C$DW$331       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$38)
    2689                      .dwattr $C$DW$331, DW_AT_name("pidHandle_Iq")
    2690                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_pidHandle_Iq")
    2691                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2692                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2693              $C$DW$332       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$39)
    2695                      .dwattr $C$DW$332, DW_AT_name("pid_Iq")
    2696                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_pid_Iq")
    2697                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2698                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2699              $C$DW$333       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$38)
    2701                      .dwattr $C$DW$333, DW_AT_name("pidHandle_spd")
    2702                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_pidHandle_spd")
    2703                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2704                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2705              $C$DW$334       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$39)
    2707                      .dwattr $C$DW$334, DW_AT_name("pid_spd")
    2708                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_pid_spd")
    2709                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2710                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2711              $C$DW$335       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$41)
    2713                      .dwattr $C$DW$335, DW_AT_name("iparkHandle")
    2714                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_iparkHandle")
    2715                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2716                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2717              $C$DW$336       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$42)
    2719                      .dwattr $C$DW$336, DW_AT_name("ipark")
    2720                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_ipark")
    2721                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2722                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$337       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$44)
    2725                      .dwattr $C$DW$337, DW_AT_name("svgenHandle")
    2726                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_svgenHandle")
    2727                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2728                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$338       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$45)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   55

    2731                      .dwattr $C$DW$338, DW_AT_name("svgen")
    2732                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_svgen")
    2733                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2734                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2735              $C$DW$339       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$47)
    2737                      .dwattr $C$DW$339, DW_AT_name("trajHandle_Id")
    2738                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_trajHandle_Id")
    2739                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2740                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2741              $C$DW$340       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$48)
    2743                      .dwattr $C$DW$340, DW_AT_name("traj_Id")
    2744                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_traj_Id")
    2745                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2746                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2747              $C$DW$341       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$47)
    2749                      .dwattr $C$DW$341, DW_AT_name("trajHandle_spd")
    2750                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_trajHandle_spd")
    2751                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2752                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2753              $C$DW$342       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$48)
    2755                      .dwattr $C$DW$342, DW_AT_name("traj_spd")
    2756                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_traj_spd")
    2757                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2758                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2759              $C$DW$343       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$47)
    2761                      .dwattr $C$DW$343, DW_AT_name("trajHandle_spdMax")
    2762                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    2763                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2764                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2765              $C$DW$344       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$48)
    2767                      .dwattr $C$DW$344, DW_AT_name("traj_spdMax")
    2768                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_traj_spdMax")
    2769                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2770                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2771              $C$DW$345       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$49)
    2773                      .dwattr $C$DW$345, DW_AT_name("motorParams")
    2774                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_motorParams")
    2775                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2776                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2777              $C$DW$346       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$52)
    2779                      .dwattr $C$DW$346, DW_AT_name("waitTimes")
    2780                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_waitTimes")
    2781                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2782                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2783              $C$DW$347       .dwtag  DW_TAG_member
    2784                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$51)
    2785                      .dwattr $C$DW$347, DW_AT_name("counter_state")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   56

    2786                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_counter_state")
    2787                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2788                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2789              $C$DW$348       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$53)
    2791                      .dwattr $C$DW$348, DW_AT_name("numIsrTicksPerCtrlTick")
    2792                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    2793                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2794                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2795              $C$DW$349       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$53)
    2797                      .dwattr $C$DW$349, DW_AT_name("numCtrlTicksPerCurrentTick")
    2798                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    2799                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    2800                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$350       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$53)
    2803                      .dwattr $C$DW$350, DW_AT_name("numCtrlTicksPerSpeedTick")
    2804                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    2805                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2806                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2807              $C$DW$351       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$53)
    2809                      .dwattr $C$DW$351, DW_AT_name("numCtrlTicksPerTrajTick")
    2810                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    2811                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    2812                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2813              $C$DW$352       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$51)
    2815                      .dwattr $C$DW$352, DW_AT_name("ctrlFreq_Hz")
    2816                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    2817                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2818                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2819              $C$DW$353       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$51)
    2821                      .dwattr $C$DW$353, DW_AT_name("trajFreq_Hz")
    2822                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_trajFreq_Hz")
    2823                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2824                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$354       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    2827                      .dwattr $C$DW$354, DW_AT_name("trajPeriod_sec")
    2828                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_trajPeriod_sec")
    2829                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2830                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2831              $C$DW$355       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$54)
    2833                      .dwattr $C$DW$355, DW_AT_name("ctrlPeriod_sec")
    2834                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    2835                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2836                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2837              $C$DW$356       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2839                      .dwattr $C$DW$356, DW_AT_name("maxVsMag_pu")
    2840                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_maxVsMag_pu")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   57

    2841                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2842                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2843              $C$DW$357       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$55)
    2845                      .dwattr $C$DW$357, DW_AT_name("Iab_in")
    2846                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Iab_in")
    2847                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2848                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2849              $C$DW$358       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$55)
    2851                      .dwattr $C$DW$358, DW_AT_name("Iab_filt")
    2852                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Iab_filt")
    2853                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2854                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2855              $C$DW$359       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$55)
    2857                      .dwattr $C$DW$359, DW_AT_name("Idq_in")
    2858                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Idq_in")
    2859                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2860                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2861              $C$DW$360       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$55)
    2863                      .dwattr $C$DW$360, DW_AT_name("Vab_in")
    2864                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Vab_in")
    2865                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2866                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2867              $C$DW$361       .dwtag  DW_TAG_member
    2868                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    2869                      .dwattr $C$DW$361, DW_AT_name("spd_out")
    2870                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_spd_out")
    2871                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2872                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2873              $C$DW$362       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$55)
    2875                      .dwattr $C$DW$362, DW_AT_name("Vab_out")
    2876                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Vab_out")
    2877                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2878                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2879              $C$DW$363       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$55)
    2881                      .dwattr $C$DW$363, DW_AT_name("Vdq_out")
    2882                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Vdq_out")
    2883                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2884                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2885              $C$DW$364       .dwtag  DW_TAG_member
    2886                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$54)
    2887                      .dwattr $C$DW$364, DW_AT_name("Rhf")
    2888                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Rhf")
    2889                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2890                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$365       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$54)
    2893                      .dwattr $C$DW$365, DW_AT_name("Lhf")
    2894                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Lhf")
    2895                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   58

    2896                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2897              $C$DW$366       .dwtag  DW_TAG_member
    2898                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$54)
    2899                      .dwattr $C$DW$366, DW_AT_name("RoverL")
    2900                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RoverL")
    2901                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2902                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2903              $C$DW$367       .dwtag  DW_TAG_member
    2904                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2905                      .dwattr $C$DW$367, DW_AT_name("Kp_Id")
    2906                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Kp_Id")
    2907                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2908                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2909              $C$DW$368       .dwtag  DW_TAG_member
    2910                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2911                      .dwattr $C$DW$368, DW_AT_name("Kp_Iq")
    2912                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Kp_Iq")
    2913                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2914                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2915              $C$DW$369       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2917                      .dwattr $C$DW$369, DW_AT_name("Kp_spd")
    2918                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Kp_spd")
    2919                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2920                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$370       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2923                      .dwattr $C$DW$370, DW_AT_name("Ki_Id")
    2924                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Ki_Id")
    2925                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2926                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2927              $C$DW$371       .dwtag  DW_TAG_member
    2928                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2929                      .dwattr $C$DW$371, DW_AT_name("Ki_Iq")
    2930                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Ki_Iq")
    2931                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2932                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2933              $C$DW$372       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2935                      .dwattr $C$DW$372, DW_AT_name("Ki_spd")
    2936                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Ki_spd")
    2937                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2938                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$373       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2941                      .dwattr $C$DW$373, DW_AT_name("Kd_Id")
    2942                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Kd_Id")
    2943                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2944                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$374       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2947                      .dwattr $C$DW$374, DW_AT_name("Kd_Iq")
    2948                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Kd_Iq")
    2949                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2950                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   59

    2951              $C$DW$375       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2953                      .dwattr $C$DW$375, DW_AT_name("Kd_spd")
    2954                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Kd_spd")
    2955                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2956                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2957              $C$DW$376       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2959                      .dwattr $C$DW$376, DW_AT_name("Ui_Id")
    2960                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Ui_Id")
    2961                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2962                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$377       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2965                      .dwattr $C$DW$377, DW_AT_name("Ui_Iq")
    2966                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Ui_Iq")
    2967                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2968                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$378       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    2971                      .dwattr $C$DW$378, DW_AT_name("Ui_spd")
    2972                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Ui_spd")
    2973                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2974                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2975              $C$DW$379       .dwtag  DW_TAG_member
    2976                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$55)
    2977                      .dwattr $C$DW$379, DW_AT_name("Idq_ref")
    2978                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_Idq_ref")
    2979                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2980                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$380       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    2983                      .dwattr $C$DW$380, DW_AT_name("IdRated")
    2984                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_IdRated")
    2985                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2986                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$381       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    2989                      .dwattr $C$DW$381, DW_AT_name("spd_ref")
    2990                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_spd_ref")
    2991                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2992                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2993              $C$DW$382       .dwtag  DW_TAG_member
    2994                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2995                      .dwattr $C$DW$382, DW_AT_name("spd_max")
    2996                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_spd_max")
    2997                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2998                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2999              $C$DW$383       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    3001                      .dwattr $C$DW$383, DW_AT_name("counter_current")
    3002                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_counter_current")
    3003                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3004                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$384       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   60

    3006                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3007                      .dwattr $C$DW$384, DW_AT_name("counter_isr")
    3008                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_counter_isr")
    3009                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3010                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3011              $C$DW$385       .dwtag  DW_TAG_member
    3012                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$53)
    3013                      .dwattr $C$DW$385, DW_AT_name("counter_speed")
    3014                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_counter_speed")
    3015                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3016                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3017              $C$DW$386       .dwtag  DW_TAG_member
    3018                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$53)
    3019                      .dwattr $C$DW$386, DW_AT_name("counter_traj")
    3020                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_counter_traj")
    3021                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3022                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3023              $C$DW$387       .dwtag  DW_TAG_member
    3024                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$56)
    3025                      .dwattr $C$DW$387, DW_AT_name("flag_enableCtrl")
    3026                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3027                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3028                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$388       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$56)
    3031                      .dwattr $C$DW$388, DW_AT_name("flag_enableDcBusComp")
    3032                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3033                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3034                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3035              $C$DW$389       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$56)
    3037                      .dwattr $C$DW$389, DW_AT_name("flag_enablePowerWarp")
    3038                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3039                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3040                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3041              $C$DW$390       .dwtag  DW_TAG_member
    3042                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$56)
    3043                      .dwattr $C$DW$390, DW_AT_name("flag_enableOffset")
    3044                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_flag_enableOffset")
    3045                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3046                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$391       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$56)
    3049                      .dwattr $C$DW$391, DW_AT_name("flag_enableSpeedCtrl")
    3050                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3051                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3052                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3053              $C$DW$392       .dwtag  DW_TAG_member
    3054                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$56)
    3055                      .dwattr $C$DW$392, DW_AT_name("flag_enableUserMotorParams")
    3056                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3057                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3058                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3059              $C$DW$393       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   61

    3061                      .dwattr $C$DW$393, DW_AT_name("Idq_offset_pu")
    3062                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3063                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3064                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3065              $C$DW$394       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$55)
    3067                      .dwattr $C$DW$394, DW_AT_name("Vdq_offset_pu")
    3068                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3069                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3070                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$395       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    3073                      .dwattr $C$DW$395, DW_AT_name("angle_pu")
    3074                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_angle_pu")
    3075                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3076                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3077              $C$DW$396       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3079                      .dwattr $C$DW$396, DW_AT_name("speed_ref_pu")
    3080                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_speed_ref_pu")
    3081                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3082                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$397       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3085                      .dwattr $C$DW$397, DW_AT_name("speed_fb_pu")
    3086                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_speed_fb_pu")
    3087                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3088                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$398       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3091                      .dwattr $C$DW$398, DW_AT_name("speed_outMax_pu")
    3092                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3093                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3094                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$399       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$56)
    3097                      .dwattr $C$DW$399, DW_AT_name("flag_enableCurrentCtrl")
    3098                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3099                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3100                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3101                      .dwendtag $C$DW$T$57
    3102              
    3103              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3104                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$57)
    3105                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3106              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3107                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$57)
    3108                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3109              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3110                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3111                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3112              $C$DW$400       .dwtag  DW_TAG_TI_far_type
    3113                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$84)
    3114              $C$DW$T$85      .dwtag  DW_TAG_const_type
    3115                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$400)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   62

    3116              
    3117              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3118                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3119                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3120              $C$DW$401       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    3122                      .dwattr $C$DW$401, DW_AT_name("rsvd")
    3123                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd")
    3124                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$402       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$59)
    3128                      .dwattr $C$DW$402, DW_AT_name("targetProc")
    3129                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_targetProc")
    3130                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3131                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$403       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    3134                      .dwattr $C$DW$403, DW_AT_name("major")
    3135                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_major")
    3136                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3137                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$404       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    3140                      .dwattr $C$DW$404, DW_AT_name("minor")
    3141                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_minor")
    3142                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3143                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3144                      .dwendtag $C$DW$T$60
    3145              
    3146              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3147                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3148                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3149              
    3150              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3151                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3152                      .dwattr $C$DW$T$19, DW_AT_declaration
    3153                      .dwendtag $C$DW$T$19
    3154              
    3155              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3156                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3157                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3158              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3159                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3160                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3161              
    3162              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3163                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3164                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3165              $C$DW$405       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3167                      .dwattr $C$DW$405, DW_AT_name("sinTh")
    3168                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_sinTh")
    3169                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3170                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   63

    3171              $C$DW$406       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3173                      .dwattr $C$DW$406, DW_AT_name("cosTh")
    3174                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_cosTh")
    3175                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3176                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3177                      .dwendtag $C$DW$T$61
    3178              
    3179              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3180                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3181                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3182              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3183                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3184                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3185              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3186                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3187                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3188              
    3189              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3190                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3191                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3192              $C$DW$407       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$62)
    3194                      .dwattr $C$DW$407, DW_AT_name("value")
    3195                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_value")
    3196                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3197                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3198                      .dwendtag $C$DW$T$63
    3199              
    3200              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3201                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3202                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3203              
    3204              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3205                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3206                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3207              $C$DW$408       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$65)
    3209                      .dwattr $C$DW$408, DW_AT_name("type")
    3210                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_type")
    3211                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3212                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$409       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$53)
    3215                      .dwattr $C$DW$409, DW_AT_name("numPolePairs")
    3216                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_numPolePairs")
    3217                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3218                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$410       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$54)
    3221                      .dwattr $C$DW$410, DW_AT_name("Lr_H")
    3222                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Lr_H")
    3223                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3224                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$411       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   64

    3226                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$54)
    3227                      .dwattr $C$DW$411, DW_AT_name("Ls_d_H")
    3228                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ls_d_H")
    3229                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3230                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$412       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$54)
    3233                      .dwattr $C$DW$412, DW_AT_name("Ls_q_H")
    3234                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ls_q_H")
    3235                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3236                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$413       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$54)
    3239                      .dwattr $C$DW$413, DW_AT_name("Rr_Ohm")
    3240                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Rr_Ohm")
    3241                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3242                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$414       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$54)
    3245                      .dwattr $C$DW$414, DW_AT_name("Rs_Ohm")
    3246                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Rs_Ohm")
    3247                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3248                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3249              $C$DW$415       .dwtag  DW_TAG_member
    3250                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$54)
    3251                      .dwattr $C$DW$415, DW_AT_name("ratedFlux_VpHz")
    3252                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3253                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3254                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3255                      .dwendtag $C$DW$T$66
    3256              
    3257              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3258                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3259                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3260              
    3261              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3262                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3263                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3264              $C$DW$416       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3266                      .dwattr $C$DW$416, DW_AT_name("sinTh")
    3267                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_sinTh")
    3268                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3269                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3270              $C$DW$417       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3272                      .dwattr $C$DW$417, DW_AT_name("cosTh")
    3273                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_cosTh")
    3274                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3275                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3276                      .dwendtag $C$DW$T$67
    3277              
    3278              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3279                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3280                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   65

    3281              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3282                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3283                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3284              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3285                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3286                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3287              
    3288              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3289                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3290                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3291              $C$DW$418       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3293                      .dwattr $C$DW$418, DW_AT_name("Kp")
    3294                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp")
    3295                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3296                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3297              $C$DW$419       .dwtag  DW_TAG_member
    3298                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3299                      .dwattr $C$DW$419, DW_AT_name("Ki")
    3300                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ki")
    3301                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3302                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$420       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3305                      .dwattr $C$DW$420, DW_AT_name("Kd")
    3306                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kd")
    3307                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3308                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$421       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3311                      .dwattr $C$DW$421, DW_AT_name("Ui")
    3312                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ui")
    3313                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3314                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3315              $C$DW$422       .dwtag  DW_TAG_member
    3316                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3317                      .dwattr $C$DW$422, DW_AT_name("refValue")
    3318                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_refValue")
    3319                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3320                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3321              $C$DW$423       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3323                      .dwattr $C$DW$423, DW_AT_name("fbackValue")
    3324                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_fbackValue")
    3325                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3326                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3327              $C$DW$424       .dwtag  DW_TAG_member
    3328                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3329                      .dwattr $C$DW$424, DW_AT_name("outMin")
    3330                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_outMin")
    3331                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3332                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3333              $C$DW$425       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3335                      .dwattr $C$DW$425, DW_AT_name("outMax")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   66

    3336                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_outMax")
    3337                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3338                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3339                      .dwendtag $C$DW$T$68
    3340              
    3341              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3342                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3343                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3344              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3345                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3346                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3347              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3348                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3349                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3350              
    3351              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3352                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3353                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3354              $C$DW$426       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3356                      .dwattr $C$DW$426, DW_AT_name("maxModulation")
    3357                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_maxModulation")
    3358                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3359                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3360                      .dwendtag $C$DW$T$69
    3361              
    3362              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3363                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3364                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3365              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3366                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3367                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3368              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3369                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3370                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3371              
    3372              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3373                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3374                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3375              $C$DW$427       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3377                      .dwattr $C$DW$427, DW_AT_name("targetValue")
    3378                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_targetValue")
    3379                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3380                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3381              $C$DW$428       .dwtag  DW_TAG_member
    3382                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3383                      .dwattr $C$DW$428, DW_AT_name("intValue")
    3384                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_intValue")
    3385                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3386                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3387              $C$DW$429       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3389                      .dwattr $C$DW$429, DW_AT_name("minValue")
    3390                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_minValue")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   67

    3391                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3392                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3393              $C$DW$430       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3395                      .dwattr $C$DW$430, DW_AT_name("maxValue")
    3396                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_maxValue")
    3397                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3398                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3399              $C$DW$431       .dwtag  DW_TAG_member
    3400                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3401                      .dwattr $C$DW$431, DW_AT_name("maxDelta")
    3402                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_maxDelta")
    3403                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3404                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3405                      .dwendtag $C$DW$T$70
    3406              
    3407              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3408                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3409                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3410              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3411                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3412                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3413              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3414                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3415                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3416              
    3417              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3418                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3419                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3420              $C$DW$432       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$54)
    3422                      .dwattr $C$DW$432, DW_AT_name("iqFullScaleCurrent_A")
    3423                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3424                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3425                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$433       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$54)
    3428                      .dwattr $C$DW$433, DW_AT_name("iqFullScaleVoltage_V")
    3429                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3430                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3431                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$434       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$54)
    3434                      .dwattr $C$DW$434, DW_AT_name("iqFullScaleFreq_Hz")
    3435                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3436                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3437                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$435       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3440                      .dwattr $C$DW$435, DW_AT_name("numIsrTicksPerCtrlTick")
    3441                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3442                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3443                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$436       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   68

    3446                      .dwattr $C$DW$436, DW_AT_name("numCtrlTicksPerCurrentTick")
    3447                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3448                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3449                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$437       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3452                      .dwattr $C$DW$437, DW_AT_name("numCtrlTicksPerEstTick")
    3453                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3454                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3455                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$438       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$53)
    3458                      .dwattr $C$DW$438, DW_AT_name("numCtrlTicksPerSpeedTick")
    3459                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3460                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3461                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$439       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    3464                      .dwattr $C$DW$439, DW_AT_name("numCtrlTicksPerTrajTick")
    3465                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3466                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3467                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$440       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    3470                      .dwattr $C$DW$440, DW_AT_name("numCurrentSensors")
    3471                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_numCurrentSensors")
    3472                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3473                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$441       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    3476                      .dwattr $C$DW$441, DW_AT_name("numVoltageSensors")
    3477                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_numVoltageSensors")
    3478                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3479                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$442       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    3482                      .dwattr $C$DW$442, DW_AT_name("offsetPole_rps")
    3483                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_offsetPole_rps")
    3484                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3485                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$443       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    3488                      .dwattr $C$DW$443, DW_AT_name("fluxPole_rps")
    3489                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_fluxPole_rps")
    3490                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3491                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$444       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    3494                      .dwattr $C$DW$444, DW_AT_name("zeroSpeedLimit")
    3495                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3496                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3497                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$445       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    3500                      .dwattr $C$DW$445, DW_AT_name("forceAngleFreq_Hz")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   69

    3501                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3502                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3503                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$446       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
    3506                      .dwattr $C$DW$446, DW_AT_name("maxAccel_Hzps")
    3507                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3508                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3509                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$447       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    3512                      .dwattr $C$DW$447, DW_AT_name("maxAccel_est_Hzps")
    3513                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3514                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3515                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$448       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    3518                      .dwattr $C$DW$448, DW_AT_name("directionPole_rps")
    3519                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_directionPole_rps")
    3520                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3521                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$449       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$54)
    3524                      .dwattr $C$DW$449, DW_AT_name("speedPole_rps")
    3525                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_speedPole_rps")
    3526                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3527                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$450       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    3530                      .dwattr $C$DW$450, DW_AT_name("dcBusPole_rps")
    3531                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3532                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3533                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$451       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    3536                      .dwattr $C$DW$451, DW_AT_name("fluxFraction")
    3537                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_fluxFraction")
    3538                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3539                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$452       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    3542                      .dwattr $C$DW$452, DW_AT_name("indEst_speedMaxFraction")
    3543                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3544                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3545                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$453       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    3548                      .dwattr $C$DW$453, DW_AT_name("powerWarpGain")
    3549                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_powerWarpGain")
    3550                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3551                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$454       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$53)
    3554                      .dwattr $C$DW$454, DW_AT_name("systemFreq_MHz")
    3555                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_systemFreq_MHz")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   70

    3556                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3557                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$455       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    3560                      .dwattr $C$DW$455, DW_AT_name("pwmPeriod_usec")
    3561                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3562                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3563                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$456       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$54)
    3566                      .dwattr $C$DW$456, DW_AT_name("voltage_sf")
    3567                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_voltage_sf")
    3568                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3569                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$457       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$54)
    3572                      .dwattr $C$DW$457, DW_AT_name("current_sf")
    3573                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_current_sf")
    3574                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3575                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$458       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$54)
    3578                      .dwattr $C$DW$458, DW_AT_name("voltageFilterPole_rps")
    3579                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3580                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3581                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$459       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$54)
    3584                      .dwattr $C$DW$459, DW_AT_name("maxVsMag_pu")
    3585                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3586                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3587                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$460       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3590                      .dwattr $C$DW$460, DW_AT_name("estKappa")
    3591                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_estKappa")
    3592                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3593                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$461       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$65)
    3596                      .dwattr $C$DW$461, DW_AT_name("motor_type")
    3597                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_motor_type")
    3598                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3599                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3600              $C$DW$462       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$53)
    3602                      .dwattr $C$DW$462, DW_AT_name("motor_numPolePairs")
    3603                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3604                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3605                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$463       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3608                      .dwattr $C$DW$463, DW_AT_name("motor_ratedFlux")
    3609                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3610                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   71

    3611                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$464       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3614                      .dwattr $C$DW$464, DW_AT_name("motor_Rr")
    3615                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_motor_Rr")
    3616                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3617                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$465       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3620                      .dwattr $C$DW$465, DW_AT_name("motor_Rs")
    3621                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_motor_Rs")
    3622                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3623                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$466       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3626                      .dwattr $C$DW$466, DW_AT_name("motor_Ls_d")
    3627                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_motor_Ls_d")
    3628                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3629                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$467       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3632                      .dwattr $C$DW$467, DW_AT_name("motor_Ls_q")
    3633                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_motor_Ls_q")
    3634                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3635                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$468       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3638                      .dwattr $C$DW$468, DW_AT_name("maxCurrent")
    3639                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_maxCurrent")
    3640                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3641                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$469       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3644                      .dwattr $C$DW$469, DW_AT_name("maxCurrent_resEst")
    3645                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    3646                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3647                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$470       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3650                      .dwattr $C$DW$470, DW_AT_name("maxCurrent_indEst")
    3651                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    3652                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3653                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3654              $C$DW$471       .dwtag  DW_TAG_member
    3655                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3656                      .dwattr $C$DW$471, DW_AT_name("maxCurrentSlope")
    3657                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxCurrentSlope")
    3658                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3659                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$472       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    3662                      .dwattr $C$DW$472, DW_AT_name("maxCurrentSlope_powerWarp")
    3663                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    3664                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3665                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1935610                            PAGE   72

    3666              $C$DW$473       .dwtag  DW_TAG_member
    3667                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$54)
    3668                      .dwattr $C$DW$473, DW_AT_name("IdRated")
    3669                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_IdRated")
    3670                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    3671                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3672              $C$DW$474       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$54)
    3674                      .dwattr $C$DW$474, DW_AT_name("IdRatedFraction_indEst")
    3675                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    3676                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3677                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3678              $C$DW$475       .dwtag  DW_TAG_member
    3679                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    3680                      .dwattr $C$DW$475, DW_AT_name("IdRatedFraction_ratedFlux")
    3681                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    3682                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3683                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3684              $C$DW$476       .dwtag  DW_TAG_member
    3685                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    3686                      .dwattr $C$DW$476, DW_AT_name("IdRated_delta")
    3687                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_IdRated_delta")
    3688                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3689                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3690              $C$DW$477       .dwtag  DW_TAG_member
    3691                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    3692                      .dwattr $C$DW$477, DW_AT_name("fluxEstFreq_Hz")
    3693                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    3694                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    3695                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3696              $C$DW$478       .dwtag  DW_TAG_member
    3697                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$52)
    3698                      .dwattr $C$DW$478, DW_AT_name("ctrlWaitTime")
    3699                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_ctrlWaitTime")
    3700                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3701                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$479       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$71)
    3704                      .dwattr $C$DW$479, DW_AT_name("estWaitTime")
    3705                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_estWaitTime")
    3706                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3707                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3708              $C$DW$480       .dwtag  DW_TAG_member
    3709                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$72)
