TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:59:12 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    8191              $C$DW$T$218     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    8192                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    8193                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    8194              
    8195              $C$DW$T$220     .dwtag  DW_TAG_enumeration_type
    8196                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
    8197              $C$DW$950       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_DcEvt"), DW_AT_const_value(0x00)
    8198              $C$DW$951       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZero"), DW_AT_const_value(
    8199              $C$DW$952       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualPeriod"), DW_AT_const_valu
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  166

    8200              $C$DW$953       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZeroOrPeriod"), DW_AT_cons
    8201              $C$DW$954       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpAIncr"), DW_AT_const_va
    8202              $C$DW$955       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpADecr"), DW_AT_const_va
    8203              $C$DW$956       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBIncr"), DW_AT_const_va
    8204              $C$DW$957       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBDecr"), DW_AT_const_va
    8205                      .dwendtag $C$DW$T$220
    8206              
    8207              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SocPulseSrc_e")
    8208                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    8209                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    8210              $C$DW$958       .dwtag  DW_TAG_TI_far_type
    8211                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$221)
    8212              $C$DW$T$222     .dwtag  DW_TAG_const_type
    8213                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$958)
    8214              
    8215              $C$DW$T$223     .dwtag  DW_TAG_enumeration_type
    8216                      .dwattr $C$DW$T$223, DW_AT_byte_size(0x01)
    8217              $C$DW$959       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    8218              $C$DW$960       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    8219              $C$DW$961       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    8220              $C$DW$962       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    8221              $C$DW$963       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    8222              $C$DW$964       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    8223              $C$DW$965       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    8224              $C$DW$966       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    8225              $C$DW$967       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    8226              $C$DW$968       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    8227              $C$DW$969       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    8228              $C$DW$970       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    8229                      .dwendtag $C$DW$T$223
    8230              
    8231              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    8232                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
    8233                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    8234              
    8235              $C$DW$T$226     .dwtag  DW_TAG_enumeration_type
    8236                      .dwattr $C$DW$T$226, DW_AT_byte_size(0x01)
    8237              $C$DW$971       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    8238              $C$DW$972       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    8239              $C$DW$973       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    8240              $C$DW$974       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    8241                      .dwendtag $C$DW$T$226
    8242              
    8243              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    8244                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$226)
    8245                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    8246              
    8247              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    8248                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_BITS")
    8249                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    8250              $C$DW$975       .dwtag  DW_TAG_member
    8251                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$23)
    8252                      .dwattr $C$DW$975, DW_AT_name("BCM")
    8253                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_BCM")
    8254                      .dwattr $C$DW$975, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  167

    8255                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8256                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8257              $C$DW$976       .dwtag  DW_TAG_member
    8258                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$23)
    8259                      .dwattr $C$DW$976, DW_AT_name("rsvd1")
    8260                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_rsvd1")
    8261                      .dwattr $C$DW$976, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    8262                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8263                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8264                      .dwendtag $C$DW$T$24
    8265              
    8266              
    8267              $C$DW$T$25      .dwtag  DW_TAG_union_type
    8268                      .dwattr $C$DW$T$25, DW_AT_name("I2CEMDR_REG")
    8269                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    8270              $C$DW$977       .dwtag  DW_TAG_member
    8271                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$23)
    8272                      .dwattr $C$DW$977, DW_AT_name("all")
    8273                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_all")
    8274                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8275                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8276              $C$DW$978       .dwtag  DW_TAG_member
    8277                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$24)
    8278                      .dwattr $C$DW$978, DW_AT_name("bit")
    8279                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_bit")
    8280                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8281                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8282                      .dwendtag $C$DW$T$25
    8283              
    8284              
    8285              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    8286                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_BITS")
    8287                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    8288              $C$DW$979       .dwtag  DW_TAG_member
    8289                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$23)
    8290                      .dwattr $C$DW$979, DW_AT_name("RXFFIL")
    8291                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_RXFFIL")
    8292                      .dwattr $C$DW$979, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    8293                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8294                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8295              $C$DW$980       .dwtag  DW_TAG_member
    8296                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$23)
    8297                      .dwattr $C$DW$980, DW_AT_name("RXFFIENA")
    8298                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_RXFFIENA")
    8299                      .dwattr $C$DW$980, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8300                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8301                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    8302              $C$DW$981       .dwtag  DW_TAG_member
    8303                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$23)
    8304                      .dwattr $C$DW$981, DW_AT_name("RXFFINTCLR")
    8305                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_RXFFINTCLR")
    8306                      .dwattr $C$DW$981, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8307                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8308                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8309              $C$DW$982       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  168

    8310                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$23)
    8311                      .dwattr $C$DW$982, DW_AT_name("RXFFINT")
    8312                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_RXFFINT")
    8313                      .dwattr $C$DW$982, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    8314                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8315                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8316              $C$DW$983       .dwtag  DW_TAG_member
    8317                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$23)
    8318                      .dwattr $C$DW$983, DW_AT_name("RXFFST")
    8319                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_RXFFST")
    8320                      .dwattr $C$DW$983, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    8321                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8322                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8323              $C$DW$984       .dwtag  DW_TAG_member
    8324                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$23)
    8325                      .dwattr $C$DW$984, DW_AT_name("RXFFRST")
    8326                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_RXFFRST")
    8327                      .dwattr $C$DW$984, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    8328                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8329                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8330              $C$DW$985       .dwtag  DW_TAG_member
    8331                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$23)
    8332                      .dwattr $C$DW$985, DW_AT_name("rsvd1")
    8333                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_rsvd1")
    8334                      .dwattr $C$DW$985, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    8335                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8336                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8337                      .dwendtag $C$DW$T$26
    8338              
    8339              
    8340              $C$DW$T$27      .dwtag  DW_TAG_union_type
    8341                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFRX_REG")
    8342                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    8343              $C$DW$986       .dwtag  DW_TAG_member
    8344                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$23)
    8345                      .dwattr $C$DW$986, DW_AT_name("all")
    8346                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_all")
    8347                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8348                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    8349              $C$DW$987       .dwtag  DW_TAG_member
    8350                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$26)
    8351                      .dwattr $C$DW$987, DW_AT_name("bit")
    8352                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_bit")
    8353                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8354                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8355                      .dwendtag $C$DW$T$27
    8356              
    8357              
    8358              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    8359                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_BITS")
    8360                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    8361              $C$DW$988       .dwtag  DW_TAG_member
    8362                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$23)
    8363                      .dwattr $C$DW$988, DW_AT_name("TXFFIL")
    8364                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_TXFFIL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  169

    8365                      .dwattr $C$DW$988, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    8366                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8367                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    8368              $C$DW$989       .dwtag  DW_TAG_member
    8369                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$23)
    8370                      .dwattr $C$DW$989, DW_AT_name("TXFFIENA")
    8371                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_TXFFIENA")
    8372                      .dwattr $C$DW$989, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8373                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8374                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    8375              $C$DW$990       .dwtag  DW_TAG_member
    8376                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$23)
    8377                      .dwattr $C$DW$990, DW_AT_name("TXFFINTCLR")
    8378                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_TXFFINTCLR")
    8379                      .dwattr $C$DW$990, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8380                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8381                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    8382              $C$DW$991       .dwtag  DW_TAG_member
    8383                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$23)
    8384                      .dwattr $C$DW$991, DW_AT_name("TXFFINT")
    8385                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_TXFFINT")
    8386                      .dwattr $C$DW$991, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    8387                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8388                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    8389              $C$DW$992       .dwtag  DW_TAG_member
    8390                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$23)
    8391                      .dwattr $C$DW$992, DW_AT_name("TXFFST")
    8392                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_TXFFST")
    8393                      .dwattr $C$DW$992, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    8394                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8395                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    8396              $C$DW$993       .dwtag  DW_TAG_member
    8397                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$23)
    8398                      .dwattr $C$DW$993, DW_AT_name("TXFFRST")
    8399                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_TXFFRST")
    8400                      .dwattr $C$DW$993, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    8401                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8402                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    8403              $C$DW$994       .dwtag  DW_TAG_member
    8404                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$23)
    8405                      .dwattr $C$DW$994, DW_AT_name("I2CFFEN")
    8406                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_I2CFFEN")
    8407                      .dwattr $C$DW$994, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    8408                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8409                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    8410              $C$DW$995       .dwtag  DW_TAG_member
    8411                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$23)
    8412                      .dwattr $C$DW$995, DW_AT_name("rsvd1")
    8413                      .dwattr $C$DW$995, DW_AT_TI_symbol_name("_rsvd1")
    8414                      .dwattr $C$DW$995, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    8415                      .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8416                      .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
    8417                      .dwendtag $C$DW$T$28
    8418              
    8419              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  170

    8420              $C$DW$T$29      .dwtag  DW_TAG_union_type
    8421                      .dwattr $C$DW$T$29, DW_AT_name("I2CFFTX_REG")
    8422                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    8423              $C$DW$996       .dwtag  DW_TAG_member
    8424                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$23)
    8425                      .dwattr $C$DW$996, DW_AT_name("all")
    8426                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_all")
    8427                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8428                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    8429              $C$DW$997       .dwtag  DW_TAG_member
    8430                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$28)
    8431                      .dwattr $C$DW$997, DW_AT_name("bit")
    8432                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_bit")
    8433                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8434                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    8435                      .dwendtag $C$DW$T$29
    8436              
    8437              
    8438              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    8439                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_BITS")
    8440                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    8441              $C$DW$998       .dwtag  DW_TAG_member
    8442                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$23)
    8443                      .dwattr $C$DW$998, DW_AT_name("ARBL")
    8444                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_ARBL")
    8445                      .dwattr $C$DW$998, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    8446                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8447                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    8448              $C$DW$999       .dwtag  DW_TAG_member
    8449                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$23)
    8450                      .dwattr $C$DW$999, DW_AT_name("NACK")
    8451                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_NACK")
    8452                      .dwattr $C$DW$999, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    8453                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8454                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    8455              $C$DW$1000      .dwtag  DW_TAG_member
    8456                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$23)
    8457                      .dwattr $C$DW$1000, DW_AT_name("ARDY")
    8458                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_ARDY")
    8459                      .dwattr $C$DW$1000, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    8460                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8461                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    8462              $C$DW$1001      .dwtag  DW_TAG_member
    8463                      .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$23)
    8464                      .dwattr $C$DW$1001, DW_AT_name("RRDY")
    8465                      .dwattr $C$DW$1001, DW_AT_TI_symbol_name("_RRDY")
    8466                      .dwattr $C$DW$1001, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    8467                      .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8468                      .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
    8469              $C$DW$1002      .dwtag  DW_TAG_member
    8470                      .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$23)
    8471                      .dwattr $C$DW$1002, DW_AT_name("XRDY")
    8472                      .dwattr $C$DW$1002, DW_AT_TI_symbol_name("_XRDY")
    8473                      .dwattr $C$DW$1002, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    8474                      .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  171

    8475                      .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
    8476              $C$DW$1003      .dwtag  DW_TAG_member
    8477                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$23)
    8478                      .dwattr $C$DW$1003, DW_AT_name("SCD")
    8479                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_SCD")
    8480                      .dwattr $C$DW$1003, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8481                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8482                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    8483              $C$DW$1004      .dwtag  DW_TAG_member
    8484                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$23)
    8485                      .dwattr $C$DW$1004, DW_AT_name("AAS")
    8486                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_AAS")
    8487                      .dwattr $C$DW$1004, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8488                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8489                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    8490              $C$DW$1005      .dwtag  DW_TAG_member
    8491                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$23)
    8492                      .dwattr $C$DW$1005, DW_AT_name("rsvd")
    8493                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_rsvd")
    8494                      .dwattr $C$DW$1005, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    8495                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8496                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    8497                      .dwendtag $C$DW$T$30
    8498              
    8499              
    8500              $C$DW$T$31      .dwtag  DW_TAG_union_type
    8501                      .dwattr $C$DW$T$31, DW_AT_name("I2CIER_REG")
    8502                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    8503              $C$DW$1006      .dwtag  DW_TAG_member
    8504                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$23)
    8505                      .dwattr $C$DW$1006, DW_AT_name("all")
    8506                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_all")
    8507                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8508                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    8509              $C$DW$1007      .dwtag  DW_TAG_member
    8510                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$30)
    8511                      .dwattr $C$DW$1007, DW_AT_name("bit")
    8512                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_bit")
    8513                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8514                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    8515                      .dwendtag $C$DW$T$31
    8516              
    8517              
    8518              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8519                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_BITS")
    8520                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    8521              $C$DW$1008      .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$23)
    8523                      .dwattr $C$DW$1008, DW_AT_name("INTCODE")
    8524                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_INTCODE")
    8525                      .dwattr $C$DW$1008, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    8526                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8527                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    8528              $C$DW$1009      .dwtag  DW_TAG_member
    8529                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  172

    8530                      .dwattr $C$DW$1009, DW_AT_name("rsvd1")
    8531                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_rsvd1")
    8532                      .dwattr $C$DW$1009, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    8533                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8534                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    8535                      .dwendtag $C$DW$T$32
    8536              
    8537              
    8538              $C$DW$T$33      .dwtag  DW_TAG_union_type
    8539                      .dwattr $C$DW$T$33, DW_AT_name("I2CISRC_REG")
    8540                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    8541              $C$DW$1010      .dwtag  DW_TAG_member
    8542                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$23)
    8543                      .dwattr $C$DW$1010, DW_AT_name("all")
    8544                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_all")
    8545                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8546                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    8547              $C$DW$1011      .dwtag  DW_TAG_member
    8548                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$32)
    8549                      .dwattr $C$DW$1011, DW_AT_name("bit")
    8550                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_bit")
    8551                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8552                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    8553                      .dwendtag $C$DW$T$33
    8554              
    8555              
    8556              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    8557                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_BITS")
    8558                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    8559              $C$DW$1012      .dwtag  DW_TAG_member
    8560                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$23)
    8561                      .dwattr $C$DW$1012, DW_AT_name("BC")
    8562                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_BC")
    8563                      .dwattr $C$DW$1012, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    8564                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8565                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    8566              $C$DW$1013      .dwtag  DW_TAG_member
    8567                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$23)
    8568                      .dwattr $C$DW$1013, DW_AT_name("FDF")
    8569                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_FDF")
    8570                      .dwattr $C$DW$1013, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    8571                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8572                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    8573              $C$DW$1014      .dwtag  DW_TAG_member
    8574                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$23)
    8575                      .dwattr $C$DW$1014, DW_AT_name("STB")
    8576                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_STB")
    8577                      .dwattr $C$DW$1014, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    8578                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8579                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    8580              $C$DW$1015      .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$23)
    8582                      .dwattr $C$DW$1015, DW_AT_name("IRS")
    8583                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_IRS")
    8584                      .dwattr $C$DW$1015, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  173

    8585                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8586                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    8587              $C$DW$1016      .dwtag  DW_TAG_member
    8588                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$23)
    8589                      .dwattr $C$DW$1016, DW_AT_name("DLB")
    8590                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_DLB")
    8591                      .dwattr $C$DW$1016, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    8592                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8593                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    8594              $C$DW$1017      .dwtag  DW_TAG_member
    8595                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$23)
    8596                      .dwattr $C$DW$1017, DW_AT_name("RM")
    8597                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_RM")
    8598                      .dwattr $C$DW$1017, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    8599                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8600                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    8601              $C$DW$1018      .dwtag  DW_TAG_member
    8602                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$23)
    8603                      .dwattr $C$DW$1018, DW_AT_name("XA")
    8604                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_XA")
    8605                      .dwattr $C$DW$1018, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    8606                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8607                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    8608              $C$DW$1019      .dwtag  DW_TAG_member
    8609                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$23)
    8610                      .dwattr $C$DW$1019, DW_AT_name("TRX")
    8611                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_TRX")
    8612                      .dwattr $C$DW$1019, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    8613                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8614                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    8615              $C$DW$1020      .dwtag  DW_TAG_member
    8616                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$23)
    8617                      .dwattr $C$DW$1020, DW_AT_name("MST")
    8618                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_MST")
    8619                      .dwattr $C$DW$1020, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    8620                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8621                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    8622              $C$DW$1021      .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$23)
    8624                      .dwattr $C$DW$1021, DW_AT_name("STP")
    8625                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_STP")
    8626                      .dwattr $C$DW$1021, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    8627                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8628                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    8629              $C$DW$1022      .dwtag  DW_TAG_member
    8630                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$23)
    8631                      .dwattr $C$DW$1022, DW_AT_name("rsvd1")
    8632                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_rsvd1")
    8633                      .dwattr $C$DW$1022, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    8634                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8635                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    8636              $C$DW$1023      .dwtag  DW_TAG_member
    8637                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$23)
    8638                      .dwattr $C$DW$1023, DW_AT_name("STT")
    8639                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_STT")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  174

    8640                      .dwattr $C$DW$1023, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    8641                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8642                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    8643              $C$DW$1024      .dwtag  DW_TAG_member
    8644                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$23)
    8645                      .dwattr $C$DW$1024, DW_AT_name("FREE")
    8646                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_FREE")
    8647                      .dwattr $C$DW$1024, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    8648                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8649                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    8650              $C$DW$1025      .dwtag  DW_TAG_member
    8651                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$23)
    8652                      .dwattr $C$DW$1025, DW_AT_name("NACKMOD")
    8653                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_NACKMOD")
    8654                      .dwattr $C$DW$1025, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    8655                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8656                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    8657                      .dwendtag $C$DW$T$34
    8658              
    8659              
    8660              $C$DW$T$35      .dwtag  DW_TAG_union_type
    8661                      .dwattr $C$DW$T$35, DW_AT_name("I2CMDR_REG")
    8662                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    8663              $C$DW$1026      .dwtag  DW_TAG_member
    8664                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$23)
    8665                      .dwattr $C$DW$1026, DW_AT_name("all")
    8666                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_all")
    8667                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8668                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    8669              $C$DW$1027      .dwtag  DW_TAG_member
    8670                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$34)
    8671                      .dwattr $C$DW$1027, DW_AT_name("bit")
    8672                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_bit")
    8673                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8674                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    8675                      .dwendtag $C$DW$T$35
    8676              
    8677              
    8678              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8679                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_BITS")
    8680                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    8681              $C$DW$1028      .dwtag  DW_TAG_member
    8682                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$23)
    8683                      .dwattr $C$DW$1028, DW_AT_name("IPSC")
    8684                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_IPSC")
    8685                      .dwattr $C$DW$1028, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    8686                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8687                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    8688              $C$DW$1029      .dwtag  DW_TAG_member
    8689                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$23)
    8690                      .dwattr $C$DW$1029, DW_AT_name("rsvd1")
    8691                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_rsvd1")
    8692                      .dwattr $C$DW$1029, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    8693                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8694                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  175

    8695                      .dwendtag $C$DW$T$36
    8696              
    8697              
    8698              $C$DW$T$37      .dwtag  DW_TAG_union_type
    8699                      .dwattr $C$DW$T$37, DW_AT_name("I2CPSC_REG")
    8700                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    8701              $C$DW$1030      .dwtag  DW_TAG_member
    8702                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$23)
    8703                      .dwattr $C$DW$1030, DW_AT_name("all")
    8704                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_all")
    8705                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8706                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    8707              $C$DW$1031      .dwtag  DW_TAG_member
    8708                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$36)
    8709                      .dwattr $C$DW$1031, DW_AT_name("bit")
    8710                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_bit")
    8711                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8712                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    8713                      .dwendtag $C$DW$T$37
    8714              
    8715              
    8716              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8717                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_BITS")
    8718                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    8719              $C$DW$1032      .dwtag  DW_TAG_member
    8720                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$23)
    8721                      .dwattr $C$DW$1032, DW_AT_name("ARBL")
    8722                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_ARBL")
    8723                      .dwattr $C$DW$1032, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    8724                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8725                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    8726              $C$DW$1033      .dwtag  DW_TAG_member
    8727                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$23)
    8728                      .dwattr $C$DW$1033, DW_AT_name("NACK")
    8729                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_NACK")
    8730                      .dwattr $C$DW$1033, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    8731                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8732                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    8733              $C$DW$1034      .dwtag  DW_TAG_member
    8734                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$23)
    8735                      .dwattr $C$DW$1034, DW_AT_name("ARDY")
    8736                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_ARDY")
    8737                      .dwattr $C$DW$1034, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    8738                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8739                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    8740              $C$DW$1035      .dwtag  DW_TAG_member
    8741                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$23)
    8742                      .dwattr $C$DW$1035, DW_AT_name("RRDY")
    8743                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_RRDY")
    8744                      .dwattr $C$DW$1035, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    8745                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8746                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    8747              $C$DW$1036      .dwtag  DW_TAG_member
    8748                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$23)
    8749                      .dwattr $C$DW$1036, DW_AT_name("XRDY")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  176

    8750                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_XRDY")
    8751                      .dwattr $C$DW$1036, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    8752                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8753                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    8754              $C$DW$1037      .dwtag  DW_TAG_member
    8755                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$23)
    8756                      .dwattr $C$DW$1037, DW_AT_name("SCD")
    8757                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_SCD")
    8758                      .dwattr $C$DW$1037, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    8759                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8760                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    8761              $C$DW$1038      .dwtag  DW_TAG_member
    8762                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$23)
    8763                      .dwattr $C$DW$1038, DW_AT_name("rsvd1")
    8764                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_rsvd1")
    8765                      .dwattr $C$DW$1038, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    8766                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8767                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    8768              $C$DW$1039      .dwtag  DW_TAG_member
    8769                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$23)
    8770                      .dwattr $C$DW$1039, DW_AT_name("AD0")
    8771                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_AD0")
    8772                      .dwattr $C$DW$1039, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    8773                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8774                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    8775              $C$DW$1040      .dwtag  DW_TAG_member
    8776                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$23)
    8777                      .dwattr $C$DW$1040, DW_AT_name("AAS")
    8778                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_AAS")
    8779                      .dwattr $C$DW$1040, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    8780                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8781                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    8782              $C$DW$1041      .dwtag  DW_TAG_member
    8783                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$23)
    8784                      .dwattr $C$DW$1041, DW_AT_name("XSMT")
    8785                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_XSMT")
    8786                      .dwattr $C$DW$1041, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    8787                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8788                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    8789              $C$DW$1042      .dwtag  DW_TAG_member
    8790                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$23)
    8791                      .dwattr $C$DW$1042, DW_AT_name("RSFULL")
    8792                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_RSFULL")
    8793                      .dwattr $C$DW$1042, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    8794                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8795                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    8796              $C$DW$1043      .dwtag  DW_TAG_member
    8797                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$23)
    8798                      .dwattr $C$DW$1043, DW_AT_name("BB")
    8799                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_BB")
    8800                      .dwattr $C$DW$1043, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    8801                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8802                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    8803              $C$DW$1044      .dwtag  DW_TAG_member
    8804                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  177

    8805                      .dwattr $C$DW$1044, DW_AT_name("NACKSNT")
    8806                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_NACKSNT")
    8807                      .dwattr $C$DW$1044, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    8808                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8809                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    8810              $C$DW$1045      .dwtag  DW_TAG_member
    8811                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$23)
    8812                      .dwattr $C$DW$1045, DW_AT_name("SDIR")
    8813                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_SDIR")
    8814                      .dwattr $C$DW$1045, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    8815                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8816                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    8817              $C$DW$1046      .dwtag  DW_TAG_member
    8818                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$23)
    8819                      .dwattr $C$DW$1046, DW_AT_name("rsvd2")
    8820                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_rsvd2")
    8821                      .dwattr $C$DW$1046, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    8822                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8823                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    8824                      .dwendtag $C$DW$T$38
    8825              
    8826              
    8827              $C$DW$T$39      .dwtag  DW_TAG_union_type
    8828                      .dwattr $C$DW$T$39, DW_AT_name("I2CSTR_REG")
    8829                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    8830              $C$DW$1047      .dwtag  DW_TAG_member
    8831                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$23)
    8832                      .dwattr $C$DW$1047, DW_AT_name("all")
    8833                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_all")
    8834                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8835                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    8836              $C$DW$1048      .dwtag  DW_TAG_member
    8837                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$38)
    8838                      .dwattr $C$DW$1048, DW_AT_name("bit")
    8839                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_bit")
    8840                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8841                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    8842                      .dwendtag $C$DW$T$39
    8843              
    8844              
    8845              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8846                      .dwattr $C$DW$T$47, DW_AT_name("_ADC_Obj_")
    8847                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x6650)
    8848              $C$DW$1049      .dwtag  DW_TAG_member
    8849                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$41)
    8850                      .dwattr $C$DW$1049, DW_AT_name("ADCRESULT")
    8851                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_ADCRESULT")
    8852                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8853                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    8854              $C$DW$1050      .dwtag  DW_TAG_member
    8855                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$42)
    8856                      .dwattr $C$DW$1050, DW_AT_name("resvd_1")
    8857                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_resvd_1")
    8858                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8859                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  178

    8860              $C$DW$1051      .dwtag  DW_TAG_member
    8861                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$40)
    8862                      .dwattr $C$DW$1051, DW_AT_name("ADCCTL1")
    8863                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_ADCCTL1")
    8864                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    8865                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    8866              $C$DW$1052      .dwtag  DW_TAG_member
    8867                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$40)
    8868                      .dwattr $C$DW$1052, DW_AT_name("ADCCTL2")
    8869                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_ADCCTL2")
    8870                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    8871                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    8872              $C$DW$1053      .dwtag  DW_TAG_member
    8873                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$43)
    8874                      .dwattr $C$DW$1053, DW_AT_name("rsvd_2")
    8875                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_rsvd_2")
    8876                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    8877                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    8878              $C$DW$1054      .dwtag  DW_TAG_member
    8879                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$40)
    8880                      .dwattr $C$DW$1054, DW_AT_name("ADCINTFLG")
    8881                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_ADCINTFLG")
    8882                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    8883                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    8884              $C$DW$1055      .dwtag  DW_TAG_member
    8885                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$40)
    8886                      .dwattr $C$DW$1055, DW_AT_name("ADCINTFLGCLR")
    8887                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    8888                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    8889                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    8890              $C$DW$1056      .dwtag  DW_TAG_member
    8891                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$40)
    8892                      .dwattr $C$DW$1056, DW_AT_name("ADCINTOVF")
    8893                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_ADCINTOVF")
    8894                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    8895                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
    8896              $C$DW$1057      .dwtag  DW_TAG_member
    8897                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$40)
    8898                      .dwattr $C$DW$1057, DW_AT_name("ADCINTOVFCLR")
    8899                      .dwattr $C$DW$1057, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    8900                      .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    8901                      .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
    8902              $C$DW$1058      .dwtag  DW_TAG_member
    8903                      .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$44)
    8904                      .dwattr $C$DW$1058, DW_AT_name("INTSELxNy")
    8905                      .dwattr $C$DW$1058, DW_AT_TI_symbol_name("_INTSELxNy")
    8906                      .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    8907                      .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
    8908              $C$DW$1059      .dwtag  DW_TAG_member
    8909                      .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$45)
    8910                      .dwattr $C$DW$1059, DW_AT_name("rsvd_3")
    8911                      .dwattr $C$DW$1059, DW_AT_TI_symbol_name("_rsvd_3")
    8912                      .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    8913                      .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
    8914              $C$DW$1060      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  179

    8915                      .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$40)
    8916                      .dwattr $C$DW$1060, DW_AT_name("SOCPRICTRL")
    8917                      .dwattr $C$DW$1060, DW_AT_TI_symbol_name("_SOCPRICTRL")
    8918                      .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    8919                      .dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
    8920              $C$DW$1061      .dwtag  DW_TAG_member
    8921                      .dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$40)
    8922                      .dwattr $C$DW$1061, DW_AT_name("rsvd_4")
    8923                      .dwattr $C$DW$1061, DW_AT_TI_symbol_name("_rsvd_4")
    8924                      .dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    8925                      .dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
    8926              $C$DW$1062      .dwtag  DW_TAG_member
    8927                      .dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$40)
    8928                      .dwattr $C$DW$1062, DW_AT_name("ADCSAMPLEMODE")
    8929                      .dwattr $C$DW$1062, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    8930                      .dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    8931                      .dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
    8932              $C$DW$1063      .dwtag  DW_TAG_member
    8933                      .dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$40)
    8934                      .dwattr $C$DW$1063, DW_AT_name("rsvd_5")
    8935                      .dwattr $C$DW$1063, DW_AT_TI_symbol_name("_rsvd_5")
    8936                      .dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    8937                      .dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
    8938              $C$DW$1064      .dwtag  DW_TAG_member
    8939                      .dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$40)
    8940                      .dwattr $C$DW$1064, DW_AT_name("ADCINTSOCSEL1")
    8941                      .dwattr $C$DW$1064, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    8942                      .dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    8943                      .dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
    8944              $C$DW$1065      .dwtag  DW_TAG_member
    8945                      .dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$40)
    8946                      .dwattr $C$DW$1065, DW_AT_name("ADCINTSOCSEL2")
    8947                      .dwattr $C$DW$1065, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    8948                      .dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    8949                      .dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
    8950              $C$DW$1066      .dwtag  DW_TAG_member
    8951                      .dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$43)
    8952                      .dwattr $C$DW$1066, DW_AT_name("rsvd_6")
    8953                      .dwattr $C$DW$1066, DW_AT_TI_symbol_name("_rsvd_6")
    8954                      .dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    8955                      .dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
    8956              $C$DW$1067      .dwtag  DW_TAG_member
    8957                      .dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$40)
    8958                      .dwattr $C$DW$1067, DW_AT_name("ADCSOCFLG1")
    8959                      .dwattr $C$DW$1067, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    8960                      .dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    8961                      .dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
    8962              $C$DW$1068      .dwtag  DW_TAG_member
    8963                      .dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$40)
    8964                      .dwattr $C$DW$1068, DW_AT_name("rsvd_7")
    8965                      .dwattr $C$DW$1068, DW_AT_TI_symbol_name("_rsvd_7")
    8966                      .dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    8967                      .dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
    8968              $C$DW$1069      .dwtag  DW_TAG_member
    8969                      .dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  180

    8970                      .dwattr $C$DW$1069, DW_AT_name("ADCSOCFRC1")
    8971                      .dwattr $C$DW$1069, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    8972                      .dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    8973                      .dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
    8974              $C$DW$1070      .dwtag  DW_TAG_member
    8975                      .dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$40)
    8976                      .dwattr $C$DW$1070, DW_AT_name("rsvd_8")
    8977                      .dwattr $C$DW$1070, DW_AT_TI_symbol_name("_rsvd_8")
    8978                      .dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    8979                      .dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
    8980              $C$DW$1071      .dwtag  DW_TAG_member
    8981                      .dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$40)
    8982                      .dwattr $C$DW$1071, DW_AT_name("ADCSOCOVF1")
    8983                      .dwattr $C$DW$1071, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    8984                      .dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    8985                      .dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
    8986              $C$DW$1072      .dwtag  DW_TAG_member
    8987                      .dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$40)
    8988                      .dwattr $C$DW$1072, DW_AT_name("rsvd_9")
    8989                      .dwattr $C$DW$1072, DW_AT_TI_symbol_name("_rsvd_9")
    8990                      .dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    8991                      .dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
    8992              $C$DW$1073      .dwtag  DW_TAG_member
    8993                      .dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$40)
    8994                      .dwattr $C$DW$1073, DW_AT_name("ADCSOCOVFCLR1")
    8995                      .dwattr $C$DW$1073, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    8996                      .dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    8997                      .dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
    8998              $C$DW$1074      .dwtag  DW_TAG_member
    8999                      .dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$40)
    9000                      .dwattr $C$DW$1074, DW_AT_name("rsvd_10")
    9001                      .dwattr $C$DW$1074, DW_AT_TI_symbol_name("_rsvd_10")
    9002                      .dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9003                      .dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
    9004              $C$DW$1075      .dwtag  DW_TAG_member
    9005                      .dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$41)
    9006                      .dwattr $C$DW$1075, DW_AT_name("ADCSOCxCTL")
    9007                      .dwattr $C$DW$1075, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9008                      .dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9009                      .dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
    9010              $C$DW$1076      .dwtag  DW_TAG_member
    9011                      .dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$41)
    9012                      .dwattr $C$DW$1076, DW_AT_name("rsvd_11")
    9013                      .dwattr $C$DW$1076, DW_AT_TI_symbol_name("_rsvd_11")
    9014                      .dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9015                      .dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
    9016              $C$DW$1077      .dwtag  DW_TAG_member
    9017                      .dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$40)
    9018                      .dwattr $C$DW$1077, DW_AT_name("ADCREFTRIM")
    9019                      .dwattr $C$DW$1077, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9020                      .dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9021                      .dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
    9022              $C$DW$1078      .dwtag  DW_TAG_member
    9023                      .dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$40)
    9024                      .dwattr $C$DW$1078, DW_AT_name("ADCOFFTRIM")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  181

    9025                      .dwattr $C$DW$1078, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9026                      .dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9027                      .dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
    9028              $C$DW$1079      .dwtag  DW_TAG_member
    9029                      .dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$46)
    9030                      .dwattr $C$DW$1079, DW_AT_name("resvd_12")
    9031                      .dwattr $C$DW$1079, DW_AT_TI_symbol_name("_resvd_12")
    9032                      .dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9033                      .dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
    9034              $C$DW$1080      .dwtag  DW_TAG_member
    9035                      .dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$40)
    9036                      .dwattr $C$DW$1080, DW_AT_name("ADCREV")
    9037                      .dwattr $C$DW$1080, DW_AT_TI_symbol_name("_ADCREV")
    9038                      .dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9039                      .dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
    9040                      .dwendtag $C$DW$T$47
    9041              
    9042              $C$DW$T$229     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9043                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$47)
    9044                      .dwattr $C$DW$T$229, DW_AT_language(DW_LANG_C)
    9045              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    9046                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$47)
    9047                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    9048              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9049                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    9050                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    9051              
    9052              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    9053                      .dwattr $C$DW$T$50, DW_AT_name("_CLARKE_Obj_")
    9054                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x06)
    9055              $C$DW$1081      .dwtag  DW_TAG_member
    9056                      .dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$48)
    9057                      .dwattr $C$DW$1081, DW_AT_name("alpha_sf")
    9058                      .dwattr $C$DW$1081, DW_AT_TI_symbol_name("_alpha_sf")
    9059                      .dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9060                      .dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
    9061              $C$DW$1082      .dwtag  DW_TAG_member
    9062                      .dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$48)
    9063                      .dwattr $C$DW$1082, DW_AT_name("beta_sf")
    9064                      .dwattr $C$DW$1082, DW_AT_TI_symbol_name("_beta_sf")
    9065                      .dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9066                      .dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
    9067              $C$DW$1083      .dwtag  DW_TAG_member
    9068                      .dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$49)
    9069                      .dwattr $C$DW$1083, DW_AT_name("numSensors")
    9070                      .dwattr $C$DW$1083, DW_AT_TI_symbol_name("_numSensors")
    9071                      .dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9072                      .dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
    9073                      .dwendtag $C$DW$T$50
    9074              
    9075              $C$DW$T$230     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    9076                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$50)
    9077                      .dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C)
    9078              $C$DW$T$231     .dwtag  DW_TAG_pointer_type
    9079                      .dwattr $C$DW$T$231, DW_AT_type(*$C$DW$T$50)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  182

    9080                      .dwattr $C$DW$T$231, DW_AT_address_class(0x20)
    9081              $C$DW$T$232     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    9082                      .dwattr $C$DW$T$232, DW_AT_type(*$C$DW$T$231)
    9083                      .dwattr $C$DW$T$232, DW_AT_language(DW_LANG_C)
    9084              $C$DW$1084      .dwtag  DW_TAG_TI_far_type
    9085                      .dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$232)
    9086              $C$DW$T$233     .dwtag  DW_TAG_const_type
    9087                      .dwattr $C$DW$T$233, DW_AT_type(*$C$DW$1084)
    9088              
    9089              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    9090                      .dwattr $C$DW$T$52, DW_AT_name("_CLK_Obj_")
    9091                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x11)
    9092              $C$DW$1085      .dwtag  DW_TAG_member
    9093                      .dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$40)
    9094                      .dwattr $C$DW$1085, DW_AT_name("XCLK")
    9095                      .dwattr $C$DW$1085, DW_AT_TI_symbol_name("_XCLK")
    9096                      .dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9097                      .dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
    9098              $C$DW$1086      .dwtag  DW_TAG_member
    9099                      .dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$40)
    9100                      .dwattr $C$DW$1086, DW_AT_name("rsvd_1")
    9101                      .dwattr $C$DW$1086, DW_AT_TI_symbol_name("_rsvd_1")
    9102                      .dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9103                      .dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
    9104              $C$DW$1087      .dwtag  DW_TAG_member
    9105                      .dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$40)
    9106                      .dwattr $C$DW$1087, DW_AT_name("CLKCTL")
    9107                      .dwattr $C$DW$1087, DW_AT_TI_symbol_name("_CLKCTL")
    9108                      .dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9109                      .dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
    9110              $C$DW$1088      .dwtag  DW_TAG_member
    9111                      .dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$51)
    9112                      .dwattr $C$DW$1088, DW_AT_name("rsvd_2")
    9113                      .dwattr $C$DW$1088, DW_AT_TI_symbol_name("_rsvd_2")
    9114                      .dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9115                      .dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
    9116              $C$DW$1089      .dwtag  DW_TAG_member
    9117                      .dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$40)
    9118                      .dwattr $C$DW$1089, DW_AT_name("LOSPCP")
    9119                      .dwattr $C$DW$1089, DW_AT_TI_symbol_name("_LOSPCP")
    9120                      .dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9121                      .dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
    9122              $C$DW$1090      .dwtag  DW_TAG_member
    9123                      .dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$40)
    9124                      .dwattr $C$DW$1090, DW_AT_name("PCLKCR0")
    9125                      .dwattr $C$DW$1090, DW_AT_TI_symbol_name("_PCLKCR0")
    9126                      .dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9127                      .dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
    9128              $C$DW$1091      .dwtag  DW_TAG_member
    9129                      .dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$40)
    9130                      .dwattr $C$DW$1091, DW_AT_name("PCLKCR1")
    9131                      .dwattr $C$DW$1091, DW_AT_TI_symbol_name("_PCLKCR1")
    9132                      .dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9133                      .dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
    9134              $C$DW$1092      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  183

    9135                      .dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$43)
    9136                      .dwattr $C$DW$1092, DW_AT_name("rsvd_3")
    9137                      .dwattr $C$DW$1092, DW_AT_TI_symbol_name("_rsvd_3")
    9138                      .dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9139                      .dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
    9140              $C$DW$1093      .dwtag  DW_TAG_member
    9141                      .dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$40)
    9142                      .dwattr $C$DW$1093, DW_AT_name("PCLKCR3")
    9143                      .dwattr $C$DW$1093, DW_AT_TI_symbol_name("_PCLKCR3")
    9144                      .dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9145                      .dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
    9146                      .dwendtag $C$DW$T$52
    9147              
    9148              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    9149                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$52)
    9150                      .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
    9151              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9152                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$105)
    9153                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    9154              
    9155              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    9156                      .dwattr $C$DW$T$53, DW_AT_name("_CPU_Obj_")
    9157                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    9158              $C$DW$1094      .dwtag  DW_TAG_member
    9159                      .dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$49)
    9160                      .dwattr $C$DW$1094, DW_AT_name("tmp")
    9161                      .dwattr $C$DW$1094, DW_AT_TI_symbol_name("_tmp")
    9162                      .dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9163                      .dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
    9164                      .dwendtag $C$DW$T$53
    9165              
    9166              $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    9167                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$53)
    9168                      .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    9169              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9170                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    9171                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    9172              
    9173              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    9174                      .dwattr $C$DW$T$56, DW_AT_name("_CPU_USAGE_Obj_")
    9175                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x16)
    9176              $C$DW$1095      .dwtag  DW_TAG_member
    9177                      .dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$54)
    9178                      .dwattr $C$DW$1095, DW_AT_name("timerPeriod_cnts")
    9179                      .dwattr $C$DW$1095, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    9180                      .dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9181                      .dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
    9182              $C$DW$1096      .dwtag  DW_TAG_member
    9183                      .dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$54)
    9184                      .dwattr $C$DW$1096, DW_AT_name("cnt_z0")
    9185                      .dwattr $C$DW$1096, DW_AT_TI_symbol_name("_cnt_z0")
    9186                      .dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9187                      .dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
    9188              $C$DW$1097      .dwtag  DW_TAG_member
    9189                      .dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  184

    9190                      .dwattr $C$DW$1097, DW_AT_name("cnt_z1")
    9191                      .dwattr $C$DW$1097, DW_AT_TI_symbol_name("_cnt_z1")
    9192                      .dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9193                      .dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
    9194              $C$DW$1098      .dwtag  DW_TAG_member
    9195                      .dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$54)
    9196                      .dwattr $C$DW$1098, DW_AT_name("deltaCnt")
    9197                      .dwattr $C$DW$1098, DW_AT_TI_symbol_name("_deltaCnt")
    9198                      .dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9199                      .dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
    9200              $C$DW$1099      .dwtag  DW_TAG_member
    9201                      .dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$54)
    9202                      .dwattr $C$DW$1099, DW_AT_name("deltaCntAcc")
    9203                      .dwattr $C$DW$1099, DW_AT_TI_symbol_name("_deltaCntAcc")
    9204                      .dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9205                      .dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
    9206              $C$DW$1100      .dwtag  DW_TAG_member
    9207                      .dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$54)
    9208                      .dwattr $C$DW$1100, DW_AT_name("deltaCntAccNum")
    9209                      .dwattr $C$DW$1100, DW_AT_TI_symbol_name("_deltaCntAccNum")
    9210                      .dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9211                      .dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
    9212              $C$DW$1101      .dwtag  DW_TAG_member
    9213                      .dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$54)
    9214                      .dwattr $C$DW$1101, DW_AT_name("deltaCntAccNumMax")
    9215                      .dwattr $C$DW$1101, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    9216                      .dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9217                      .dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
    9218              $C$DW$1102      .dwtag  DW_TAG_member
    9219                      .dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$54)
    9220                      .dwattr $C$DW$1102, DW_AT_name("minDeltaCntObserved")
    9221                      .dwattr $C$DW$1102, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    9222                      .dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9223                      .dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
    9224              $C$DW$1103      .dwtag  DW_TAG_member
    9225                      .dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$54)
    9226                      .dwattr $C$DW$1103, DW_AT_name("avgDeltaCntObserved")
    9227                      .dwattr $C$DW$1103, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    9228                      .dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9229                      .dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
    9230              $C$DW$1104      .dwtag  DW_TAG_member
    9231                      .dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$54)
    9232                      .dwattr $C$DW$1104, DW_AT_name("maxDeltaCntObserved")
    9233                      .dwattr $C$DW$1104, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    9234                      .dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    9235                      .dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
    9236              $C$DW$1105      .dwtag  DW_TAG_member
    9237                      .dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$55)
    9238                      .dwattr $C$DW$1105, DW_AT_name("flag_resetStats")
    9239                      .dwattr $C$DW$1105, DW_AT_TI_symbol_name("_flag_resetStats")
    9240                      .dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9241                      .dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
    9242                      .dwendtag $C$DW$T$56
    9243              
    9244              $C$DW$T$240     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  185

    9245                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$56)
    9246                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    9247              $C$DW$T$241     .dwtag  DW_TAG_pointer_type
    9248                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$56)
    9249                      .dwattr $C$DW$T$241, DW_AT_address_class(0x20)
    9250              $C$DW$T$242     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    9251                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$241)
    9252                      .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    9253              
    9254              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    9255                      .dwattr $C$DW$T$59, DW_AT_name("_CTRL_Version_")
    9256                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
    9257              $C$DW$1106      .dwtag  DW_TAG_member
    9258                      .dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$23)
    9259                      .dwattr $C$DW$1106, DW_AT_name("rsvd")
    9260                      .dwattr $C$DW$1106, DW_AT_TI_symbol_name("_rsvd")
    9261                      .dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9262                      .dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
    9263              $C$DW$1107      .dwtag  DW_TAG_member
    9264                      .dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$58)
    9265                      .dwattr $C$DW$1107, DW_AT_name("targetProc")
    9266                      .dwattr $C$DW$1107, DW_AT_TI_symbol_name("_targetProc")
    9267                      .dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9268                      .dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
    9269              $C$DW$1108      .dwtag  DW_TAG_member
    9270                      .dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$23)
    9271                      .dwattr $C$DW$1108, DW_AT_name("major")
    9272                      .dwattr $C$DW$1108, DW_AT_TI_symbol_name("_major")
    9273                      .dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9274                      .dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
    9275              $C$DW$1109      .dwtag  DW_TAG_member
    9276                      .dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$23)
    9277                      .dwattr $C$DW$1109, DW_AT_name("minor")
    9278                      .dwattr $C$DW$1109, DW_AT_TI_symbol_name("_minor")
    9279                      .dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9280                      .dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
    9281                      .dwendtag $C$DW$T$59
    9282              
    9283              $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    9284                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$59)
    9285                      .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    9286              
    9287              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    9288                      .dwattr $C$DW$T$66, DW_AT_name("_DRV8301_Obj_")
    9289                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x08)
    9290              $C$DW$1110      .dwtag  DW_TAG_member
    9291                      .dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$61)
    9292                      .dwattr $C$DW$1110, DW_AT_name("spiHandle")
    9293                      .dwattr $C$DW$1110, DW_AT_TI_symbol_name("_spiHandle")
    9294                      .dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9295                      .dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
    9296              $C$DW$1111      .dwtag  DW_TAG_member
    9297                      .dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$63)
    9298                      .dwattr $C$DW$1111, DW_AT_name("gpioHandle")
    9299                      .dwattr $C$DW$1111, DW_AT_TI_symbol_name("_gpioHandle")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  186

    9300                      .dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9301                      .dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
    9302              $C$DW$1112      .dwtag  DW_TAG_member
    9303                      .dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$65)
    9304                      .dwattr $C$DW$1112, DW_AT_name("gpioNumber")
    9305                      .dwattr $C$DW$1112, DW_AT_TI_symbol_name("_gpioNumber")
    9306                      .dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9307                      .dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
    9308              $C$DW$1113      .dwtag  DW_TAG_member
    9309                      .dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$55)
    9310                      .dwattr $C$DW$1113, DW_AT_name("RxTimeOut")
    9311                      .dwattr $C$DW$1113, DW_AT_TI_symbol_name("_RxTimeOut")
    9312                      .dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9313                      .dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
    9314              $C$DW$1114      .dwtag  DW_TAG_member
    9315                      .dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$55)
    9316                      .dwattr $C$DW$1114, DW_AT_name("enableTimeOut")
    9317                      .dwattr $C$DW$1114, DW_AT_TI_symbol_name("_enableTimeOut")
    9318                      .dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9319                      .dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
    9320                      .dwendtag $C$DW$T$66
    9321              
    9322              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    9323                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$66)
    9324                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    9325              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
    9326                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$66)
    9327                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
    9328              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    9329                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    9330                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    9331              
    9332              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    9333                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    9334                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x05)
    9335              $C$DW$1115      .dwtag  DW_TAG_member
    9336                      .dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$68)
    9337                      .dwattr $C$DW$1115, DW_AT_name("DRV8301_CURRENT")
    9338                      .dwattr $C$DW$1115, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    9339                      .dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9340                      .dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
    9341              $C$DW$1116      .dwtag  DW_TAG_member
    9342                      .dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$70)
    9343                      .dwattr $C$DW$1116, DW_AT_name("DRV8301_RESET")
    9344                      .dwattr $C$DW$1116, DW_AT_TI_symbol_name("_DRV8301_RESET")
    9345                      .dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9346                      .dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
    9347              $C$DW$1117      .dwtag  DW_TAG_member
    9348                      .dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$72)
    9349                      .dwattr $C$DW$1117, DW_AT_name("PWM_MODE")
    9350                      .dwattr $C$DW$1117, DW_AT_TI_symbol_name("_PWM_MODE")
    9351                      .dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9352                      .dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
    9353              $C$DW$1118      .dwtag  DW_TAG_member
    9354                      .dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$74)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2706010                            PAGE  187

    9355                      .dwattr $C$DW$1118, DW_AT_name("OC_MODE")
    9356                      .dwattr $C$DW$1118, DW_AT_TI_symbol_name("_OC_MODE")
    9357                      .dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9358                      .dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
    9359              $C$DW$1119      .dwtag  DW_TAG_member
    9360                      .dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$76)
    9361                      .dwattr $C$DW$1119, DW_AT_name("OC_ADJ_SET")
    9362                      .dwattr $C$DW$1119, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    9363                      .dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9364                      .dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
    9365                      .dwendtag $C$DW$T$77
    9366              
    9367              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    9368                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$77)
    9369                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    9370              
    9371              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9372                      .dwattr $C$DW$T$86, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    9373                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    9374              $C$DW$1120      .dwtag  DW_TAG_member
    9375                      .dwattr $C$DW$1120, DW_AT_type(*$C$DW$T$79)
    9376                      .dwattr $C$DW$1120, DW_AT_name("OCTW_SET")
    9377                      .dwattr $C$DW$1120, DW_AT_TI_symbol_name("_OCTW_SET")
    9378                      .dwattr $C$DW$1120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9379                      .dwattr $C$DW$1120, DW_AT_accessibility(DW_ACCESS_public)
    9380              $C$DW$1121      .dwtag  DW_TAG_member
    9381                      .dwattr $C$DW$1121, DW_AT_type(*$C$DW$T$81)
    9382                      .dwattr $C$DW$1121, DW_AT_name("GAIN")
    9383                      .dwattr $C$DW$1121, DW_AT_TI_symbol_name("_GAIN")
    9384                      .dwattr $C$DW$1121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9385                      .dwattr $C$DW$1121, DW_AT_accessibility(DW_ACCESS_public)
    9386              $C$DW$1122      .dwtag  DW_TAG_member
    9387                      .dwattr $C$DW$1122, DW_AT_type(*$C$DW$T$83)
    9388                      .dwattr $C$DW$1122, DW_AT_name("DC_CAL_CH1p2")
    9389                      .dwattr $C$DW$1122, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    9390                      .dwattr $C$DW$1122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9391                      .dwattr $C$DW$1122, DW_AT_accessibility(DW_ACCESS_public)
    9392              $C$DW$1123      .dwtag  DW_TAG_member
    9393                      .dwattr $C$DW$1123, DW_AT_type(*$C$DW$T$85)
    9394                      .dwattr $C$DW$1123, DW_AT_name("OC_TOFF")
    9395                      .dwattr $C$DW$1123, DW_AT_TI_symbol_name("_OC_TOFF")
    9396                      .dwattr $C$DW$1123, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9397                      .dwattr $C$DW$1123, DW_AT_accessibility(DW_ACCESS_public)
    9398                      .dwendtag $C$DW$T$86
    9399              
    9400              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    9401                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$86)
    9402                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    9403              
    9404              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9405                      .dwattr $C$DW$T$87, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    9406                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x0b)
    9407              $C$DW$1124      .dwtag  DW_TAG_member
    9408                      .dwattr $C$DW$1124, DW_AT_type(*$C$DW$T$55)
    9409                      .dwattr $C$DW$1124, DW_AT_name("FAULT")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:59:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
