TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Sat Nov 26 18:33:58 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6521              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6522              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6523              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6524              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6525              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6526              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6527              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6528              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6529              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6530              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6531              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6532              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6533                      .dwendtag $C$DW$T$165
    6534              
    6535              $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6536                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
    6537                      .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    6538              
    6539              $C$DW$T$175     .dwtag  DW_TAG_enumeration_type
    6540                      .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    6541              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6542              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6543              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6544              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6545              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6546              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6547              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6548              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6549              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6550              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6551              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6552              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6553              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6554              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6555              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6556                      .dwendtag $C$DW$T$175
    6557              
    6558              $C$DW$T$176     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6559                      .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    6560                      .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    6561              
    6562              $C$DW$T$180     .dwtag  DW_TAG_enumeration_type
    6563                      .dwattr $C$DW$T$180, DW_AT_byte_size(0x01)
    6564              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6565              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6566              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6567                      .dwendtag $C$DW$T$180
    6568              
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  127

    6569              $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6570                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    6571                      .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    6572              $C$DW$678       .dwtag  DW_TAG_TI_far_type
    6573                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$181)
    6574              $C$DW$T$182     .dwtag  DW_TAG_const_type
    6575                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$678)
    6576              
    6577              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6578                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    6579                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    6580              $C$DW$679       .dwtag  DW_TAG_member
    6581                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    6582                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    6583                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    6584                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6585                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6586              $C$DW$680       .dwtag  DW_TAG_member
    6587                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$26)
    6588                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    6589                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    6590                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6591                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6592              $C$DW$681       .dwtag  DW_TAG_member
    6593                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
    6594                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    6595                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
    6596                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6597                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6598              $C$DW$682       .dwtag  DW_TAG_member
    6599                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$24)
    6600                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    6601                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    6602                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6603                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6604              $C$DW$683       .dwtag  DW_TAG_member
    6605                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$27)
    6606                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    6607                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    6608                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6609                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6610              $C$DW$684       .dwtag  DW_TAG_member
    6611                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$24)
    6612                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    6613                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    6614                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6615                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6616              $C$DW$685       .dwtag  DW_TAG_member
    6617                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    6618                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    6619                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6620                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6621                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6622              $C$DW$686       .dwtag  DW_TAG_member
    6623                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  128

    6624                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    6625                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    6626                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6627                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6628              $C$DW$687       .dwtag  DW_TAG_member
    6629                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$24)
    6630                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    6631                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6632                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6633                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6634              $C$DW$688       .dwtag  DW_TAG_member
    6635                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$28)
    6636                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    6637                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    6638                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6639                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6640              $C$DW$689       .dwtag  DW_TAG_member
    6641                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$29)
    6642                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    6643                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    6644                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6645                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6646              $C$DW$690       .dwtag  DW_TAG_member
    6647                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$24)
    6648                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    6649                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6650                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6651                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6652              $C$DW$691       .dwtag  DW_TAG_member
    6653                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$24)
    6654                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    6655                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    6656                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6657                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6658              $C$DW$692       .dwtag  DW_TAG_member
    6659                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$24)
    6660                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    6661                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6662                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6663                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6664              $C$DW$693       .dwtag  DW_TAG_member
    6665                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$24)
    6666                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    6667                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
    6668                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6669                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6670              $C$DW$694       .dwtag  DW_TAG_member
    6671                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$24)
    6672                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    6673                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6674                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6675                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6676              $C$DW$695       .dwtag  DW_TAG_member
    6677                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$24)
    6678                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  129

    6679                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6680                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6681                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6682              $C$DW$696       .dwtag  DW_TAG_member
    6683                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$27)
    6684                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    6685                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    6686                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6687                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6688              $C$DW$697       .dwtag  DW_TAG_member
    6689                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$24)
    6690                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    6691                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6692                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6693                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6694              $C$DW$698       .dwtag  DW_TAG_member
    6695                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$24)
    6696                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
    6697                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    6698                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6699                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6700              $C$DW$699       .dwtag  DW_TAG_member
    6701                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$24)
    6702                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    6703                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6704                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6705                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6706              $C$DW$700       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$24)
    6708                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    6709                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    6710                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6711                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6712              $C$DW$701       .dwtag  DW_TAG_member
    6713                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$24)
    6714                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
    6715                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6716                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6717                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6718              $C$DW$702       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$24)
    6720                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    6721                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    6722                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6723                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$703       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$24)
    6726                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    6727                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6728                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6729                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$704       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$24)
    6732                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    6733                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  130

    6734                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6735                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$705       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$25)
    6738                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    6739                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6740                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6741                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$706       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$25)
    6744                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    6745                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    6746                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6747                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6748              $C$DW$707       .dwtag  DW_TAG_member
    6749                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$24)
    6750                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    6751                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6752                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6753                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6754              $C$DW$708       .dwtag  DW_TAG_member
    6755                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$24)
    6756                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    6757                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6758                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6759                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6760              $C$DW$709       .dwtag  DW_TAG_member
    6761                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$30)
    6762                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    6763                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    6764                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6765                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6766              $C$DW$710       .dwtag  DW_TAG_member
    6767                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$24)
    6768                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    6769                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    6770                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6771                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6772                      .dwendtag $C$DW$T$31
    6773              
    6774              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    6775                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$31)
    6776                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    6777              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6778                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    6779                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    6780              
    6781              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6782                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    6783                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    6784              $C$DW$711       .dwtag  DW_TAG_member
    6785                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$32)
    6786                      .dwattr $C$DW$711, DW_AT_name("alpha_sf")
    6787                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_alpha_sf")
    6788                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  131

    6789                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6790              $C$DW$712       .dwtag  DW_TAG_member
    6791                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$32)
    6792                      .dwattr $C$DW$712, DW_AT_name("beta_sf")
    6793                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_beta_sf")
    6794                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6795                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6796              $C$DW$713       .dwtag  DW_TAG_member
    6797                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$33)
    6798                      .dwattr $C$DW$713, DW_AT_name("numSensors")
    6799                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_numSensors")
    6800                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6801                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6802                      .dwendtag $C$DW$T$34
    6803              
    6804              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6805                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    6806                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6807              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    6808                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$45)
    6809                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
    6810              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    6811                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    6812                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    6813              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6814                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6815                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    6816              
    6817              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6818                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    6819                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    6820              $C$DW$714       .dwtag  DW_TAG_member
    6821                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$24)
    6822                      .dwattr $C$DW$714, DW_AT_name("XCLK")
    6823                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_XCLK")
    6824                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6825                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6826              $C$DW$715       .dwtag  DW_TAG_member
    6827                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$24)
    6828                      .dwattr $C$DW$715, DW_AT_name("rsvd_1")
    6829                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_rsvd_1")
    6830                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6831                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6832              $C$DW$716       .dwtag  DW_TAG_member
    6833                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$24)
    6834                      .dwattr $C$DW$716, DW_AT_name("CLKCTL")
    6835                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_CLKCTL")
    6836                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6837                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6838              $C$DW$717       .dwtag  DW_TAG_member
    6839                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$35)
    6840                      .dwattr $C$DW$717, DW_AT_name("rsvd_2")
    6841                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_rsvd_2")
    6842                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6843                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  132

    6844              $C$DW$718       .dwtag  DW_TAG_member
    6845                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$24)
    6846                      .dwattr $C$DW$718, DW_AT_name("LOSPCP")
    6847                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_LOSPCP")
    6848                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6849                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6850              $C$DW$719       .dwtag  DW_TAG_member
    6851                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$24)
    6852                      .dwattr $C$DW$719, DW_AT_name("PCLKCR0")
    6853                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_PCLKCR0")
    6854                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6855                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6856              $C$DW$720       .dwtag  DW_TAG_member
    6857                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$24)
    6858                      .dwattr $C$DW$720, DW_AT_name("PCLKCR1")
    6859                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_PCLKCR1")
    6860                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6861                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6862              $C$DW$721       .dwtag  DW_TAG_member
    6863                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$27)
    6864                      .dwattr $C$DW$721, DW_AT_name("rsvd_3")
    6865                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_rsvd_3")
    6866                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6867                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6868              $C$DW$722       .dwtag  DW_TAG_member
    6869                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$24)
    6870                      .dwattr $C$DW$722, DW_AT_name("PCLKCR3")
    6871                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_PCLKCR3")
    6872                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6873                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6874                      .dwendtag $C$DW$T$36
    6875              
    6876              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    6877                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$36)
    6878                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    6879              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6880                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    6881                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    6882              
    6883              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6884                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    6885                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6886              $C$DW$723       .dwtag  DW_TAG_member
    6887                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$33)
    6888                      .dwattr $C$DW$723, DW_AT_name("tmp")
    6889                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_tmp")
    6890                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6891                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6892                      .dwendtag $C$DW$T$37
    6893              
    6894              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    6895                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$37)
    6896                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    6897              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6898                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  133

    6899                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    6900              
    6901              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    6902                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    6903                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    6904              $C$DW$724       .dwtag  DW_TAG_member
    6905                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$38)
    6906                      .dwattr $C$DW$724, DW_AT_name("version")
    6907                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_version")
    6908                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6909                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6910              $C$DW$725       .dwtag  DW_TAG_member
    6911                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$40)
    6912                      .dwattr $C$DW$725, DW_AT_name("state")
    6913                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_state")
    6914                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6915                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6916              $C$DW$726       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$40)
    6918                      .dwattr $C$DW$726, DW_AT_name("prevState")
    6919                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_prevState")
    6920                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6921                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6922              $C$DW$727       .dwtag  DW_TAG_member
    6923                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$42)
    6924                      .dwattr $C$DW$727, DW_AT_name("errorCode")
    6925                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_errorCode")
    6926                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6927                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6928              $C$DW$728       .dwtag  DW_TAG_member
    6929                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$44)
    6930                      .dwattr $C$DW$728, DW_AT_name("clarkeHandle_I")
    6931                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_clarkeHandle_I")
    6932                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6933                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6934              $C$DW$729       .dwtag  DW_TAG_member
    6935                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$45)
    6936                      .dwattr $C$DW$729, DW_AT_name("clarke_I")
    6937                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_clarke_I")
    6938                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6939                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6940              $C$DW$730       .dwtag  DW_TAG_member
    6941                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$44)
    6942                      .dwattr $C$DW$730, DW_AT_name("clarkeHandle_V")
    6943                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_clarkeHandle_V")
    6944                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6945                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6946              $C$DW$731       .dwtag  DW_TAG_member
    6947                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$45)
    6948                      .dwattr $C$DW$731, DW_AT_name("clarke_V")
    6949                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_clarke_V")
    6950                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6951                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6952              $C$DW$732       .dwtag  DW_TAG_member
    6953                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  134

    6954                      .dwattr $C$DW$732, DW_AT_name("estHandle")
    6955                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_estHandle")
    6956                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6957                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6958              $C$DW$733       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$49)
    6960                      .dwattr $C$DW$733, DW_AT_name("parkHandle")
    6961                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_parkHandle")
    6962                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    6963                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6964              $C$DW$734       .dwtag  DW_TAG_member
    6965                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$50)
    6966                      .dwattr $C$DW$734, DW_AT_name("park")
    6967                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_park")
    6968                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6969                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    6970              $C$DW$735       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$52)
    6972                      .dwattr $C$DW$735, DW_AT_name("pidHandle_Id")
    6973                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_pidHandle_Id")
    6974                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6975                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$736       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$53)
    6978                      .dwattr $C$DW$736, DW_AT_name("pid_Id")
    6979                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_pid_Id")
    6980                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    6981                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$737       .dwtag  DW_TAG_member
    6983                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$52)
    6984                      .dwattr $C$DW$737, DW_AT_name("pidHandle_Iq")
    6985                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_pidHandle_Iq")
    6986                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6987                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$738       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$53)
    6990                      .dwattr $C$DW$738, DW_AT_name("pid_Iq")
    6991                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_pid_Iq")
    6992                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6993                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$739       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$52)
    6996                      .dwattr $C$DW$739, DW_AT_name("pidHandle_spd")
    6997                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_pidHandle_spd")
    6998                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6999                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$740       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$53)
    7002                      .dwattr $C$DW$740, DW_AT_name("pid_spd")
    7003                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_pid_spd")
    7004                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7005                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7006              $C$DW$741       .dwtag  DW_TAG_member
    7007                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$55)
    7008                      .dwattr $C$DW$741, DW_AT_name("iparkHandle")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  135

    7009                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_iparkHandle")
    7010                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7011                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7012              $C$DW$742       .dwtag  DW_TAG_member
    7013                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$56)
    7014                      .dwattr $C$DW$742, DW_AT_name("ipark")
    7015                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_ipark")
    7016                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7017                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7018              $C$DW$743       .dwtag  DW_TAG_member
    7019                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$58)
    7020                      .dwattr $C$DW$743, DW_AT_name("svgenHandle")
    7021                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_svgenHandle")
    7022                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7023                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7024              $C$DW$744       .dwtag  DW_TAG_member
    7025                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$59)
    7026                      .dwattr $C$DW$744, DW_AT_name("svgen")
    7027                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_svgen")
    7028                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7029                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7030              $C$DW$745       .dwtag  DW_TAG_member
    7031                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$61)
    7032                      .dwattr $C$DW$745, DW_AT_name("trajHandle_Id")
    7033                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_trajHandle_Id")
    7034                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7035                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7036              $C$DW$746       .dwtag  DW_TAG_member
    7037                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$62)
    7038                      .dwattr $C$DW$746, DW_AT_name("traj_Id")
    7039                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_traj_Id")
    7040                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7041                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7042              $C$DW$747       .dwtag  DW_TAG_member
    7043                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$61)
    7044                      .dwattr $C$DW$747, DW_AT_name("trajHandle_spd")
    7045                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajHandle_spd")
    7046                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7047                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7048              $C$DW$748       .dwtag  DW_TAG_member
    7049                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$62)
    7050                      .dwattr $C$DW$748, DW_AT_name("traj_spd")
    7051                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_traj_spd")
    7052                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7053                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7054              $C$DW$749       .dwtag  DW_TAG_member
    7055                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$61)
    7056                      .dwattr $C$DW$749, DW_AT_name("trajHandle_spdMax")
    7057                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7058                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7059                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7060              $C$DW$750       .dwtag  DW_TAG_member
    7061                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$62)
    7062                      .dwattr $C$DW$750, DW_AT_name("traj_spdMax")
    7063                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_traj_spdMax")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  136

    7064                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7065                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7066              $C$DW$751       .dwtag  DW_TAG_member
    7067                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$63)
    7068                      .dwattr $C$DW$751, DW_AT_name("motorParams")
    7069                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_motorParams")
    7070                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7071                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7072              $C$DW$752       .dwtag  DW_TAG_member
    7073                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$66)
    7074                      .dwattr $C$DW$752, DW_AT_name("waitTimes")
    7075                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_waitTimes")
    7076                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7077                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7078              $C$DW$753       .dwtag  DW_TAG_member
    7079                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$65)
    7080                      .dwattr $C$DW$753, DW_AT_name("counter_state")
    7081                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_counter_state")
    7082                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7083                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7084              $C$DW$754       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$67)
    7086                      .dwattr $C$DW$754, DW_AT_name("numIsrTicksPerCtrlTick")
    7087                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    7088                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7089                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7090              $C$DW$755       .dwtag  DW_TAG_member
    7091                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$67)
    7092                      .dwattr $C$DW$755, DW_AT_name("numCtrlTicksPerCurrentTick")
    7093                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7094                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7095                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7096              $C$DW$756       .dwtag  DW_TAG_member
    7097                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$67)
    7098                      .dwattr $C$DW$756, DW_AT_name("numCtrlTicksPerSpeedTick")
    7099                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7100                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7101                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7102              $C$DW$757       .dwtag  DW_TAG_member
    7103                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$67)
    7104                      .dwattr $C$DW$757, DW_AT_name("numCtrlTicksPerTrajTick")
    7105                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7106                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7107                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7108              $C$DW$758       .dwtag  DW_TAG_member
    7109                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$65)
    7110                      .dwattr $C$DW$758, DW_AT_name("ctrlFreq_Hz")
    7111                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7112                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7113                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7114              $C$DW$759       .dwtag  DW_TAG_member
    7115                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$65)
    7116                      .dwattr $C$DW$759, DW_AT_name("trajFreq_Hz")
    7117                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7118                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  137

    7119                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7120              $C$DW$760       .dwtag  DW_TAG_member
    7121                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$32)
    7122                      .dwattr $C$DW$760, DW_AT_name("trajPeriod_sec")
    7123                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7124                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7125                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7126              $C$DW$761       .dwtag  DW_TAG_member
    7127                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$68)
    7128                      .dwattr $C$DW$761, DW_AT_name("ctrlPeriod_sec")
    7129                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7130                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7131                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7132              $C$DW$762       .dwtag  DW_TAG_member
    7133                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$32)
    7134                      .dwattr $C$DW$762, DW_AT_name("maxVsMag_pu")
    7135                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7136                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7137                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7138              $C$DW$763       .dwtag  DW_TAG_member
    7139                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$69)
    7140                      .dwattr $C$DW$763, DW_AT_name("Iab_in")
    7141                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Iab_in")
    7142                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    7143                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7144              $C$DW$764       .dwtag  DW_TAG_member
    7145                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$69)
    7146                      .dwattr $C$DW$764, DW_AT_name("Iab_filt")
    7147                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Iab_filt")
    7148                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7149                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7150              $C$DW$765       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$69)
    7152                      .dwattr $C$DW$765, DW_AT_name("Idq_in")
    7153                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Idq_in")
    7154                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7155                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7156              $C$DW$766       .dwtag  DW_TAG_member
    7157                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$69)
    7158                      .dwattr $C$DW$766, DW_AT_name("Vab_in")
    7159                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Vab_in")
    7160                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7161                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7162              $C$DW$767       .dwtag  DW_TAG_member
    7163                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$32)
    7164                      .dwattr $C$DW$767, DW_AT_name("spd_out")
    7165                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_spd_out")
    7166                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7167                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7168              $C$DW$768       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$69)
    7170                      .dwattr $C$DW$768, DW_AT_name("Vab_out")
    7171                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Vab_out")
    7172                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7173                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  138

    7174              $C$DW$769       .dwtag  DW_TAG_member
    7175                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$69)
    7176                      .dwattr $C$DW$769, DW_AT_name("Vdq_out")
    7177                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Vdq_out")
    7178                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7179                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7180              $C$DW$770       .dwtag  DW_TAG_member
    7181                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$68)
    7182                      .dwattr $C$DW$770, DW_AT_name("Rhf")
    7183                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Rhf")
    7184                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7185                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7186              $C$DW$771       .dwtag  DW_TAG_member
    7187                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$68)
    7188                      .dwattr $C$DW$771, DW_AT_name("Lhf")
    7189                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Lhf")
    7190                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7191                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7192              $C$DW$772       .dwtag  DW_TAG_member
    7193                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$68)
    7194                      .dwattr $C$DW$772, DW_AT_name("RoverL")
    7195                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_RoverL")
    7196                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7197                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7198              $C$DW$773       .dwtag  DW_TAG_member
    7199                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$32)
    7200                      .dwattr $C$DW$773, DW_AT_name("Kp_Id")
    7201                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Kp_Id")
    7202                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7203                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7204              $C$DW$774       .dwtag  DW_TAG_member
    7205                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$32)
    7206                      .dwattr $C$DW$774, DW_AT_name("Kp_Iq")
    7207                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Kp_Iq")
    7208                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7209                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7210              $C$DW$775       .dwtag  DW_TAG_member
    7211                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$32)
    7212                      .dwattr $C$DW$775, DW_AT_name("Kp_spd")
    7213                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Kp_spd")
    7214                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7215                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7216              $C$DW$776       .dwtag  DW_TAG_member
    7217                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$32)
    7218                      .dwattr $C$DW$776, DW_AT_name("Ki_Id")
    7219                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ki_Id")
    7220                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7221                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7222              $C$DW$777       .dwtag  DW_TAG_member
    7223                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$32)
    7224                      .dwattr $C$DW$777, DW_AT_name("Ki_Iq")
    7225                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ki_Iq")
    7226                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7227                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7228              $C$DW$778       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  139

    7229                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$32)
    7230                      .dwattr $C$DW$778, DW_AT_name("Ki_spd")
    7231                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ki_spd")
    7232                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7233                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7234              $C$DW$779       .dwtag  DW_TAG_member
    7235                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$32)
    7236                      .dwattr $C$DW$779, DW_AT_name("Kd_Id")
    7237                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Kd_Id")
    7238                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7239                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7240              $C$DW$780       .dwtag  DW_TAG_member
    7241                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$32)
    7242                      .dwattr $C$DW$780, DW_AT_name("Kd_Iq")
    7243                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Kd_Iq")
    7244                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7245                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7246              $C$DW$781       .dwtag  DW_TAG_member
    7247                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$32)
    7248                      .dwattr $C$DW$781, DW_AT_name("Kd_spd")
    7249                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Kd_spd")
    7250                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7251                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7252              $C$DW$782       .dwtag  DW_TAG_member
    7253                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$32)
    7254                      .dwattr $C$DW$782, DW_AT_name("Ui_Id")
    7255                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ui_Id")
    7256                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7257                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7258              $C$DW$783       .dwtag  DW_TAG_member
    7259                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$32)
    7260                      .dwattr $C$DW$783, DW_AT_name("Ui_Iq")
    7261                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Ui_Iq")
    7262                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7263                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7264              $C$DW$784       .dwtag  DW_TAG_member
    7265                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$32)
    7266                      .dwattr $C$DW$784, DW_AT_name("Ui_spd")
    7267                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Ui_spd")
    7268                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7269                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7270              $C$DW$785       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$69)
    7272                      .dwattr $C$DW$785, DW_AT_name("Idq_ref")
    7273                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Idq_ref")
    7274                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7275                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7276              $C$DW$786       .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    7278                      .dwattr $C$DW$786, DW_AT_name("IdRated")
    7279                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_IdRated")
    7280                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7281                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7282              $C$DW$787       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  140

    7284                      .dwattr $C$DW$787, DW_AT_name("spd_ref")
    7285                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_spd_ref")
    7286                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7287                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7288              $C$DW$788       .dwtag  DW_TAG_member
    7289                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$32)
    7290                      .dwattr $C$DW$788, DW_AT_name("spd_max")
    7291                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_spd_max")
    7292                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7293                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7294              $C$DW$789       .dwtag  DW_TAG_member
    7295                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$67)
    7296                      .dwattr $C$DW$789, DW_AT_name("counter_current")
    7297                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_counter_current")
    7298                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7299                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7300              $C$DW$790       .dwtag  DW_TAG_member
    7301                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$67)
    7302                      .dwattr $C$DW$790, DW_AT_name("counter_isr")
    7303                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_counter_isr")
    7304                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7305                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7306              $C$DW$791       .dwtag  DW_TAG_member
    7307                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$67)
    7308                      .dwattr $C$DW$791, DW_AT_name("counter_speed")
    7309                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_counter_speed")
    7310                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7311                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7312              $C$DW$792       .dwtag  DW_TAG_member
    7313                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$67)
    7314                      .dwattr $C$DW$792, DW_AT_name("counter_traj")
    7315                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_counter_traj")
    7316                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7317                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7318              $C$DW$793       .dwtag  DW_TAG_member
    7319                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$70)
    7320                      .dwattr $C$DW$793, DW_AT_name("flag_enableCtrl")
    7321                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7322                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7323                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7324              $C$DW$794       .dwtag  DW_TAG_member
    7325                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$70)
    7326                      .dwattr $C$DW$794, DW_AT_name("flag_enableDcBusComp")
    7327                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7328                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7329                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7330              $C$DW$795       .dwtag  DW_TAG_member
    7331                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$70)
    7332                      .dwattr $C$DW$795, DW_AT_name("flag_enablePowerWarp")
    7333                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7334                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7335                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7336              $C$DW$796       .dwtag  DW_TAG_member
    7337                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$70)
    7338                      .dwattr $C$DW$796, DW_AT_name("flag_enableOffset")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  141

    7339                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_flag_enableOffset")
    7340                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7341                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7342              $C$DW$797       .dwtag  DW_TAG_member
    7343                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$70)
    7344                      .dwattr $C$DW$797, DW_AT_name("flag_enableSpeedCtrl")
    7345                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7346                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7347                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7348              $C$DW$798       .dwtag  DW_TAG_member
    7349                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$70)
    7350                      .dwattr $C$DW$798, DW_AT_name("flag_enableUserMotorParams")
    7351                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7352                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7353                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7354              $C$DW$799       .dwtag  DW_TAG_member
    7355                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$69)
    7356                      .dwattr $C$DW$799, DW_AT_name("Idq_offset_pu")
    7357                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7358                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7359                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7360              $C$DW$800       .dwtag  DW_TAG_member
    7361                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$69)
    7362                      .dwattr $C$DW$800, DW_AT_name("Vdq_offset_pu")
    7363                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7364                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7365                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7366              $C$DW$801       .dwtag  DW_TAG_member
    7367                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$32)
    7368                      .dwattr $C$DW$801, DW_AT_name("angle_pu")
    7369                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_angle_pu")
    7370                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7371                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7372              $C$DW$802       .dwtag  DW_TAG_member
    7373                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$32)
    7374                      .dwattr $C$DW$802, DW_AT_name("speed_ref_pu")
    7375                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_speed_ref_pu")
    7376                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7377                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7378              $C$DW$803       .dwtag  DW_TAG_member
    7379                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$32)
    7380                      .dwattr $C$DW$803, DW_AT_name("speed_fb_pu")
    7381                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_speed_fb_pu")
    7382                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7383                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7384              $C$DW$804       .dwtag  DW_TAG_member
    7385                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$32)
    7386                      .dwattr $C$DW$804, DW_AT_name("speed_outMax_pu")
    7387                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7388                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7389                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7390              $C$DW$805       .dwtag  DW_TAG_member
    7391                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$70)
    7392                      .dwattr $C$DW$805, DW_AT_name("flag_enableCurrentCtrl")
    7393                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  142

    7394                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7395                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7396                      .dwendtag $C$DW$T$71
    7397              
    7398              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7399                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$71)
    7400                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    7401              $C$DW$T$170     .dwtag  DW_TAG_pointer_type
    7402                      .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$71)
    7403                      .dwattr $C$DW$T$170, DW_AT_address_class(0x20)
    7404              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7405                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    7406                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    7407              $C$DW$806       .dwtag  DW_TAG_TI_far_type
    7408                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$171)
    7409              $C$DW$T$185     .dwtag  DW_TAG_const_type
    7410                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$806)
    7411              
    7412              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7413                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    7414                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    7415              $C$DW$807       .dwtag  DW_TAG_member
    7416                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$23)
    7417                      .dwattr $C$DW$807, DW_AT_name("rsvd")
    7418                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd")
    7419                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7420                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7421              $C$DW$808       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$73)
    7423                      .dwattr $C$DW$808, DW_AT_name("targetProc")
    7424                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_targetProc")
    7425                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7426                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7427              $C$DW$809       .dwtag  DW_TAG_member
    7428                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$23)
    7429                      .dwattr $C$DW$809, DW_AT_name("major")
    7430                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_major")
    7431                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7432                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7433              $C$DW$810       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$23)
    7435                      .dwattr $C$DW$810, DW_AT_name("minor")
    7436                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_minor")
    7437                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7438                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7439                      .dwendtag $C$DW$T$74
    7440              
    7441              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7442                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    7443                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    7444              
    7445              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7446                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8301_Obj_")
    7447                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    7448              $C$DW$811       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  143

    7449                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$76)
    7450                      .dwattr $C$DW$811, DW_AT_name("spiHandle")
    7451                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_spiHandle")
    7452                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7453                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7454              $C$DW$812       .dwtag  DW_TAG_member
    7455                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$78)
    7456                      .dwattr $C$DW$812, DW_AT_name("gpioHandle")
    7457                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_gpioHandle")
    7458                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7459                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7460              $C$DW$813       .dwtag  DW_TAG_member
    7461                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$80)
    7462                      .dwattr $C$DW$813, DW_AT_name("gpioNumber")
    7463                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_gpioNumber")
    7464                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7465                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7466              $C$DW$814       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$70)
    7468                      .dwattr $C$DW$814, DW_AT_name("RxTimeOut")
    7469                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_RxTimeOut")
    7470                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7471                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7472              $C$DW$815       .dwtag  DW_TAG_member
    7473                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$70)
    7474                      .dwattr $C$DW$815, DW_AT_name("enableTimeOut")
    7475                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_enableTimeOut")
    7476                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7477                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7478                      .dwendtag $C$DW$T$81
    7479              
    7480              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    7481                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$81)
    7482                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    7483              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    7484                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$81)
    7485                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    7486              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    7487                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    7488                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    7489              
    7490              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7491                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7492                      .dwattr $C$DW$T$19, DW_AT_declaration
    7493                      .dwendtag $C$DW$T$19
    7494              
    7495              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7496                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$19)
    7497                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    7498              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7499                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    7500                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    7501              
    7502              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7503                      .dwattr $C$DW$T$82, DW_AT_name("_FILTER_FO_")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  144

    7504                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x0a)
    7505              $C$DW$816       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$32)
    7507                      .dwattr $C$DW$816, DW_AT_name("a1")
    7508                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_a1")
    7509                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7510                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$817       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$32)
    7513                      .dwattr $C$DW$817, DW_AT_name("b0")
    7514                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_b0")
    7515                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7516                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7517              $C$DW$818       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$32)
    7519                      .dwattr $C$DW$818, DW_AT_name("b1")
    7520                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_b1")
    7521                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7522                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7523              $C$DW$819       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$32)
    7525                      .dwattr $C$DW$819, DW_AT_name("x1")
    7526                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_x1")
    7527                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7528                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7529              $C$DW$820       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$32)
    7531                      .dwattr $C$DW$820, DW_AT_name("y1")
    7532                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_y1")
    7533                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7534                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7535                      .dwendtag $C$DW$T$82
    7536              
    7537              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7538                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$82)
    7539                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    7540              $C$DW$T$187     .dwtag  DW_TAG_pointer_type
    7541                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$136)
    7542                      .dwattr $C$DW$T$187, DW_AT_address_class(0x20)
    7543              
    7544              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7545                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7546                      .dwattr $C$DW$T$20, DW_AT_declaration
    7547                      .dwendtag $C$DW$T$20
    7548              
    7549              $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    7550                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$20)
    7551                      .dwattr $C$DW$T$137, DW_AT_address_class(0x20)
    7552              $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7553                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    7554                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    7555              
    7556              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    7557                      .dwattr $C$DW$T$83, DW_AT_name("_FLASH_Obj_")
    7558                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x08)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  145

    7559              $C$DW$821       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$24)
    7561                      .dwattr $C$DW$821, DW_AT_name("FOPT")
    7562                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_FOPT")
    7563                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7564                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7565              $C$DW$822       .dwtag  DW_TAG_member
    7566                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$24)
    7567                      .dwattr $C$DW$822, DW_AT_name("rsvd_1")
    7568                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_rsvd_1")
    7569                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7570                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7571              $C$DW$823       .dwtag  DW_TAG_member
    7572                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$24)
    7573                      .dwattr $C$DW$823, DW_AT_name("FPWR")
    7574                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_FPWR")
    7575                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7576                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7577              $C$DW$824       .dwtag  DW_TAG_member
    7578                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$24)
    7579                      .dwattr $C$DW$824, DW_AT_name("FSTATUS")
    7580                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_FSTATUS")
    7581                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7582                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7583              $C$DW$825       .dwtag  DW_TAG_member
    7584                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$24)
    7585                      .dwattr $C$DW$825, DW_AT_name("FSTDBYWAIT")
    7586                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7587                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7588                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7589              $C$DW$826       .dwtag  DW_TAG_member
    7590                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$24)
    7591                      .dwattr $C$DW$826, DW_AT_name("FACTIVEWAIT")
    7592                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7593                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7594                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7595              $C$DW$827       .dwtag  DW_TAG_member
    7596                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$24)
    7597                      .dwattr $C$DW$827, DW_AT_name("FBANKWAIT")
    7598                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_FBANKWAIT")
    7599                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7600                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7601              $C$DW$828       .dwtag  DW_TAG_member
    7602                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$24)
    7603                      .dwattr $C$DW$828, DW_AT_name("FOTPWAIT")
    7604                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_FOTPWAIT")
    7605                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7606                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7607                      .dwendtag $C$DW$T$83
    7608              
    7609              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    7610                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$83)
    7611                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    7612              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7613                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  146

    7614                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    7615              
    7616              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7617                      .dwattr $C$DW$T$87, DW_AT_name("_GPIO_Obj_")
    7618                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x6a)
    7619              $C$DW$829       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$84)
    7621                      .dwattr $C$DW$829, DW_AT_name("GPACTRL")
    7622                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_GPACTRL")
    7623                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7624                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7625              $C$DW$830       .dwtag  DW_TAG_member
    7626                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$84)
    7627                      .dwattr $C$DW$830, DW_AT_name("GPAQSEL1")
    7628                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_GPAQSEL1")
    7629                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7630                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7631              $C$DW$831       .dwtag  DW_TAG_member
    7632                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$84)
    7633                      .dwattr $C$DW$831, DW_AT_name("GPAQSEL2")
    7634                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_GPAQSEL2")
    7635                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7636                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7637              $C$DW$832       .dwtag  DW_TAG_member
    7638                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$84)
    7639                      .dwattr $C$DW$832, DW_AT_name("GPAMUX1")
    7640                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_GPAMUX1")
    7641                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7642                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7643              $C$DW$833       .dwtag  DW_TAG_member
    7644                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$84)
    7645                      .dwattr $C$DW$833, DW_AT_name("GPAMUX2")
    7646                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_GPAMUX2")
    7647                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7648                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7649              $C$DW$834       .dwtag  DW_TAG_member
    7650                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$84)
    7651                      .dwattr $C$DW$834, DW_AT_name("GPADIR")
    7652                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_GPADIR")
    7653                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7654                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7655              $C$DW$835       .dwtag  DW_TAG_member
    7656                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$84)
    7657                      .dwattr $C$DW$835, DW_AT_name("GPAPUD")
    7658                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_GPAPUD")
    7659                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7660                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7661              $C$DW$836       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$27)
    7663                      .dwattr $C$DW$836, DW_AT_name("rsvd_1")
    7664                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_rsvd_1")
    7665                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7666                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7667              $C$DW$837       .dwtag  DW_TAG_member
    7668                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$84)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:33:59 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2690410                            PAGE  147

    7669                      .dwattr $C$DW$837, DW_AT_name("GPBCTRL")
    7670                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_GPBCTRL")
    7671                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7672                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7673              $C$DW$838       .dwtag  DW_TAG_member
    7674                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$84)
    7675                      .dwattr $C$DW$838, DW_AT_name("GPBQSEL1")
    7676                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_GPBQSEL1")
    7677                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7678                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7679              $C$DW$839       .dwtag  DW_TAG_member
    7680                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$27)
    7681                      .dwattr $C$DW$839, DW_AT_name("rsvd_2")
    7682                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_rsvd_2")
    7683                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7684                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7685              $C$DW$840       .dwtag  DW_TAG_member
    7686                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$84)
    7687                      .dwattr $C$DW$840, DW_AT_name("GPBMUX1")
    7688                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_GPBMUX1")
    7689                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7690                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7691              $C$DW$841       .dwtag  DW_TAG_member
    7692                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$27)
    7693                      .dwattr $C$DW$841, DW_AT_name("rsvd_3")
    7694                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_rsvd_3")
    7695                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7696                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7697              $C$DW$842       .dwtag  DW_TAG_member
    7698                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$84)
    7699                      .dwattr $C$DW$842, DW_AT_name("GPBDIR")
    7700                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_GPBDIR")
    7701                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7702                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7703              $C$DW$843       .dwtag  DW_TAG_member
    7704                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$84)
    7705                      .dwattr $C$DW$843, DW_AT_name("GPBPUD")
    7706                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_GPBPUD")
    7707                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7708                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7709              $C$DW$844       .dwtag  DW_TAG_member
    7710                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$85)
    7711                      .dwattr $C$DW$844, DW_AT_name("rsvd_4")
    7712                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_rsvd_4")
    7713                      .dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7714                      .dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
    7715              $C$DW$845       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$845, DW_AT_type(*$C$DW$T$84)
    7717                      .dwattr $C$DW$845, DW_AT_name("AIOMUX1")
    7718                      .dwattr $C$DW$845, DW_AT_TI_symbol_name("_AIOMUX1")
    7719                      .dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7720                      .dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
    7721              $C$DW$846       .dwtag  DW_TAG_member
