TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Fri Jan 20 18:10:48 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/bee25/Documents/Visual Studio 2015/Projects/telescopeControlle
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bee25\Documents\Visual Studio 2015\Projects\telescopeContr
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("WDOG_disable")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_WDOG_disable")

   10807                      .dwendtag $C$DW$T$332
   10808              
   10809              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
   10810                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$332)
   10811                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10812              $C$DW$1848      .dwtag  DW_TAG_TI_far_type
   10813                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$333)
   10814              $C$DW$T$334     .dwtag  DW_TAG_const_type
   10815                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$1848)
   10816              
   10817              $C$DW$T$335     .dwtag  DW_TAG_enumeration_type
   10818                      .dwattr $C$DW$T$335, DW_AT_byte_size(0x01)
   10819              $C$DW$1849      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  208

   10820              $C$DW$1850      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
   10821              $C$DW$1851      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
   10822                      .dwendtag $C$DW$T$335
   10823              
   10824              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
   10825                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
   10826                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
   10827              $C$DW$1852      .dwtag  DW_TAG_TI_far_type
   10828                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$336)
   10829              $C$DW$T$337     .dwtag  DW_TAG_const_type
   10830                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$1852)
   10831              
   10832              $C$DW$T$338     .dwtag  DW_TAG_enumeration_type
   10833                      .dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
   10834              $C$DW$1853      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
   10835              $C$DW$1854      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
   10836              $C$DW$1855      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
   10837                      .dwendtag $C$DW$T$338
   10838              
   10839              $C$DW$T$339     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
   10840                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
   10841                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   10842              $C$DW$1856      .dwtag  DW_TAG_TI_far_type
   10843                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$339)
   10844              $C$DW$T$340     .dwtag  DW_TAG_const_type
   10845                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$1856)
   10846              
   10847              $C$DW$T$341     .dwtag  DW_TAG_enumeration_type
   10848                      .dwattr $C$DW$T$341, DW_AT_byte_size(0x01)
   10849              $C$DW$1857      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
   10850              $C$DW$1858      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
   10851              $C$DW$1859      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
   10852              $C$DW$1860      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
   10853              $C$DW$1861      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
   10854              $C$DW$1862      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
   10855              $C$DW$1863      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
   10856                      .dwendtag $C$DW$T$341
   10857              
   10858              $C$DW$T$342     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
   10859                      .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
   10860                      .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
   10861              
   10862              $C$DW$T$343     .dwtag  DW_TAG_enumeration_type
   10863                      .dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
   10864              $C$DW$1864      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10865              $C$DW$1865      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10866                      .dwendtag $C$DW$T$343
   10867              
   10868              $C$DW$T$344     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10869                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
   10870                      .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   10871              
   10872              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10873                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10874                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  209

   10875              $C$DW$1866      .dwtag  DW_TAG_member
   10876                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$24)
   10877                      .dwattr $C$DW$1866, DW_AT_name("ADCRESULT")
   10878                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_ADCRESULT")
   10879                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10880                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10881              $C$DW$1867      .dwtag  DW_TAG_member
   10882                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$25)
   10883                      .dwattr $C$DW$1867, DW_AT_name("resvd_1")
   10884                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_resvd_1")
   10885                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10886                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10887              $C$DW$1868      .dwtag  DW_TAG_member
   10888                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10889                      .dwattr $C$DW$1868, DW_AT_name("ADCCTL1")
   10890                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ADCCTL1")
   10891                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10892                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10893              $C$DW$1869      .dwtag  DW_TAG_member
   10894                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   10895                      .dwattr $C$DW$1869, DW_AT_name("ADCCTL2")
   10896                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_ADCCTL2")
   10897                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10898                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10899              $C$DW$1870      .dwtag  DW_TAG_member
   10900                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$26)
   10901                      .dwattr $C$DW$1870, DW_AT_name("rsvd_2")
   10902                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_rsvd_2")
   10903                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10904                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10905              $C$DW$1871      .dwtag  DW_TAG_member
   10906                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10907                      .dwattr $C$DW$1871, DW_AT_name("ADCINTFLG")
   10908                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_ADCINTFLG")
   10909                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10910                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10911              $C$DW$1872      .dwtag  DW_TAG_member
   10912                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$23)
   10913                      .dwattr $C$DW$1872, DW_AT_name("ADCINTFLGCLR")
   10914                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10915                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10916                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10917              $C$DW$1873      .dwtag  DW_TAG_member
   10918                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$23)
   10919                      .dwattr $C$DW$1873, DW_AT_name("ADCINTOVF")
   10920                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_ADCINTOVF")
   10921                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10922                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10923              $C$DW$1874      .dwtag  DW_TAG_member
   10924                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$23)
   10925                      .dwattr $C$DW$1874, DW_AT_name("ADCINTOVFCLR")
   10926                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10927                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10928                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10929              $C$DW$1875      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  210

   10930                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$27)
   10931                      .dwattr $C$DW$1875, DW_AT_name("INTSELxNy")
   10932                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_INTSELxNy")
   10933                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10934                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10935              $C$DW$1876      .dwtag  DW_TAG_member
   10936                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$28)
   10937                      .dwattr $C$DW$1876, DW_AT_name("rsvd_3")
   10938                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_rsvd_3")
   10939                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10940                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10941              $C$DW$1877      .dwtag  DW_TAG_member
   10942                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$23)
   10943                      .dwattr $C$DW$1877, DW_AT_name("SOCPRICTRL")
   10944                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10945                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10946                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10947              $C$DW$1878      .dwtag  DW_TAG_member
   10948                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10949                      .dwattr $C$DW$1878, DW_AT_name("rsvd_4")
   10950                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_rsvd_4")
   10951                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10952                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10953              $C$DW$1879      .dwtag  DW_TAG_member
   10954                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10955                      .dwattr $C$DW$1879, DW_AT_name("ADCSAMPLEMODE")
   10956                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10957                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10958                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10959              $C$DW$1880      .dwtag  DW_TAG_member
   10960                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$23)
   10961                      .dwattr $C$DW$1880, DW_AT_name("rsvd_5")
   10962                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_rsvd_5")
   10963                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10964                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10965              $C$DW$1881      .dwtag  DW_TAG_member
   10966                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$23)
   10967                      .dwattr $C$DW$1881, DW_AT_name("ADCINTSOCSEL1")
   10968                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10969                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10970                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10971              $C$DW$1882      .dwtag  DW_TAG_member
   10972                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$23)
   10973                      .dwattr $C$DW$1882, DW_AT_name("ADCINTSOCSEL2")
   10974                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10975                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10976                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10977              $C$DW$1883      .dwtag  DW_TAG_member
   10978                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$26)
   10979                      .dwattr $C$DW$1883, DW_AT_name("rsvd_6")
   10980                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_rsvd_6")
   10981                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10982                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10983              $C$DW$1884      .dwtag  DW_TAG_member
   10984                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  211

   10985                      .dwattr $C$DW$1884, DW_AT_name("ADCSOCFLG1")
   10986                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10987                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10988                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10989              $C$DW$1885      .dwtag  DW_TAG_member
   10990                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$23)
   10991                      .dwattr $C$DW$1885, DW_AT_name("rsvd_7")
   10992                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_7")
   10993                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10994                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10995              $C$DW$1886      .dwtag  DW_TAG_member
   10996                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$23)
   10997                      .dwattr $C$DW$1886, DW_AT_name("ADCSOCFRC1")
   10998                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10999                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   11000                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   11001              $C$DW$1887      .dwtag  DW_TAG_member
   11002                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$23)
   11003                      .dwattr $C$DW$1887, DW_AT_name("rsvd_8")
   11004                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_8")
   11005                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   11006                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   11007              $C$DW$1888      .dwtag  DW_TAG_member
   11008                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$23)
   11009                      .dwattr $C$DW$1888, DW_AT_name("ADCSOCOVF1")
   11010                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   11011                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   11012                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   11013              $C$DW$1889      .dwtag  DW_TAG_member
   11014                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$23)
   11015                      .dwattr $C$DW$1889, DW_AT_name("rsvd_9")
   11016                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_rsvd_9")
   11017                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   11018                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   11019              $C$DW$1890      .dwtag  DW_TAG_member
   11020                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$23)
   11021                      .dwattr $C$DW$1890, DW_AT_name("ADCSOCOVFCLR1")
   11022                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   11023                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   11024                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   11025              $C$DW$1891      .dwtag  DW_TAG_member
   11026                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$23)
   11027                      .dwattr $C$DW$1891, DW_AT_name("rsvd_10")
   11028                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_rsvd_10")
   11029                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   11030                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   11031              $C$DW$1892      .dwtag  DW_TAG_member
   11032                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$24)
   11033                      .dwattr $C$DW$1892, DW_AT_name("ADCSOCxCTL")
   11034                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   11035                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   11036                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   11037              $C$DW$1893      .dwtag  DW_TAG_member
   11038                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$24)
   11039                      .dwattr $C$DW$1893, DW_AT_name("rsvd_11")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  212

   11040                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_11")
   11041                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   11042                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   11043              $C$DW$1894      .dwtag  DW_TAG_member
   11044                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$23)
   11045                      .dwattr $C$DW$1894, DW_AT_name("ADCREFTRIM")
   11046                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_ADCREFTRIM")
   11047                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   11048                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   11049              $C$DW$1895      .dwtag  DW_TAG_member
   11050                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$23)
   11051                      .dwattr $C$DW$1895, DW_AT_name("ADCOFFTRIM")
   11052                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   11053                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   11054                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   11055              $C$DW$1896      .dwtag  DW_TAG_member
   11056                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$29)
   11057                      .dwattr $C$DW$1896, DW_AT_name("resvd_12")
   11058                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_resvd_12")
   11059                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   11060                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   11061              $C$DW$1897      .dwtag  DW_TAG_member
   11062                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$23)
   11063                      .dwattr $C$DW$1897, DW_AT_name("ADCREV")
   11064                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_ADCREV")
   11065                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   11066                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   11067                      .dwendtag $C$DW$T$30
   11068              
   11069              $C$DW$T$346     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   11070                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$30)
   11071                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   11072              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   11073                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$30)
   11074                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   11075              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   11076                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   11077                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   11078              
   11079              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   11080                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   11081                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   11082              $C$DW$1898      .dwtag  DW_TAG_member
   11083                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$23)
   11084                      .dwattr $C$DW$1898, DW_AT_name("XCLK")
   11085                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_XCLK")
   11086                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11087                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   11088              $C$DW$1899      .dwtag  DW_TAG_member
   11089                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$23)
   11090                      .dwattr $C$DW$1899, DW_AT_name("rsvd_1")
   11091                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_rsvd_1")
   11092                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11093                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   11094              $C$DW$1900      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  213

   11095                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$23)
   11096                      .dwattr $C$DW$1900, DW_AT_name("CLKCTL")
   11097                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_CLKCTL")
   11098                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11099                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   11100              $C$DW$1901      .dwtag  DW_TAG_member
   11101                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$31)
   11102                      .dwattr $C$DW$1901, DW_AT_name("rsvd_2")
   11103                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_2")
   11104                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11105                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   11106              $C$DW$1902      .dwtag  DW_TAG_member
   11107                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$23)
   11108                      .dwattr $C$DW$1902, DW_AT_name("LOSPCP")
   11109                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_LOSPCP")
   11110                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11111                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   11112              $C$DW$1903      .dwtag  DW_TAG_member
   11113                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$23)
   11114                      .dwattr $C$DW$1903, DW_AT_name("PCLKCR0")
   11115                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_PCLKCR0")
   11116                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11117                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   11118              $C$DW$1904      .dwtag  DW_TAG_member
   11119                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$23)
   11120                      .dwattr $C$DW$1904, DW_AT_name("PCLKCR1")
   11121                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_PCLKCR1")
   11122                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11123                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   11124              $C$DW$1905      .dwtag  DW_TAG_member
   11125                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$26)
   11126                      .dwattr $C$DW$1905, DW_AT_name("rsvd_3")
   11127                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_rsvd_3")
   11128                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11129                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   11130              $C$DW$1906      .dwtag  DW_TAG_member
   11131                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$23)
   11132                      .dwattr $C$DW$1906, DW_AT_name("PCLKCR3")
   11133                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_PCLKCR3")
   11134                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11135                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   11136                      .dwendtag $C$DW$T$32
   11137              
   11138              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   11139                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$32)
   11140                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   11141              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   11142                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   11143                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   11144              
   11145              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   11146                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   11147                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   11148              $C$DW$1907      .dwtag  DW_TAG_member
   11149                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  214

   11150                      .dwattr $C$DW$1907, DW_AT_name("tmp")
   11151                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_tmp")
   11152                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11153                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   11154                      .dwendtag $C$DW$T$34
   11155              
   11156              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   11157                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$34)
   11158                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11159              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
   11160                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$34)
   11161                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
   11162              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   11163                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   11164                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   11165              
   11166              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11167                      .dwattr $C$DW$T$37, DW_AT_name("_CTRL_Version_")
   11168                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
   11169              $C$DW$1908      .dwtag  DW_TAG_member
   11170                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$22)
   11171                      .dwattr $C$DW$1908, DW_AT_name("rsvd")
   11172                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_rsvd")
   11173                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11174                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   11175              $C$DW$1909      .dwtag  DW_TAG_member
   11176                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$36)
   11177                      .dwattr $C$DW$1909, DW_AT_name("targetProc")
   11178                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_targetProc")
   11179                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11180                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   11181              $C$DW$1910      .dwtag  DW_TAG_member
   11182                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$22)
   11183                      .dwattr $C$DW$1910, DW_AT_name("major")
   11184                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_major")
   11185                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11186                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   11187              $C$DW$1911      .dwtag  DW_TAG_member
   11188                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$22)
   11189                      .dwattr $C$DW$1911, DW_AT_name("minor")
   11190                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_minor")
   11191                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11192                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   11193                      .dwendtag $C$DW$T$37
   11194              
   11195              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
   11196                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$37)
   11197                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   11198              
   11199              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   11200                      .dwattr $C$DW$T$45, DW_AT_name("_DRV8301_Obj_")
   11201                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
   11202              $C$DW$1912      .dwtag  DW_TAG_member
   11203                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   11204                      .dwattr $C$DW$1912, DW_AT_name("spiHandle")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  215

   11205                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_spiHandle")
   11206                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11207                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   11208              $C$DW$1913      .dwtag  DW_TAG_member
   11209                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$41)
   11210                      .dwattr $C$DW$1913, DW_AT_name("gpioHandle")
   11211                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_gpioHandle")
   11212                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11213                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   11214              $C$DW$1914      .dwtag  DW_TAG_member
   11215                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$43)
   11216                      .dwattr $C$DW$1914, DW_AT_name("gpioNumber")
   11217                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_gpioNumber")
   11218                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11219                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   11220              $C$DW$1915      .dwtag  DW_TAG_member
   11221                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$44)
   11222                      .dwattr $C$DW$1915, DW_AT_name("RxTimeOut")
   11223                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_RxTimeOut")
   11224                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11225                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   11226              $C$DW$1916      .dwtag  DW_TAG_member
   11227                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$44)
   11228                      .dwattr $C$DW$1916, DW_AT_name("enableTimeOut")
   11229                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_enableTimeOut")
   11230                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11231                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   11232                      .dwendtag $C$DW$T$45
   11233              
   11234              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   11235                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$45)
   11236                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   11237              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
   11238                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$45)
   11239                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
   11240              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   11241                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
   11242                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   11243              
   11244              $C$DW$T$56      .dwtag  DW_TAG_structure_type
   11245                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   11246                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
   11247              $C$DW$1917      .dwtag  DW_TAG_member
   11248                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$47)
   11249                      .dwattr $C$DW$1917, DW_AT_name("DRV8301_CURRENT")
   11250                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   11251                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11252                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   11253              $C$DW$1918      .dwtag  DW_TAG_member
   11254                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$49)
   11255                      .dwattr $C$DW$1918, DW_AT_name("DRV8301_RESET")
   11256                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_DRV8301_RESET")
   11257                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11258                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   11259              $C$DW$1919      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  216

   11260                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$51)
   11261                      .dwattr $C$DW$1919, DW_AT_name("PWM_MODE")
   11262                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_PWM_MODE")
   11263                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11264                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   11265              $C$DW$1920      .dwtag  DW_TAG_member
   11266                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$53)
   11267                      .dwattr $C$DW$1920, DW_AT_name("OC_MODE")
   11268                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_OC_MODE")
   11269                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11270                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   11271              $C$DW$1921      .dwtag  DW_TAG_member
   11272                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$55)
   11273                      .dwattr $C$DW$1921, DW_AT_name("OC_ADJ_SET")
   11274                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   11275                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11276                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   11277                      .dwendtag $C$DW$T$56
   11278              
   11279              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   11280                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$56)
   11281                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   11282              
   11283              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   11284                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   11285                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
   11286              $C$DW$1922      .dwtag  DW_TAG_member
   11287                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$58)
   11288                      .dwattr $C$DW$1922, DW_AT_name("OCTW_SET")
   11289                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_OCTW_SET")
   11290                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11291                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   11292              $C$DW$1923      .dwtag  DW_TAG_member
   11293                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$60)
   11294                      .dwattr $C$DW$1923, DW_AT_name("GAIN")
   11295                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_GAIN")
   11296                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11297                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   11298              $C$DW$1924      .dwtag  DW_TAG_member
   11299                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$62)
   11300                      .dwattr $C$DW$1924, DW_AT_name("DC_CAL_CH1p2")
   11301                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   11302                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11303                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   11304              $C$DW$1925      .dwtag  DW_TAG_member
   11305                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$64)
   11306                      .dwattr $C$DW$1925, DW_AT_name("OC_TOFF")
   11307                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_OC_TOFF")
   11308                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11309                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   11310                      .dwendtag $C$DW$T$65
   11311              
   11312              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   11313                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$65)
   11314                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  217

   11315              
   11316              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   11317                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   11318                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0b)
   11319              $C$DW$1926      .dwtag  DW_TAG_member
   11320                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$44)
   11321                      .dwattr $C$DW$1926, DW_AT_name("FAULT")
   11322                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_FAULT")
   11323                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11324                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   11325              $C$DW$1927      .dwtag  DW_TAG_member
   11326                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$44)
   11327                      .dwattr $C$DW$1927, DW_AT_name("GVDD_UV")
   11328                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_GVDD_UV")
   11329                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11330                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   11331              $C$DW$1928      .dwtag  DW_TAG_member
   11332                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$44)
   11333                      .dwattr $C$DW$1928, DW_AT_name("PVDD_UV")
   11334                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_PVDD_UV")
   11335                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11336                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   11337              $C$DW$1929      .dwtag  DW_TAG_member
   11338                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$44)
   11339                      .dwattr $C$DW$1929, DW_AT_name("OTSD")
   11340                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_OTSD")
   11341                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11342                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   11343              $C$DW$1930      .dwtag  DW_TAG_member
   11344                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$44)
   11345                      .dwattr $C$DW$1930, DW_AT_name("OTW")
   11346                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_OTW")
   11347                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11348                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   11349              $C$DW$1931      .dwtag  DW_TAG_member
   11350                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$44)
   11351                      .dwattr $C$DW$1931, DW_AT_name("FETHA_OC")
   11352                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_FETHA_OC")
   11353                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11354                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   11355              $C$DW$1932      .dwtag  DW_TAG_member
   11356                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$44)
   11357                      .dwattr $C$DW$1932, DW_AT_name("FETLA_OC")
   11358                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_FETLA_OC")
   11359                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11360                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   11361              $C$DW$1933      .dwtag  DW_TAG_member
   11362                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$44)
   11363                      .dwattr $C$DW$1933, DW_AT_name("FETHB_OC")
   11364                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_FETHB_OC")
   11365                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11366                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   11367              $C$DW$1934      .dwtag  DW_TAG_member
   11368                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$44)
   11369                      .dwattr $C$DW$1934, DW_AT_name("FETLB_OC")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  218

   11370                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_FETLB_OC")
   11371                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11372                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   11373              $C$DW$1935      .dwtag  DW_TAG_member
   11374                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$44)
   11375                      .dwattr $C$DW$1935, DW_AT_name("FETHC_OC")
   11376                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_FETHC_OC")
   11377                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11378                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   11379              $C$DW$1936      .dwtag  DW_TAG_member
   11380                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$44)
   11381                      .dwattr $C$DW$1936, DW_AT_name("FETLC_OC")
   11382                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_FETLC_OC")
   11383                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11384                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   11385                      .dwendtag $C$DW$T$66
   11386              
   11387              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   11388                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
   11389                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   11390              
   11391              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   11392                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   11393                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
   11394              $C$DW$1937      .dwtag  DW_TAG_member
   11395                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$44)
   11396                      .dwattr $C$DW$1937, DW_AT_name("GVDD_OV")
   11397                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_GVDD_OV")
   11398                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11399                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   11400              $C$DW$1938      .dwtag  DW_TAG_member
   11401                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$22)
   11402                      .dwattr $C$DW$1938, DW_AT_name("DeviceID")
   11403                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_DeviceID")
   11404                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11405                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   11406                      .dwendtag $C$DW$T$67
   11407              
   11408              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   11409                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
   11410                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   11411              
   11412              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   11413                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   11414                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
   11415              $C$DW$1939      .dwtag  DW_TAG_member
   11416                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$68)
   11417                      .dwattr $C$DW$1939, DW_AT_name("Stat_Reg_1")
   11418                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_Stat_Reg_1")
   11419                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11420                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   11421              $C$DW$1940      .dwtag  DW_TAG_member
   11422                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$69)
   11423                      .dwattr $C$DW$1940, DW_AT_name("Stat_Reg_2")
   11424                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_Stat_Reg_2")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  219

   11425                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11426                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11427              $C$DW$1941      .dwtag  DW_TAG_member
   11428                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$70)
   11429                      .dwattr $C$DW$1941, DW_AT_name("Ctrl_Reg_1")
   11430                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   11431                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11432                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11433              $C$DW$1942      .dwtag  DW_TAG_member
   11434                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$71)
   11435                      .dwattr $C$DW$1942, DW_AT_name("Ctrl_Reg_2")
   11436                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   11437                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11438                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   11439              $C$DW$1943      .dwtag  DW_TAG_member
   11440                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$44)
   11441                      .dwattr $C$DW$1943, DW_AT_name("SndCmd")
   11442                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_SndCmd")
   11443                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11444                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11445              $C$DW$1944      .dwtag  DW_TAG_member
   11446                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$44)
   11447                      .dwattr $C$DW$1944, DW_AT_name("RcvCmd")
   11448                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_RcvCmd")
   11449                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   11450                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11451                      .dwendtag $C$DW$T$72
   11452              
   11453              $C$DW$T$362     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   11454                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$72)
   11455                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   11456              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   11457                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   11458                      .dwattr $C$DW$T$363, DW_AT_address_class(0x20)
   11459              
   11460              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   11461                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
   11462                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
   11463              $C$DW$1945      .dwtag  DW_TAG_member
   11464                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$73)
   11465                      .dwattr $C$DW$1945, DW_AT_name("a1")
   11466                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_a1")
   11467                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11468                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11469              $C$DW$1946      .dwtag  DW_TAG_member
   11470                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$73)
   11471                      .dwattr $C$DW$1946, DW_AT_name("b0")
   11472                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_b0")
   11473                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11474                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11475              $C$DW$1947      .dwtag  DW_TAG_member
   11476                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$73)
   11477                      .dwattr $C$DW$1947, DW_AT_name("b1")
   11478                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_b1")
   11479                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  220

   11480                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11481              $C$DW$1948      .dwtag  DW_TAG_member
   11482                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$73)
   11483                      .dwattr $C$DW$1948, DW_AT_name("x1")
   11484                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_x1")
   11485                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11486                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11487              $C$DW$1949      .dwtag  DW_TAG_member
   11488                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$73)
   11489                      .dwattr $C$DW$1949, DW_AT_name("y1")
   11490                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_y1")
   11491                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11492                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11493                      .dwendtag $C$DW$T$74
   11494              
   11495              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   11496                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$74)
   11497                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   11498              
   11499              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   11500                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   11501                      .dwattr $C$DW$T$19, DW_AT_declaration
   11502                      .dwendtag $C$DW$T$19
   11503              
   11504              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
   11505                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
   11506                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
   11507              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   11508                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
   11509                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
   11510              
   11511              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   11512                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
   11513                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
   11514              $C$DW$1950      .dwtag  DW_TAG_member
   11515                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$23)
   11516                      .dwattr $C$DW$1950, DW_AT_name("FOPT")
   11517                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_FOPT")
   11518                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11519                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11520              $C$DW$1951      .dwtag  DW_TAG_member
   11521                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$23)
   11522                      .dwattr $C$DW$1951, DW_AT_name("rsvd_1")
   11523                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_rsvd_1")
   11524                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11525                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11526              $C$DW$1952      .dwtag  DW_TAG_member
   11527                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$23)
   11528                      .dwattr $C$DW$1952, DW_AT_name("FPWR")
   11529                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_FPWR")
   11530                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11531                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11532              $C$DW$1953      .dwtag  DW_TAG_member
   11533                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$23)
   11534                      .dwattr $C$DW$1953, DW_AT_name("FSTATUS")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  221

   11535                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_FSTATUS")
   11536                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11537                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11538              $C$DW$1954      .dwtag  DW_TAG_member
   11539                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$23)
   11540                      .dwattr $C$DW$1954, DW_AT_name("FSTDBYWAIT")
   11541                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   11542                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11543                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11544              $C$DW$1955      .dwtag  DW_TAG_member
   11545                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$23)
   11546                      .dwattr $C$DW$1955, DW_AT_name("FACTIVEWAIT")
   11547                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   11548                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11549                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11550              $C$DW$1956      .dwtag  DW_TAG_member
   11551                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$23)
   11552                      .dwattr $C$DW$1956, DW_AT_name("FBANKWAIT")
   11553                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_FBANKWAIT")
   11554                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11555                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11556              $C$DW$1957      .dwtag  DW_TAG_member
   11557                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$23)
   11558                      .dwattr $C$DW$1957, DW_AT_name("FOTPWAIT")
   11559                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_FOTPWAIT")
   11560                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11561                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11562                      .dwendtag $C$DW$T$75
   11563              
   11564              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
   11565                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$75)
   11566                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
   11567              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   11568                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11569                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11570              
   11571              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   11572                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
   11573                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
   11574              $C$DW$1958      .dwtag  DW_TAG_member
   11575                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$77)
   11576                      .dwattr $C$DW$1958, DW_AT_name("GPACTRL")
   11577                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_GPACTRL")
   11578                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11579                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11580              $C$DW$1959      .dwtag  DW_TAG_member
   11581                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$77)
   11582                      .dwattr $C$DW$1959, DW_AT_name("GPAQSEL1")
   11583                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_GPAQSEL1")
   11584                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11585                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11586              $C$DW$1960      .dwtag  DW_TAG_member
   11587                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$77)
   11588                      .dwattr $C$DW$1960, DW_AT_name("GPAQSEL2")
   11589                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_GPAQSEL2")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  222

   11590                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11591                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11592              $C$DW$1961      .dwtag  DW_TAG_member
   11593                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$77)
   11594                      .dwattr $C$DW$1961, DW_AT_name("GPAMUX1")
   11595                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_GPAMUX1")
   11596                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11597                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   11598              $C$DW$1962      .dwtag  DW_TAG_member
   11599                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$77)
   11600                      .dwattr $C$DW$1962, DW_AT_name("GPAMUX2")
   11601                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_GPAMUX2")
   11602                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11603                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11604              $C$DW$1963      .dwtag  DW_TAG_member
   11605                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$77)
   11606                      .dwattr $C$DW$1963, DW_AT_name("GPADIR")
   11607                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_GPADIR")
   11608                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11609                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11610              $C$DW$1964      .dwtag  DW_TAG_member
   11611                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$77)
   11612                      .dwattr $C$DW$1964, DW_AT_name("GPAPUD")
   11613                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_GPAPUD")
   11614                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11615                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11616              $C$DW$1965      .dwtag  DW_TAG_member
   11617                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$26)
   11618                      .dwattr $C$DW$1965, DW_AT_name("rsvd_1")
   11619                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_rsvd_1")
   11620                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11621                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11622              $C$DW$1966      .dwtag  DW_TAG_member
   11623                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$77)
   11624                      .dwattr $C$DW$1966, DW_AT_name("GPBCTRL")
   11625                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_GPBCTRL")
   11626                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11627                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11628              $C$DW$1967      .dwtag  DW_TAG_member
   11629                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$77)
   11630                      .dwattr $C$DW$1967, DW_AT_name("GPBQSEL1")
   11631                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_GPBQSEL1")
   11632                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11633                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11634              $C$DW$1968      .dwtag  DW_TAG_member
   11635                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$26)
   11636                      .dwattr $C$DW$1968, DW_AT_name("rsvd_2")
   11637                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_rsvd_2")
   11638                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11639                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   11640              $C$DW$1969      .dwtag  DW_TAG_member
   11641                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$77)
   11642                      .dwattr $C$DW$1969, DW_AT_name("GPBMUX1")
   11643                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_GPBMUX1")
   11644                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  223

   11645                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11646              $C$DW$1970      .dwtag  DW_TAG_member
   11647                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$26)
   11648                      .dwattr $C$DW$1970, DW_AT_name("rsvd_3")
   11649                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_rsvd_3")
   11650                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11651                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11652              $C$DW$1971      .dwtag  DW_TAG_member
   11653                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$77)
   11654                      .dwattr $C$DW$1971, DW_AT_name("GPBDIR")
   11655                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_GPBDIR")
   11656                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11657                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11658              $C$DW$1972      .dwtag  DW_TAG_member
   11659                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$77)
   11660                      .dwattr $C$DW$1972, DW_AT_name("GPBPUD")
   11661                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_GPBPUD")
   11662                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11663                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11664              $C$DW$1973      .dwtag  DW_TAG_member
   11665                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$78)
   11666                      .dwattr $C$DW$1973, DW_AT_name("rsvd_4")
   11667                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_rsvd_4")
   11668                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11669                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11670              $C$DW$1974      .dwtag  DW_TAG_member
   11671                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$77)
   11672                      .dwattr $C$DW$1974, DW_AT_name("AIOMUX1")
   11673                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_AIOMUX1")
   11674                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11675                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11676              $C$DW$1975      .dwtag  DW_TAG_member
   11677                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$26)
   11678                      .dwattr $C$DW$1975, DW_AT_name("rsvd_5")
   11679                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_rsvd_5")
   11680                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   11681                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11682              $C$DW$1976      .dwtag  DW_TAG_member
   11683                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$77)
   11684                      .dwattr $C$DW$1976, DW_AT_name("AIODIR")
   11685                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_AIODIR")
   11686                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11687                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11688              $C$DW$1977      .dwtag  DW_TAG_member
   11689                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$79)
   11690                      .dwattr $C$DW$1977, DW_AT_name("rsvd_6")
   11691                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_rsvd_6")
   11692                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   11693                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   11694              $C$DW$1978      .dwtag  DW_TAG_member
   11695                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$77)
   11696                      .dwattr $C$DW$1978, DW_AT_name("GPADAT")
   11697                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_GPADAT")
   11698                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11699                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  224

   11700              $C$DW$1979      .dwtag  DW_TAG_member
   11701                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$77)
   11702                      .dwattr $C$DW$1979, DW_AT_name("GPASET")
   11703                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_GPASET")
   11704                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   11705                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11706              $C$DW$1980      .dwtag  DW_TAG_member
   11707                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$77)
   11708                      .dwattr $C$DW$1980, DW_AT_name("GPACLEAR")
   11709                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_GPACLEAR")
   11710                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   11711                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11712              $C$DW$1981      .dwtag  DW_TAG_member
   11713                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$77)
   11714                      .dwattr $C$DW$1981, DW_AT_name("GPATOGGLE")
   11715                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_GPATOGGLE")
   11716                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11717                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11718              $C$DW$1982      .dwtag  DW_TAG_member
   11719                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$77)
   11720                      .dwattr $C$DW$1982, DW_AT_name("GPBDAT")
   11721                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_GPBDAT")
   11722                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   11723                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11724              $C$DW$1983      .dwtag  DW_TAG_member
   11725                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$77)
   11726                      .dwattr $C$DW$1983, DW_AT_name("GPBSET")
   11727                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_GPBSET")
   11728                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11729                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11730              $C$DW$1984      .dwtag  DW_TAG_member
   11731                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$77)
   11732                      .dwattr $C$DW$1984, DW_AT_name("GPBCLEAR")
   11733                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_GPBCLEAR")
   11734                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   11735                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   11736              $C$DW$1985      .dwtag  DW_TAG_member
   11737                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$77)
   11738                      .dwattr $C$DW$1985, DW_AT_name("GPBTOGGLE")
   11739                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_GPBTOGGLE")
   11740                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11741                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   11742              $C$DW$1986      .dwtag  DW_TAG_member
   11743                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$31)
   11744                      .dwattr $C$DW$1986, DW_AT_name("rsvd_7")
   11745                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_rsvd_7")
   11746                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   11747                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   11748              $C$DW$1987      .dwtag  DW_TAG_member
   11749                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$77)
   11750                      .dwattr $C$DW$1987, DW_AT_name("AIODAT")
   11751                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_AIODAT")
   11752                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   11753                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   11754              $C$DW$1988      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  225

   11755                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$77)
   11756                      .dwattr $C$DW$1988, DW_AT_name("AIOSET")
   11757                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_AIOSET")
   11758                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11759                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   11760              $C$DW$1989      .dwtag  DW_TAG_member
   11761                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$77)
   11762                      .dwattr $C$DW$1989, DW_AT_name("AIOCLEAR")
   11763                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_AIOCLEAR")
   11764                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   11765                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   11766              $C$DW$1990      .dwtag  DW_TAG_member
   11767                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$77)
   11768                      .dwattr $C$DW$1990, DW_AT_name("AIOTOGGLE")
   11769                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_AIOTOGGLE")
   11770                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11771                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   11772              $C$DW$1991      .dwtag  DW_TAG_member
   11773                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$28)
   11774                      .dwattr $C$DW$1991, DW_AT_name("GPIOXINTnSEL")
   11775                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   11776                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   11777                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   11778              $C$DW$1992      .dwtag  DW_TAG_member
   11779                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$27)
   11780                      .dwattr $C$DW$1992, DW_AT_name("rsvd_8")
   11781                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_rsvd_8")
   11782                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   11783                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   11784              $C$DW$1993      .dwtag  DW_TAG_member
   11785                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$77)
   11786                      .dwattr $C$DW$1993, DW_AT_name("GPIOLPMSEL")
   11787                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   11788                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   11789                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   11790                      .dwendtag $C$DW$T$80
   11791              
   11792              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   11793                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$80)
   11794                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
   11795              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   11796                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
   11797                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
   11798              
   11799              $C$DW$T$82      .dwtag  DW_TAG_structure_type
   11800                      .dwattr $C$DW$T$82, DW_AT_name("_HAL_AdcData_t_")
   11801                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x10)
   11802              $C$DW$1994      .dwtag  DW_TAG_member
   11803                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$81)
   11804                      .dwattr $C$DW$1994, DW_AT_name("I")
   11805                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_I")
   11806                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11807                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   11808              $C$DW$1995      .dwtag  DW_TAG_member
   11809                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  226

   11810                      .dwattr $C$DW$1995, DW_AT_name("V")
   11811                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_V")
   11812                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11813                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   11814              $C$DW$1996      .dwtag  DW_TAG_member
   11815                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$73)
   11816                      .dwattr $C$DW$1996, DW_AT_name("dcBus")
   11817                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_dcBus")
   11818                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11819                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   11820              $C$DW$1997      .dwtag  DW_TAG_member
   11821                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$12)
   11822                      .dwattr $C$DW$1997, DW_AT_name("throttle")
   11823                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_throttle")
   11824                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11825                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   11826                      .dwendtag $C$DW$T$82
   11827              
   11828              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11829                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$82)
   11830                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   11831              $C$DW$T$373     .dwtag  DW_TAG_pointer_type
   11832                      .dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$121)
   11833                      .dwattr $C$DW$T$373, DW_AT_address_class(0x20)
   11834              $C$DW$1998      .dwtag  DW_TAG_TI_far_type
   11835                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$373)
   11836              $C$DW$T$374     .dwtag  DW_TAG_const_type
   11837                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$1998)
   11838              
   11839              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   11840                      .dwattr $C$DW$T$91, DW_AT_name("_HAL_MOTOR_Vars_t_")
   11841                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x68)
   11842              $C$DW$1999      .dwtag  DW_TAG_member
   11843                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$44)
   11844                      .dwattr $C$DW$1999, DW_AT_name("Flag_enableSys")
   11845                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_Flag_enableSys")
   11846                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11847                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   11848              $C$DW$2000      .dwtag  DW_TAG_member
   11849                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$44)
   11850                      .dwattr $C$DW$2000, DW_AT_name("Flag_Run_Identify")
   11851                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_Flag_Run_Identify")
   11852                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11853                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   11854              $C$DW$2001      .dwtag  DW_TAG_member
   11855                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$44)
   11856                      .dwattr $C$DW$2001, DW_AT_name("Flag_MotorIdentified")
   11857                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
   11858                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11859                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   11860              $C$DW$2002      .dwtag  DW_TAG_member
   11861                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$44)
   11862                      .dwattr $C$DW$2002, DW_AT_name("Flag_enableForceAngle")
   11863                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
   11864                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  227

   11865                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   11866              $C$DW$2003      .dwtag  DW_TAG_member
   11867                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$44)
   11868                      .dwattr $C$DW$2003, DW_AT_name("Flag_enableFieldWeakening")
   11869                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
   11870                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11871                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   11872              $C$DW$2004      .dwtag  DW_TAG_member
   11873                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$44)
   11874                      .dwattr $C$DW$2004, DW_AT_name("Flag_enableRsRecalc")
   11875                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
   11876                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11877                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   11878              $C$DW$2005      .dwtag  DW_TAG_member
   11879                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$44)
   11880                      .dwattr $C$DW$2005, DW_AT_name("Flag_enableUserParams")
   11881                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_Flag_enableUserParams")
   11882                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11883                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   11884              $C$DW$2006      .dwtag  DW_TAG_member
   11885                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$44)
   11886                      .dwattr $C$DW$2006, DW_AT_name("Flag_enableOffsetcalc")
   11887                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
   11888                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11889                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   11890              $C$DW$2007      .dwtag  DW_TAG_member
   11891                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$44)
   11892                      .dwattr $C$DW$2007, DW_AT_name("Flag_enablePowerWarp")
   11893                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
   11894                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11895                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   11896              $C$DW$2008      .dwtag  DW_TAG_member
   11897                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$44)
   11898                      .dwattr $C$DW$2008, DW_AT_name("Flag_enableSpeedCtrl")
   11899                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
   11900                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11901                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   11902              $C$DW$2009      .dwtag  DW_TAG_member
   11903                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$44)
   11904                      .dwattr $C$DW$2009, DW_AT_name("startup")
   11905                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_startup")
   11906                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11907                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   11908              $C$DW$2010      .dwtag  DW_TAG_member
   11909                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$84)
   11910                      .dwattr $C$DW$2010, DW_AT_name("CtrlState")
   11911                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_CtrlState")
   11912                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11913                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   11914              $C$DW$2011      .dwtag  DW_TAG_member
   11915                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$86)
   11916                      .dwattr $C$DW$2011, DW_AT_name("EstState")
   11917                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_EstState")
   11918                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11919                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  228

   11920              $C$DW$2012      .dwtag  DW_TAG_member
   11921                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$88)
   11922                      .dwattr $C$DW$2012, DW_AT_name("UserErrorCode")
   11923                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_UserErrorCode")
   11924                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11925                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   11926              $C$DW$2013      .dwtag  DW_TAG_member
   11927                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$89)
   11928                      .dwattr $C$DW$2013, DW_AT_name("CtrlVersion")
   11929                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_CtrlVersion")
   11930                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11931                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   11932              $C$DW$2014      .dwtag  DW_TAG_member
   11933                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$73)
   11934                      .dwattr $C$DW$2014, DW_AT_name("IdRef_A")
   11935                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_IdRef_A")
   11936                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11937                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   11938              $C$DW$2015      .dwtag  DW_TAG_member
   11939                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$73)
   11940                      .dwattr $C$DW$2015, DW_AT_name("IqRef_A")
   11941                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_IqRef_A")
   11942                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11943                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   11944              $C$DW$2016      .dwtag  DW_TAG_member
   11945                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$73)
   11946                      .dwattr $C$DW$2016, DW_AT_name("SpeedRef_pu")
   11947                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_SpeedRef_pu")
   11948                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11949                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   11950              $C$DW$2017      .dwtag  DW_TAG_member
   11951                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$73)
   11952                      .dwattr $C$DW$2017, DW_AT_name("SpeedRef_krpm")
   11953                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_SpeedRef_krpm")
   11954                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11955                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   11956              $C$DW$2018      .dwtag  DW_TAG_member
   11957                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$73)
   11958                      .dwattr $C$DW$2018, DW_AT_name("SpeedTraj_krpm")
   11959                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
   11960                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11961                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   11962              $C$DW$2019      .dwtag  DW_TAG_member
   11963                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$73)
   11964                      .dwattr $C$DW$2019, DW_AT_name("MaxAccel_krpmps")
   11965                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
   11966                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11967                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   11968              $C$DW$2020      .dwtag  DW_TAG_member
   11969                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$73)
   11970                      .dwattr $C$DW$2020, DW_AT_name("Speed_krpm")
   11971                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_Speed_krpm")
   11972                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11973                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   11974              $C$DW$2021      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1989210                            PAGE  229

   11975                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$73)
   11976                      .dwattr $C$DW$2021, DW_AT_name("OverModulation")
   11977                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_OverModulation")
   11978                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11979                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   11980              $C$DW$2022      .dwtag  DW_TAG_member
   11981                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$73)
   11982                      .dwattr $C$DW$2022, DW_AT_name("RsOnLineCurrent_A")
   11983                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
   11984                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11985                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   11986              $C$DW$2023      .dwtag  DW_TAG_member
   11987                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$73)
   11988                      .dwattr $C$DW$2023, DW_AT_name("SvgenMaxModulation_ticks")
   11989                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
   11990                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11991                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   11992              $C$DW$2024      .dwtag  DW_TAG_member
   11993                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$73)
   11994                      .dwattr $C$DW$2024, DW_AT_name("Flux_Wb")
   11995                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_Flux_Wb")
   11996                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11997                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   11998              $C$DW$2025      .dwtag  DW_TAG_member
   11999                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$73)
   12000                      .dwattr $C$DW$2025, DW_AT_name("Torque_Nm")
   12001                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_Torque_Nm")
   12002                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   12003                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   12004              $C$DW$2026      .dwtag  DW_TAG_member
   12005                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$90)
   12006                      .dwattr $C$DW$2026, DW_AT_name("MagnCurr_A")
   12007                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_MagnCurr_A")
   12008                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   12009                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   12010              $C$DW$2027      .dwtag  DW_TAG_member
   12011                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$90)
   12012                      .dwattr $C$DW$2027, DW_AT_name("Rr_Ohm")
   12013                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_Rr_Ohm")
   12014                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   12015                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
