TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Sat Nov 26 18:34:01 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    4282              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    4283              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    4284              $C$DW$599       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    4285              $C$DW$600       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    4286              $C$DW$601       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    4287              $C$DW$602       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    4288              $C$DW$603       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    4289              $C$DW$604       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    4290              $C$DW$605       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    4291              $C$DW$606       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    4292              $C$DW$607       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    4293                      .dwendtag $C$DW$T$215
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   86

    4294              
    4295              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    4296                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    4297                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    4298              
    4299              $C$DW$T$218     .dwtag  DW_TAG_enumeration_type
    4300                      .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    4301              $C$DW$608       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    4302              $C$DW$609       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    4303              $C$DW$610       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    4304              $C$DW$611       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    4305              $C$DW$612       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    4306              $C$DW$613       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    4307              $C$DW$614       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    4308              $C$DW$615       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    4309              $C$DW$616       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    4310              $C$DW$617       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    4311              $C$DW$618       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    4312              $C$DW$619       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    4313                      .dwendtag $C$DW$T$218
    4314              
    4315              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    4316                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    4317                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    4318              
    4319              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    4320                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    4321              $C$DW$620       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    4322              $C$DW$621       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    4323              $C$DW$622       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    4324                      .dwendtag $C$DW$T$221
    4325              
    4326              $C$DW$T$222     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    4327                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    4328                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    4329              
    4330              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    4331                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    4332              $C$DW$623       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    4333              $C$DW$624       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    4334                      .dwendtag $C$DW$T$224
    4335              
    4336              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    4337                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    4338                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    4339              
    4340              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4341                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    4342                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    4343              $C$DW$625       .dwtag  DW_TAG_member
    4344                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$25)
    4345                      .dwattr $C$DW$625, DW_AT_name("ADCRESULT")
    4346                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ADCRESULT")
    4347                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4348                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   87

    4349              $C$DW$626       .dwtag  DW_TAG_member
    4350                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$26)
    4351                      .dwattr $C$DW$626, DW_AT_name("resvd_1")
    4352                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_resvd_1")
    4353                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4354                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4355              $C$DW$627       .dwtag  DW_TAG_member
    4356                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$24)
    4357                      .dwattr $C$DW$627, DW_AT_name("ADCCTL1")
    4358                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ADCCTL1")
    4359                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4360                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4361              $C$DW$628       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$24)
    4363                      .dwattr $C$DW$628, DW_AT_name("ADCCTL2")
    4364                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCCTL2")
    4365                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4366                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4367              $C$DW$629       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$27)
    4369                      .dwattr $C$DW$629, DW_AT_name("rsvd_2")
    4370                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_rsvd_2")
    4371                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4372                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4373              $C$DW$630       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$24)
    4375                      .dwattr $C$DW$630, DW_AT_name("ADCINTFLG")
    4376                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_ADCINTFLG")
    4377                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4378                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4379              $C$DW$631       .dwtag  DW_TAG_member
    4380                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$24)
    4381                      .dwattr $C$DW$631, DW_AT_name("ADCINTFLGCLR")
    4382                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4383                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4384                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4385              $C$DW$632       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$24)
    4387                      .dwattr $C$DW$632, DW_AT_name("ADCINTOVF")
    4388                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_ADCINTOVF")
    4389                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4390                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4391              $C$DW$633       .dwtag  DW_TAG_member
    4392                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$24)
    4393                      .dwattr $C$DW$633, DW_AT_name("ADCINTOVFCLR")
    4394                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4395                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4396                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4397              $C$DW$634       .dwtag  DW_TAG_member
    4398                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$28)
    4399                      .dwattr $C$DW$634, DW_AT_name("INTSELxNy")
    4400                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_INTSELxNy")
    4401                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4402                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4403              $C$DW$635       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   88

    4404                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$29)
    4405                      .dwattr $C$DW$635, DW_AT_name("rsvd_3")
    4406                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_3")
    4407                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4408                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4409              $C$DW$636       .dwtag  DW_TAG_member
    4410                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$24)
    4411                      .dwattr $C$DW$636, DW_AT_name("SOCPRICTRL")
    4412                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4413                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4414                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4415              $C$DW$637       .dwtag  DW_TAG_member
    4416                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$24)
    4417                      .dwattr $C$DW$637, DW_AT_name("rsvd_4")
    4418                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_rsvd_4")
    4419                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4420                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4421              $C$DW$638       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$24)
    4423                      .dwattr $C$DW$638, DW_AT_name("ADCSAMPLEMODE")
    4424                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4425                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4426                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4427              $C$DW$639       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$24)
    4429                      .dwattr $C$DW$639, DW_AT_name("rsvd_5")
    4430                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_rsvd_5")
    4431                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4432                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4433              $C$DW$640       .dwtag  DW_TAG_member
    4434                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$24)
    4435                      .dwattr $C$DW$640, DW_AT_name("ADCINTSOCSEL1")
    4436                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4437                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4438                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4439              $C$DW$641       .dwtag  DW_TAG_member
    4440                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$24)
    4441                      .dwattr $C$DW$641, DW_AT_name("ADCINTSOCSEL2")
    4442                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4443                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4444                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$642       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$27)
    4447                      .dwattr $C$DW$642, DW_AT_name("rsvd_6")
    4448                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_rsvd_6")
    4449                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4450                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4451              $C$DW$643       .dwtag  DW_TAG_member
    4452                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$24)
    4453                      .dwattr $C$DW$643, DW_AT_name("ADCSOCFLG1")
    4454                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4455                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4456                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4457              $C$DW$644       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   89

    4459                      .dwattr $C$DW$644, DW_AT_name("rsvd_7")
    4460                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_rsvd_7")
    4461                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4462                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4463              $C$DW$645       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$24)
    4465                      .dwattr $C$DW$645, DW_AT_name("ADCSOCFRC1")
    4466                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4467                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4468                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4469              $C$DW$646       .dwtag  DW_TAG_member
    4470                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$24)
    4471                      .dwattr $C$DW$646, DW_AT_name("rsvd_8")
    4472                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_rsvd_8")
    4473                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4474                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4475              $C$DW$647       .dwtag  DW_TAG_member
    4476                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$24)
    4477                      .dwattr $C$DW$647, DW_AT_name("ADCSOCOVF1")
    4478                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4479                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4480                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4481              $C$DW$648       .dwtag  DW_TAG_member
    4482                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$24)
    4483                      .dwattr $C$DW$648, DW_AT_name("rsvd_9")
    4484                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_rsvd_9")
    4485                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4486                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4487              $C$DW$649       .dwtag  DW_TAG_member
    4488                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$24)
    4489                      .dwattr $C$DW$649, DW_AT_name("ADCSOCOVFCLR1")
    4490                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4491                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4492                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4493              $C$DW$650       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$24)
    4495                      .dwattr $C$DW$650, DW_AT_name("rsvd_10")
    4496                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_rsvd_10")
    4497                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4498                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4499              $C$DW$651       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$25)
    4501                      .dwattr $C$DW$651, DW_AT_name("ADCSOCxCTL")
    4502                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4503                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4504                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4505              $C$DW$652       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$25)
    4507                      .dwattr $C$DW$652, DW_AT_name("rsvd_11")
    4508                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_rsvd_11")
    4509                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4510                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4511              $C$DW$653       .dwtag  DW_TAG_member
    4512                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$24)
    4513                      .dwattr $C$DW$653, DW_AT_name("ADCREFTRIM")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   90

    4514                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4515                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4516                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4517              $C$DW$654       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    4519                      .dwattr $C$DW$654, DW_AT_name("ADCOFFTRIM")
    4520                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4521                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4522                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$655       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$30)
    4525                      .dwattr $C$DW$655, DW_AT_name("resvd_12")
    4526                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_resvd_12")
    4527                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4528                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4529              $C$DW$656       .dwtag  DW_TAG_member
    4530                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$24)
    4531                      .dwattr $C$DW$656, DW_AT_name("ADCREV")
    4532                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ADCREV")
    4533                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4534                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4535                      .dwendtag $C$DW$T$31
    4536              
    4537              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4538                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$31)
    4539                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4540              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    4541                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$31)
    4542                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    4543              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4544                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    4545                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    4546              
    4547              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4548                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    4549                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    4550              $C$DW$657       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$32)
    4552                      .dwattr $C$DW$657, DW_AT_name("alpha_sf")
    4553                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_alpha_sf")
    4554                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4555                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$658       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$32)
    4558                      .dwattr $C$DW$658, DW_AT_name("beta_sf")
    4559                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_beta_sf")
    4560                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4561                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$659       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$33)
    4564                      .dwattr $C$DW$659, DW_AT_name("numSensors")
    4565                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_numSensors")
    4566                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4567                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4568                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   91

    4569              
    4570              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4571                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    4572                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4573              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4574                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    4575                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4576              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4577                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4578                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4579              
    4580              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4581                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    4582                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    4583              $C$DW$660       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$24)
    4585                      .dwattr $C$DW$660, DW_AT_name("XCLK")
    4586                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_XCLK")
    4587                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4588                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4589              $C$DW$661       .dwtag  DW_TAG_member
    4590                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$24)
    4591                      .dwattr $C$DW$661, DW_AT_name("rsvd_1")
    4592                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_rsvd_1")
    4593                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4594                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4595              $C$DW$662       .dwtag  DW_TAG_member
    4596                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$24)
    4597                      .dwattr $C$DW$662, DW_AT_name("CLKCTL")
    4598                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_CLKCTL")
    4599                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4600                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$663       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$35)
    4603                      .dwattr $C$DW$663, DW_AT_name("rsvd_2")
    4604                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_rsvd_2")
    4605                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4606                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4607              $C$DW$664       .dwtag  DW_TAG_member
    4608                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$24)
    4609                      .dwattr $C$DW$664, DW_AT_name("LOSPCP")
    4610                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_LOSPCP")
    4611                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4612                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4613              $C$DW$665       .dwtag  DW_TAG_member
    4614                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$24)
    4615                      .dwattr $C$DW$665, DW_AT_name("PCLKCR0")
    4616                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_PCLKCR0")
    4617                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4618                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$666       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$24)
    4621                      .dwattr $C$DW$666, DW_AT_name("PCLKCR1")
    4622                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_PCLKCR1")
    4623                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   92

    4624                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4625              $C$DW$667       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$27)
    4627                      .dwattr $C$DW$667, DW_AT_name("rsvd_3")
    4628                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_rsvd_3")
    4629                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4630                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4631              $C$DW$668       .dwtag  DW_TAG_member
    4632                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$24)
    4633                      .dwattr $C$DW$668, DW_AT_name("PCLKCR3")
    4634                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_PCLKCR3")
    4635                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4636                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4637                      .dwendtag $C$DW$T$36
    4638              
    4639              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    4640                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$36)
    4641                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    4642              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4643                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4644                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4645              
    4646              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4647                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4648                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4649              $C$DW$669       .dwtag  DW_TAG_member
    4650                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$33)
    4651                      .dwattr $C$DW$669, DW_AT_name("tmp")
    4652                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_tmp")
    4653                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4654                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4655                      .dwendtag $C$DW$T$37
    4656              
    4657              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4658                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$37)
    4659                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4660              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4661                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    4662                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4663              
    4664              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    4665                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    4666                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    4667              $C$DW$670       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$38)
    4669                      .dwattr $C$DW$670, DW_AT_name("version")
    4670                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_version")
    4671                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4672                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4673              $C$DW$671       .dwtag  DW_TAG_member
    4674                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$40)
    4675                      .dwattr $C$DW$671, DW_AT_name("state")
    4676                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_state")
    4677                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4678                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   93

    4679              $C$DW$672       .dwtag  DW_TAG_member
    4680                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$40)
    4681                      .dwattr $C$DW$672, DW_AT_name("prevState")
    4682                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_prevState")
    4683                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4684                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4685              $C$DW$673       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$42)
    4687                      .dwattr $C$DW$673, DW_AT_name("errorCode")
    4688                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_errorCode")
    4689                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4690                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4691              $C$DW$674       .dwtag  DW_TAG_member
    4692                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$44)
    4693                      .dwattr $C$DW$674, DW_AT_name("clarkeHandle_I")
    4694                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4695                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4696                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4697              $C$DW$675       .dwtag  DW_TAG_member
    4698                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$45)
    4699                      .dwattr $C$DW$675, DW_AT_name("clarke_I")
    4700                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_clarke_I")
    4701                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4702                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4703              $C$DW$676       .dwtag  DW_TAG_member
    4704                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$44)
    4705                      .dwattr $C$DW$676, DW_AT_name("clarkeHandle_V")
    4706                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4707                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4708                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4709              $C$DW$677       .dwtag  DW_TAG_member
    4710                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$45)
    4711                      .dwattr $C$DW$677, DW_AT_name("clarke_V")
    4712                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_clarke_V")
    4713                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4714                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4715              $C$DW$678       .dwtag  DW_TAG_member
    4716                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$47)
    4717                      .dwattr $C$DW$678, DW_AT_name("estHandle")
    4718                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_estHandle")
    4719                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4720                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4721              $C$DW$679       .dwtag  DW_TAG_member
    4722                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$49)
    4723                      .dwattr $C$DW$679, DW_AT_name("parkHandle")
    4724                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_parkHandle")
    4725                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4726                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4727              $C$DW$680       .dwtag  DW_TAG_member
    4728                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$50)
    4729                      .dwattr $C$DW$680, DW_AT_name("park")
    4730                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_park")
    4731                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4732                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$681       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   94

    4734                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$52)
    4735                      .dwattr $C$DW$681, DW_AT_name("pidHandle_Id")
    4736                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_pidHandle_Id")
    4737                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4738                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4739              $C$DW$682       .dwtag  DW_TAG_member
    4740                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$53)
    4741                      .dwattr $C$DW$682, DW_AT_name("pid_Id")
    4742                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_pid_Id")
    4743                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4744                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4745              $C$DW$683       .dwtag  DW_TAG_member
    4746                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$52)
    4747                      .dwattr $C$DW$683, DW_AT_name("pidHandle_Iq")
    4748                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4749                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4750                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$684       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$53)
    4753                      .dwattr $C$DW$684, DW_AT_name("pid_Iq")
    4754                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_pid_Iq")
    4755                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4756                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4757              $C$DW$685       .dwtag  DW_TAG_member
    4758                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$52)
    4759                      .dwattr $C$DW$685, DW_AT_name("pidHandle_spd")
    4760                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_pidHandle_spd")
    4761                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4762                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4763              $C$DW$686       .dwtag  DW_TAG_member
    4764                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$53)
    4765                      .dwattr $C$DW$686, DW_AT_name("pid_spd")
    4766                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_pid_spd")
    4767                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4768                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4769              $C$DW$687       .dwtag  DW_TAG_member
    4770                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$55)
    4771                      .dwattr $C$DW$687, DW_AT_name("iparkHandle")
    4772                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_iparkHandle")
    4773                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4774                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4775              $C$DW$688       .dwtag  DW_TAG_member
    4776                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$56)
    4777                      .dwattr $C$DW$688, DW_AT_name("ipark")
    4778                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_ipark")
    4779                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4780                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4781              $C$DW$689       .dwtag  DW_TAG_member
    4782                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$58)
    4783                      .dwattr $C$DW$689, DW_AT_name("svgenHandle")
    4784                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_svgenHandle")
    4785                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4786                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4787              $C$DW$690       .dwtag  DW_TAG_member
    4788                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$59)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   95

    4789                      .dwattr $C$DW$690, DW_AT_name("svgen")
    4790                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_svgen")
    4791                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4792                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4793              $C$DW$691       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$61)
    4795                      .dwattr $C$DW$691, DW_AT_name("trajHandle_Id")
    4796                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_trajHandle_Id")
    4797                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4798                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4799              $C$DW$692       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$62)
    4801                      .dwattr $C$DW$692, DW_AT_name("traj_Id")
    4802                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_traj_Id")
    4803                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4804                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4805              $C$DW$693       .dwtag  DW_TAG_member
    4806                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$61)
    4807                      .dwattr $C$DW$693, DW_AT_name("trajHandle_spd")
    4808                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_trajHandle_spd")
    4809                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4810                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4811              $C$DW$694       .dwtag  DW_TAG_member
    4812                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$62)
    4813                      .dwattr $C$DW$694, DW_AT_name("traj_spd")
    4814                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_traj_spd")
    4815                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4816                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$695       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$61)
    4819                      .dwattr $C$DW$695, DW_AT_name("trajHandle_spdMax")
    4820                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4821                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4822                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4823              $C$DW$696       .dwtag  DW_TAG_member
    4824                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$62)
    4825                      .dwattr $C$DW$696, DW_AT_name("traj_spdMax")
    4826                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_traj_spdMax")
    4827                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4828                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4829              $C$DW$697       .dwtag  DW_TAG_member
    4830                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$63)
    4831                      .dwattr $C$DW$697, DW_AT_name("motorParams")
    4832                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_motorParams")
    4833                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4834                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4835              $C$DW$698       .dwtag  DW_TAG_member
    4836                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$66)
    4837                      .dwattr $C$DW$698, DW_AT_name("waitTimes")
    4838                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_waitTimes")
    4839                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4840                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4841              $C$DW$699       .dwtag  DW_TAG_member
    4842                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$65)
    4843                      .dwattr $C$DW$699, DW_AT_name("counter_state")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   96

    4844                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_counter_state")
    4845                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4846                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4847              $C$DW$700       .dwtag  DW_TAG_member
    4848                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$67)
    4849                      .dwattr $C$DW$700, DW_AT_name("numIsrTicksPerCtrlTick")
    4850                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4851                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4852                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4853              $C$DW$701       .dwtag  DW_TAG_member
    4854                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$67)
    4855                      .dwattr $C$DW$701, DW_AT_name("numCtrlTicksPerCurrentTick")
    4856                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4857                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4858                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$702       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$67)
    4861                      .dwattr $C$DW$702, DW_AT_name("numCtrlTicksPerSpeedTick")
    4862                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4863                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4864                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4865              $C$DW$703       .dwtag  DW_TAG_member
    4866                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$67)
    4867                      .dwattr $C$DW$703, DW_AT_name("numCtrlTicksPerTrajTick")
    4868                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4869                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4870                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4871              $C$DW$704       .dwtag  DW_TAG_member
    4872                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$65)
    4873                      .dwattr $C$DW$704, DW_AT_name("ctrlFreq_Hz")
    4874                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4875                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4876                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4877              $C$DW$705       .dwtag  DW_TAG_member
    4878                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$65)
    4879                      .dwattr $C$DW$705, DW_AT_name("trajFreq_Hz")
    4880                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4881                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4882                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4883              $C$DW$706       .dwtag  DW_TAG_member
    4884                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$32)
    4885                      .dwattr $C$DW$706, DW_AT_name("trajPeriod_sec")
    4886                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4887                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4888                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4889              $C$DW$707       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$68)
    4891                      .dwattr $C$DW$707, DW_AT_name("ctrlPeriod_sec")
    4892                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4893                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4894                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4895              $C$DW$708       .dwtag  DW_TAG_member
    4896                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$32)
    4897                      .dwattr $C$DW$708, DW_AT_name("maxVsMag_pu")
    4898                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_maxVsMag_pu")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   97

    4899                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4900                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4901              $C$DW$709       .dwtag  DW_TAG_member
    4902                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$69)
    4903                      .dwattr $C$DW$709, DW_AT_name("Iab_in")
    4904                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Iab_in")
    4905                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4906                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4907              $C$DW$710       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$69)
    4909                      .dwattr $C$DW$710, DW_AT_name("Iab_filt")
    4910                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Iab_filt")
    4911                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4912                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4913              $C$DW$711       .dwtag  DW_TAG_member
    4914                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$69)
    4915                      .dwattr $C$DW$711, DW_AT_name("Idq_in")
    4916                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Idq_in")
    4917                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4918                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4919              $C$DW$712       .dwtag  DW_TAG_member
    4920                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$69)
    4921                      .dwattr $C$DW$712, DW_AT_name("Vab_in")
    4922                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Vab_in")
    4923                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4924                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4925              $C$DW$713       .dwtag  DW_TAG_member
    4926                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    4927                      .dwattr $C$DW$713, DW_AT_name("spd_out")
    4928                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_spd_out")
    4929                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4930                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4931              $C$DW$714       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$69)
    4933                      .dwattr $C$DW$714, DW_AT_name("Vab_out")
    4934                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Vab_out")
    4935                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4936                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4937              $C$DW$715       .dwtag  DW_TAG_member
    4938                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$69)
    4939                      .dwattr $C$DW$715, DW_AT_name("Vdq_out")
    4940                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Vdq_out")
    4941                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4942                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4943              $C$DW$716       .dwtag  DW_TAG_member
    4944                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$68)
    4945                      .dwattr $C$DW$716, DW_AT_name("Rhf")
    4946                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Rhf")
    4947                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4948                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4949              $C$DW$717       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$68)
    4951                      .dwattr $C$DW$717, DW_AT_name("Lhf")
    4952                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Lhf")
    4953                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   98

    4954                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4955              $C$DW$718       .dwtag  DW_TAG_member
    4956                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$68)
    4957                      .dwattr $C$DW$718, DW_AT_name("RoverL")
    4958                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_RoverL")
    4959                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4960                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4961              $C$DW$719       .dwtag  DW_TAG_member
    4962                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    4963                      .dwattr $C$DW$719, DW_AT_name("Kp_Id")
    4964                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_Kp_Id")
    4965                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4966                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4967              $C$DW$720       .dwtag  DW_TAG_member
    4968                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$32)
    4969                      .dwattr $C$DW$720, DW_AT_name("Kp_Iq")
    4970                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_Kp_Iq")
    4971                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4972                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4973              $C$DW$721       .dwtag  DW_TAG_member
    4974                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$32)
    4975                      .dwattr $C$DW$721, DW_AT_name("Kp_spd")
    4976                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_Kp_spd")
    4977                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4978                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4979              $C$DW$722       .dwtag  DW_TAG_member
    4980                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$32)
    4981                      .dwattr $C$DW$722, DW_AT_name("Ki_Id")
    4982                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_Ki_Id")
    4983                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4984                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4985              $C$DW$723       .dwtag  DW_TAG_member
    4986                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$32)
    4987                      .dwattr $C$DW$723, DW_AT_name("Ki_Iq")
    4988                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Ki_Iq")
    4989                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4990                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4991              $C$DW$724       .dwtag  DW_TAG_member
    4992                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$32)
    4993                      .dwattr $C$DW$724, DW_AT_name("Ki_spd")
    4994                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Ki_spd")
    4995                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4996                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$725       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$32)
    4999                      .dwattr $C$DW$725, DW_AT_name("Kd_Id")
    5000                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_Kd_Id")
    5001                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    5002                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    5003              $C$DW$726       .dwtag  DW_TAG_member
    5004                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$32)
    5005                      .dwattr $C$DW$726, DW_AT_name("Kd_Iq")
    5006                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_Kd_Iq")
    5007                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    5008                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE   99

    5009              $C$DW$727       .dwtag  DW_TAG_member
    5010                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$32)
    5011                      .dwattr $C$DW$727, DW_AT_name("Kd_spd")
    5012                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_Kd_spd")
    5013                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    5014                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$728       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$32)
    5017                      .dwattr $C$DW$728, DW_AT_name("Ui_Id")
    5018                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_Ui_Id")
    5019                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5020                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    5021              $C$DW$729       .dwtag  DW_TAG_member
    5022                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$32)
    5023                      .dwattr $C$DW$729, DW_AT_name("Ui_Iq")
    5024                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_Ui_Iq")
    5025                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    5026                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    5027              $C$DW$730       .dwtag  DW_TAG_member
    5028                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$32)
    5029                      .dwattr $C$DW$730, DW_AT_name("Ui_spd")
    5030                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Ui_spd")
    5031                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    5032                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    5033              $C$DW$731       .dwtag  DW_TAG_member
    5034                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$69)
    5035                      .dwattr $C$DW$731, DW_AT_name("Idq_ref")
    5036                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Idq_ref")
    5037                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    5038                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    5039              $C$DW$732       .dwtag  DW_TAG_member
    5040                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$32)
    5041                      .dwattr $C$DW$732, DW_AT_name("IdRated")
    5042                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_IdRated")
    5043                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    5044                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    5045              $C$DW$733       .dwtag  DW_TAG_member
    5046                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$32)
    5047                      .dwattr $C$DW$733, DW_AT_name("spd_ref")
    5048                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_spd_ref")
    5049                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    5050                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    5051              $C$DW$734       .dwtag  DW_TAG_member
    5052                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$32)
    5053                      .dwattr $C$DW$734, DW_AT_name("spd_max")
    5054                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_spd_max")
    5055                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    5056                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$735       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$67)
    5059                      .dwattr $C$DW$735, DW_AT_name("counter_current")
    5060                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_counter_current")
    5061                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    5062                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    5063              $C$DW$736       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  100

    5064                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$67)
    5065                      .dwattr $C$DW$736, DW_AT_name("counter_isr")
    5066                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_counter_isr")
    5067                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    5068                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    5069              $C$DW$737       .dwtag  DW_TAG_member
    5070                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$67)
    5071                      .dwattr $C$DW$737, DW_AT_name("counter_speed")
    5072                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_counter_speed")
    5073                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    5074                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    5075              $C$DW$738       .dwtag  DW_TAG_member
    5076                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$67)
    5077                      .dwattr $C$DW$738, DW_AT_name("counter_traj")
    5078                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_counter_traj")
    5079                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    5080                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$739       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$70)
    5083                      .dwattr $C$DW$739, DW_AT_name("flag_enableCtrl")
    5084                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_flag_enableCtrl")
    5085                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    5086                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    5087              $C$DW$740       .dwtag  DW_TAG_member
    5088                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$70)
    5089                      .dwattr $C$DW$740, DW_AT_name("flag_enableDcBusComp")
    5090                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    5091                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    5092                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    5093              $C$DW$741       .dwtag  DW_TAG_member
    5094                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$70)
    5095                      .dwattr $C$DW$741, DW_AT_name("flag_enablePowerWarp")
    5096                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    5097                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    5098                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    5099              $C$DW$742       .dwtag  DW_TAG_member
    5100                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$70)
    5101                      .dwattr $C$DW$742, DW_AT_name("flag_enableOffset")
    5102                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_flag_enableOffset")
    5103                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    5104                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    5105              $C$DW$743       .dwtag  DW_TAG_member
    5106                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$70)
    5107                      .dwattr $C$DW$743, DW_AT_name("flag_enableSpeedCtrl")
    5108                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    5109                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    5110                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    5111              $C$DW$744       .dwtag  DW_TAG_member
    5112                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$70)
    5113                      .dwattr $C$DW$744, DW_AT_name("flag_enableUserMotorParams")
    5114                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    5115                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    5116                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    5117              $C$DW$745       .dwtag  DW_TAG_member
    5118                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  101

    5119                      .dwattr $C$DW$745, DW_AT_name("Idq_offset_pu")
    5120                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_Idq_offset_pu")
    5121                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    5122                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    5123              $C$DW$746       .dwtag  DW_TAG_member
    5124                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$69)
    5125                      .dwattr $C$DW$746, DW_AT_name("Vdq_offset_pu")
    5126                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    5127                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    5128                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    5129              $C$DW$747       .dwtag  DW_TAG_member
    5130                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$32)
    5131                      .dwattr $C$DW$747, DW_AT_name("angle_pu")
    5132                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_angle_pu")
    5133                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    5134                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5135              $C$DW$748       .dwtag  DW_TAG_member
    5136                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$32)
    5137                      .dwattr $C$DW$748, DW_AT_name("speed_ref_pu")
    5138                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_speed_ref_pu")
    5139                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    5140                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5141              $C$DW$749       .dwtag  DW_TAG_member
    5142                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$32)
    5143                      .dwattr $C$DW$749, DW_AT_name("speed_fb_pu")
    5144                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_speed_fb_pu")
    5145                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    5146                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5147              $C$DW$750       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$32)
    5149                      .dwattr $C$DW$750, DW_AT_name("speed_outMax_pu")
    5150                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_speed_outMax_pu")
    5151                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5152                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5153              $C$DW$751       .dwtag  DW_TAG_member
    5154                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$70)
    5155                      .dwattr $C$DW$751, DW_AT_name("flag_enableCurrentCtrl")
    5156                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    5157                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    5158                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    5159                      .dwendtag $C$DW$T$71
    5160              
    5161              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    5162                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$71)
    5163                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    5164              $C$DW$T$229     .dwtag  DW_TAG_pointer_type
    5165                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    5166                      .dwattr $C$DW$T$229, DW_AT_address_class(0x20)
    5167              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    5168                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$71)
    5169                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    5170              $C$DW$T$200     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    5171                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    5172                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    5173              $C$DW$752       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  102

    5174                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$200)
    5175              $C$DW$T$230     .dwtag  DW_TAG_const_type
    5176                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$752)
    5177              
    5178              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5179                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    5180                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    5181              $C$DW$753       .dwtag  DW_TAG_member
    5182                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$23)
    5183                      .dwattr $C$DW$753, DW_AT_name("rsvd")
    5184                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_rsvd")
    5185                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5186                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5187              $C$DW$754       .dwtag  DW_TAG_member
    5188                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$73)
    5189                      .dwattr $C$DW$754, DW_AT_name("targetProc")
    5190                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_targetProc")
    5191                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5192                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5193              $C$DW$755       .dwtag  DW_TAG_member
    5194                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$23)
    5195                      .dwattr $C$DW$755, DW_AT_name("major")
    5196                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_major")
    5197                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5198                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5199              $C$DW$756       .dwtag  DW_TAG_member
    5200                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$23)
    5201                      .dwattr $C$DW$756, DW_AT_name("minor")
    5202                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_minor")
    5203                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5204                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5205                      .dwendtag $C$DW$T$74
    5206              
    5207              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    5208                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    5209                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    5210              $C$DW$T$238     .dwtag  DW_TAG_pointer_type
    5211                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$38)
    5212                      .dwattr $C$DW$T$238, DW_AT_address_class(0x20)
    5213              
    5214              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    5215                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8301_Obj_")
    5216                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    5217              $C$DW$757       .dwtag  DW_TAG_member
    5218                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$76)
    5219                      .dwattr $C$DW$757, DW_AT_name("spiHandle")
    5220                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_spiHandle")
    5221                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5222                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5223              $C$DW$758       .dwtag  DW_TAG_member
    5224                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$78)
    5225                      .dwattr $C$DW$758, DW_AT_name("gpioHandle")
    5226                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_gpioHandle")
    5227                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5228                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  103

    5229              $C$DW$759       .dwtag  DW_TAG_member
    5230                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$80)
    5231                      .dwattr $C$DW$759, DW_AT_name("gpioNumber")
    5232                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_gpioNumber")
    5233                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5234                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5235              $C$DW$760       .dwtag  DW_TAG_member
    5236                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$70)
    5237                      .dwattr $C$DW$760, DW_AT_name("RxTimeOut")
    5238                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RxTimeOut")
    5239                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5240                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5241              $C$DW$761       .dwtag  DW_TAG_member
    5242                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$70)
    5243                      .dwattr $C$DW$761, DW_AT_name("enableTimeOut")
    5244                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_enableTimeOut")
    5245                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5246                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5247                      .dwendtag $C$DW$T$81
    5248              
    5249              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    5250                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$81)
    5251                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    5252              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    5253                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$81)
    5254                      .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    5255              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    5256                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    5257                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    5258              
    5259              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    5260                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    5261                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x05)
    5262              $C$DW$762       .dwtag  DW_TAG_member
    5263                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$83)
    5264                      .dwattr $C$DW$762, DW_AT_name("DRV8301_CURRENT")
    5265                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5266                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5267                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5268              $C$DW$763       .dwtag  DW_TAG_member
    5269                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$85)
    5270                      .dwattr $C$DW$763, DW_AT_name("DRV8301_RESET")
    5271                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5272                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5273                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5274              $C$DW$764       .dwtag  DW_TAG_member
    5275                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$87)
    5276                      .dwattr $C$DW$764, DW_AT_name("PWM_MODE")
    5277                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_PWM_MODE")
    5278                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5279                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5280              $C$DW$765       .dwtag  DW_TAG_member
    5281                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$89)
    5282                      .dwattr $C$DW$765, DW_AT_name("OC_MODE")
    5283                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_OC_MODE")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  104

    5284                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5285                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5286              $C$DW$766       .dwtag  DW_TAG_member
    5287                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$91)
    5288                      .dwattr $C$DW$766, DW_AT_name("OC_ADJ_SET")
    5289                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5290                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5291                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    5292                      .dwendtag $C$DW$T$92
    5293              
    5294              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5295                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$92)
    5296                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    5297              
    5298              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    5299                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5300                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x04)
    5301              $C$DW$767       .dwtag  DW_TAG_member
    5302                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$94)
    5303                      .dwattr $C$DW$767, DW_AT_name("OCTW_SET")
    5304                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_OCTW_SET")
    5305                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5306                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    5307              $C$DW$768       .dwtag  DW_TAG_member
    5308                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$96)
    5309                      .dwattr $C$DW$768, DW_AT_name("GAIN")
    5310                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_GAIN")
    5311                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5312                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    5313              $C$DW$769       .dwtag  DW_TAG_member
    5314                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$98)
    5315                      .dwattr $C$DW$769, DW_AT_name("DC_CAL_CH1p2")
    5316                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5317                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5318                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    5319              $C$DW$770       .dwtag  DW_TAG_member
    5320                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$100)
    5321                      .dwattr $C$DW$770, DW_AT_name("OC_TOFF")
    5322                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_OC_TOFF")
    5323                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5324                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    5325                      .dwendtag $C$DW$T$101
    5326              
    5327              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5328                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$101)
    5329                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    5330              
    5331              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5332                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5333                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x0b)
    5334              $C$DW$771       .dwtag  DW_TAG_member
    5335                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$70)
    5336                      .dwattr $C$DW$771, DW_AT_name("FAULT")
    5337                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_FAULT")
    5338                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  105

    5339                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    5340              $C$DW$772       .dwtag  DW_TAG_member
    5341                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$70)
    5342                      .dwattr $C$DW$772, DW_AT_name("GVDD_UV")
    5343                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_GVDD_UV")
    5344                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5345                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    5346              $C$DW$773       .dwtag  DW_TAG_member
    5347                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$70)
    5348                      .dwattr $C$DW$773, DW_AT_name("PVDD_UV")
    5349                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_PVDD_UV")
    5350                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5351                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    5352              $C$DW$774       .dwtag  DW_TAG_member
    5353                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$70)
    5354                      .dwattr $C$DW$774, DW_AT_name("OTSD")
    5355                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_OTSD")
    5356                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5357                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    5358              $C$DW$775       .dwtag  DW_TAG_member
    5359                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$70)
    5360                      .dwattr $C$DW$775, DW_AT_name("OTW")
    5361                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_OTW")
    5362                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5363                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    5364              $C$DW$776       .dwtag  DW_TAG_member
    5365                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$70)
    5366                      .dwattr $C$DW$776, DW_AT_name("FETHA_OC")
    5367                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_FETHA_OC")
    5368                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5369                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    5370              $C$DW$777       .dwtag  DW_TAG_member
    5371                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$70)
    5372                      .dwattr $C$DW$777, DW_AT_name("FETLA_OC")
    5373                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_FETLA_OC")
    5374                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5375                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    5376              $C$DW$778       .dwtag  DW_TAG_member
    5377                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
    5378                      .dwattr $C$DW$778, DW_AT_name("FETHB_OC")
    5379                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_FETHB_OC")
    5380                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5381                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    5382              $C$DW$779       .dwtag  DW_TAG_member
    5383                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$70)
    5384                      .dwattr $C$DW$779, DW_AT_name("FETLB_OC")
    5385                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_FETLB_OC")
    5386                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5387                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    5388              $C$DW$780       .dwtag  DW_TAG_member
    5389                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$70)
    5390                      .dwattr $C$DW$780, DW_AT_name("FETHC_OC")
    5391                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_FETHC_OC")
    5392                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5393                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  106

    5394              $C$DW$781       .dwtag  DW_TAG_member
    5395                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$70)
    5396                      .dwattr $C$DW$781, DW_AT_name("FETLC_OC")
    5397                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_FETLC_OC")
    5398                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5399                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    5400                      .dwendtag $C$DW$T$102
    5401              
    5402              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    5403                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$102)
    5404                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    5405              
    5406              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5407                      .dwattr $C$DW$T$103, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    5408                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    5409              $C$DW$782       .dwtag  DW_TAG_member
    5410                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$70)
    5411                      .dwattr $C$DW$782, DW_AT_name("GVDD_OV")
    5412                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_GVDD_OV")
    5413                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5414                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    5415              $C$DW$783       .dwtag  DW_TAG_member
    5416                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$23)
    5417                      .dwattr $C$DW$783, DW_AT_name("DeviceID")
    5418                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_DeviceID")
    5419                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5420                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    5421                      .dwendtag $C$DW$T$103
    5422              
    5423              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    5424                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$103)
    5425                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    5426              
    5427              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5428                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    5429                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x18)
    5430              $C$DW$784       .dwtag  DW_TAG_member
    5431                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$104)
    5432                      .dwattr $C$DW$784, DW_AT_name("Stat_Reg_1")
    5433                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Stat_Reg_1")
    5434                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5435                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    5436              $C$DW$785       .dwtag  DW_TAG_member
    5437                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$105)
    5438                      .dwattr $C$DW$785, DW_AT_name("Stat_Reg_2")
    5439                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_Stat_Reg_2")
    5440                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    5441                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    5442              $C$DW$786       .dwtag  DW_TAG_member
    5443                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$106)
    5444                      .dwattr $C$DW$786, DW_AT_name("Ctrl_Reg_1")
    5445                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    5446                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5447                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    5448              $C$DW$787       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:34:01 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\4020010                            PAGE  107

    5449                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$107)
    5450                      .dwattr $C$DW$787, DW_AT_name("Ctrl_Reg_2")
    5451                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    5452                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5453                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    5454              $C$DW$788       .dwtag  DW_TAG_member
    5455                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$70)
    5456                      .dwattr $C$DW$788, DW_AT_name("SndCmd")
    5457                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_SndCmd")
    5458                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5459                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    5460              $C$DW$789       .dwtag  DW_TAG_member
    5461                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$70)
    5462                      .dwattr $C$DW$789, DW_AT_name("RcvCmd")
    5463                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_RcvCmd")
    5464                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5465                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    5466                      .dwendtag $C$DW$T$108
    5467              
    5468              $C$DW$T$241     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    5469                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$108)
    5470                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    5471              $C$DW$T$242     .dwtag  DW_TAG_pointer_type
    5472                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$241)
    5473                      .dwattr $C$DW$T$242, DW_AT_address_class(0x20)
    5474              
    5475              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    5476                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    5477                      .dwattr $C$DW$T$19, DW_AT_declaration
    5478                      .dwendtag $C$DW$T$19
    5479              
    5480              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    5481                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$19)
    5482                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    5483              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
