TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Fri Jan 20 18:10:50 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/Users/bee25/Documents/Visual Studio 2015/Projects/telescopeControlle
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\bee25\Documents\Visual Studio 2015\Projects\telescopeContr
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CTRL_setGains")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CTRL_setGains")

    3003              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    3004              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    3005              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    3006              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    3007              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    3008              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    3009              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    3010              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    3011              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    3012              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    3013              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    3014              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    3015              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    3016              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    3017              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    3018              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    3019              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    3020              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    3021              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    3022              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    3023              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   61

    3024              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    3025              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    3026              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    3027              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    3028              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    3029              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    3030                      .dwendtag $C$DW$T$74
    3031              
    3032              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    3033                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3034                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3035              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    3036                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$75)
    3037              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3038                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$366)
    3039              
    3040              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3041                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3042              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3043              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3044              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3045                      .dwendtag $C$DW$T$82
    3046              
    3047              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3048                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3049                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3050              $C$DW$370       .dwtag  DW_TAG_TI_far_type
    3051                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$83)
    3052              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3053                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$370)
    3054              
    3055              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3056                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3057                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3058              $C$DW$371       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    3060                      .dwattr $C$DW$371, DW_AT_name("alpha_sf")
    3061                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_alpha_sf")
    3062                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$372       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    3066                      .dwattr $C$DW$372, DW_AT_name("beta_sf")
    3067                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_beta_sf")
    3068                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3069                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$373       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    3072                      .dwattr $C$DW$373, DW_AT_name("numSensors")
    3073                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_numSensors")
    3074                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3075                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3076                      .dwendtag $C$DW$T$23
    3077              
    3078              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   62

    3079                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3080                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3081              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3082                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3083                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3084              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3085                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3086                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3087              
    3088              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3089                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3090                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3091              $C$DW$374       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$24)
    3093                      .dwattr $C$DW$374, DW_AT_name("version")
    3094                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_version")
    3095                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3097              $C$DW$375       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$26)
    3099                      .dwattr $C$DW$375, DW_AT_name("state")
    3100                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_state")
    3101                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3102                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3103              $C$DW$376       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    3105                      .dwattr $C$DW$376, DW_AT_name("prevState")
    3106                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_prevState")
    3107                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3108                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3109              $C$DW$377       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$28)
    3111                      .dwattr $C$DW$377, DW_AT_name("errorCode")
    3112                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_errorCode")
    3113                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3114                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3115              $C$DW$378       .dwtag  DW_TAG_member
    3116                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3117                      .dwattr $C$DW$378, DW_AT_name("clarkeHandle_I")
    3118                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3119                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3120                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3121              $C$DW$379       .dwtag  DW_TAG_member
    3122                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
    3123                      .dwattr $C$DW$379, DW_AT_name("clarke_I")
    3124                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_clarke_I")
    3125                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3126                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3127              $C$DW$380       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    3129                      .dwattr $C$DW$380, DW_AT_name("clarkeHandle_V")
    3130                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3131                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3132                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3133              $C$DW$381       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   63

    3134                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$31)
    3135                      .dwattr $C$DW$381, DW_AT_name("clarke_V")
    3136                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_clarke_V")
    3137                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3138                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3139              $C$DW$382       .dwtag  DW_TAG_member
    3140                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$33)
    3141                      .dwattr $C$DW$382, DW_AT_name("estHandle")
    3142                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_estHandle")
    3143                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3144                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3145              $C$DW$383       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$35)
    3147                      .dwattr $C$DW$383, DW_AT_name("parkHandle")
    3148                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_parkHandle")
    3149                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3150                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3151              $C$DW$384       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$36)
    3153                      .dwattr $C$DW$384, DW_AT_name("park")
    3154                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_park")
    3155                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3156                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3157              $C$DW$385       .dwtag  DW_TAG_member
    3158                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$38)
    3159                      .dwattr $C$DW$385, DW_AT_name("pidHandle_Id")
    3160                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pidHandle_Id")
    3161                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3162                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3163              $C$DW$386       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$39)
    3165                      .dwattr $C$DW$386, DW_AT_name("pid_Id")
    3166                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pid_Id")
    3167                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3168                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3169              $C$DW$387       .dwtag  DW_TAG_member
    3170                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$38)
    3171                      .dwattr $C$DW$387, DW_AT_name("pidHandle_Iq")
    3172                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3173                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3174                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3175              $C$DW$388       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$39)
    3177                      .dwattr $C$DW$388, DW_AT_name("pid_Iq")
    3178                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_pid_Iq")
    3179                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3180                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3181              $C$DW$389       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$38)
    3183                      .dwattr $C$DW$389, DW_AT_name("pidHandle_spd")
    3184                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_pidHandle_spd")
    3185                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3186                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3187              $C$DW$390       .dwtag  DW_TAG_member
    3188                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   64

    3189                      .dwattr $C$DW$390, DW_AT_name("pid_spd")
    3190                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_pid_spd")
    3191                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3192                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$391       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
    3195                      .dwattr $C$DW$391, DW_AT_name("iparkHandle")
    3196                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_iparkHandle")
    3197                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3198                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$392       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$42)
    3201                      .dwattr $C$DW$392, DW_AT_name("ipark")
    3202                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ipark")
    3203                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3204                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3205              $C$DW$393       .dwtag  DW_TAG_member
    3206                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$44)
    3207                      .dwattr $C$DW$393, DW_AT_name("svgenHandle")
    3208                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_svgenHandle")
    3209                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3210                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$394       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$45)
    3213                      .dwattr $C$DW$394, DW_AT_name("svgen")
    3214                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_svgen")
    3215                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3216                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$395       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$47)
    3219                      .dwattr $C$DW$395, DW_AT_name("trajHandle_Id")
    3220                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_trajHandle_Id")
    3221                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3222                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3223              $C$DW$396       .dwtag  DW_TAG_member
    3224                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$48)
    3225                      .dwattr $C$DW$396, DW_AT_name("traj_Id")
    3226                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_traj_Id")
    3227                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3228                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3229              $C$DW$397       .dwtag  DW_TAG_member
    3230                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$47)
    3231                      .dwattr $C$DW$397, DW_AT_name("trajHandle_spd")
    3232                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_trajHandle_spd")
    3233                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3234                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3235              $C$DW$398       .dwtag  DW_TAG_member
    3236                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$48)
    3237                      .dwattr $C$DW$398, DW_AT_name("traj_spd")
    3238                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_traj_spd")
    3239                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3240                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3241              $C$DW$399       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$47)
    3243                      .dwattr $C$DW$399, DW_AT_name("trajHandle_spdMax")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   65

    3244                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3245                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3246                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3247              $C$DW$400       .dwtag  DW_TAG_member
    3248                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$48)
    3249                      .dwattr $C$DW$400, DW_AT_name("traj_spdMax")
    3250                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_traj_spdMax")
    3251                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3252                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$401       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$49)
    3255                      .dwattr $C$DW$401, DW_AT_name("motorParams")
    3256                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_motorParams")
    3257                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3258                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$402       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$52)
    3261                      .dwattr $C$DW$402, DW_AT_name("waitTimes")
    3262                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_waitTimes")
    3263                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3264                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3265              $C$DW$403       .dwtag  DW_TAG_member
    3266                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$51)
    3267                      .dwattr $C$DW$403, DW_AT_name("counter_state")
    3268                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_counter_state")
    3269                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3270                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3271              $C$DW$404       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3273                      .dwattr $C$DW$404, DW_AT_name("numIsrTicksPerCtrlTick")
    3274                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3275                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3276                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3277              $C$DW$405       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$53)
    3279                      .dwattr $C$DW$405, DW_AT_name("numCtrlTicksPerCurrentTick")
    3280                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3281                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3282                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3283              $C$DW$406       .dwtag  DW_TAG_member
    3284                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$53)
    3285                      .dwattr $C$DW$406, DW_AT_name("numCtrlTicksPerSpeedTick")
    3286                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3287                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3288                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3289              $C$DW$407       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$53)
    3291                      .dwattr $C$DW$407, DW_AT_name("numCtrlTicksPerTrajTick")
    3292                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3293                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3294                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3295              $C$DW$408       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$51)
    3297                      .dwattr $C$DW$408, DW_AT_name("ctrlFreq_Hz")
    3298                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   66

    3299                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3300                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3301              $C$DW$409       .dwtag  DW_TAG_member
    3302                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$51)
    3303                      .dwattr $C$DW$409, DW_AT_name("trajFreq_Hz")
    3304                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3305                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3306                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3307              $C$DW$410       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3309                      .dwattr $C$DW$410, DW_AT_name("trajPeriod_sec")
    3310                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3311                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3312                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3313              $C$DW$411       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$54)
    3315                      .dwattr $C$DW$411, DW_AT_name("ctrlPeriod_sec")
    3316                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3317                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3318                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3319              $C$DW$412       .dwtag  DW_TAG_member
    3320                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3321                      .dwattr $C$DW$412, DW_AT_name("maxVsMag_pu")
    3322                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3323                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3324                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3325              $C$DW$413       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3327                      .dwattr $C$DW$413, DW_AT_name("Iab_in")
    3328                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Iab_in")
    3329                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3330                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3331              $C$DW$414       .dwtag  DW_TAG_member
    3332                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3333                      .dwattr $C$DW$414, DW_AT_name("Iab_filt")
    3334                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Iab_filt")
    3335                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3336                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3337              $C$DW$415       .dwtag  DW_TAG_member
    3338                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3339                      .dwattr $C$DW$415, DW_AT_name("Idq_in")
    3340                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Idq_in")
    3341                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3342                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3343              $C$DW$416       .dwtag  DW_TAG_member
    3344                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$55)
    3345                      .dwattr $C$DW$416, DW_AT_name("Vab_in")
    3346                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Vab_in")
    3347                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3348                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3349              $C$DW$417       .dwtag  DW_TAG_member
    3350                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3351                      .dwattr $C$DW$417, DW_AT_name("spd_out")
    3352                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_spd_out")
    3353                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   67

    3354                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3355              $C$DW$418       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$55)
    3357                      .dwattr $C$DW$418, DW_AT_name("Vab_out")
    3358                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Vab_out")
    3359                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3360                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3361              $C$DW$419       .dwtag  DW_TAG_member
    3362                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
    3363                      .dwattr $C$DW$419, DW_AT_name("Vdq_out")
    3364                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Vdq_out")
    3365                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3366                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3367              $C$DW$420       .dwtag  DW_TAG_member
    3368                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$54)
    3369                      .dwattr $C$DW$420, DW_AT_name("Rhf")
    3370                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Rhf")
    3371                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3372                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3373              $C$DW$421       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$54)
    3375                      .dwattr $C$DW$421, DW_AT_name("Lhf")
    3376                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Lhf")
    3377                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3378                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3379              $C$DW$422       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$54)
    3381                      .dwattr $C$DW$422, DW_AT_name("RoverL")
    3382                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RoverL")
    3383                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3384                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3385              $C$DW$423       .dwtag  DW_TAG_member
    3386                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3387                      .dwattr $C$DW$423, DW_AT_name("Kp_Id")
    3388                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Kp_Id")
    3389                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3390                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3391              $C$DW$424       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3393                      .dwattr $C$DW$424, DW_AT_name("Kp_Iq")
    3394                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kp_Iq")
    3395                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3396                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3397              $C$DW$425       .dwtag  DW_TAG_member
    3398                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3399                      .dwattr $C$DW$425, DW_AT_name("Kp_spd")
    3400                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kp_spd")
    3401                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3402                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3403              $C$DW$426       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3405                      .dwattr $C$DW$426, DW_AT_name("Ki_Id")
    3406                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Ki_Id")
    3407                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3408                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   68

    3409              $C$DW$427       .dwtag  DW_TAG_member
    3410                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3411                      .dwattr $C$DW$427, DW_AT_name("Ki_Iq")
    3412                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ki_Iq")
    3413                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3414                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$428       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3417                      .dwattr $C$DW$428, DW_AT_name("Ki_spd")
    3418                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ki_spd")
    3419                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3420                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3421              $C$DW$429       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3423                      .dwattr $C$DW$429, DW_AT_name("Kd_Id")
    3424                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Kd_Id")
    3425                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3426                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3427              $C$DW$430       .dwtag  DW_TAG_member
    3428                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3429                      .dwattr $C$DW$430, DW_AT_name("Kd_Iq")
    3430                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Kd_Iq")
    3431                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3432                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3433              $C$DW$431       .dwtag  DW_TAG_member
    3434                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3435                      .dwattr $C$DW$431, DW_AT_name("Kd_spd")
    3436                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Kd_spd")
    3437                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3438                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3439              $C$DW$432       .dwtag  DW_TAG_member
    3440                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3441                      .dwattr $C$DW$432, DW_AT_name("Ui_Id")
    3442                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Ui_Id")
    3443                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3444                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3445              $C$DW$433       .dwtag  DW_TAG_member
    3446                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3447                      .dwattr $C$DW$433, DW_AT_name("Ui_Iq")
    3448                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Ui_Iq")
    3449                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3450                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3451              $C$DW$434       .dwtag  DW_TAG_member
    3452                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3453                      .dwattr $C$DW$434, DW_AT_name("Ui_spd")
    3454                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Ui_spd")
    3455                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3456                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3457              $C$DW$435       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$55)
    3459                      .dwattr $C$DW$435, DW_AT_name("Idq_ref")
    3460                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Idq_ref")
    3461                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3462                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3463              $C$DW$436       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   69

    3464                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    3465                      .dwattr $C$DW$436, DW_AT_name("IdRated")
    3466                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_IdRated")
    3467                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3468                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3469              $C$DW$437       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3471                      .dwattr $C$DW$437, DW_AT_name("spd_ref")
    3472                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_spd_ref")
    3473                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3474                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3475              $C$DW$438       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3477                      .dwattr $C$DW$438, DW_AT_name("spd_max")
    3478                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_spd_max")
    3479                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3480                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3481              $C$DW$439       .dwtag  DW_TAG_member
    3482                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    3483                      .dwattr $C$DW$439, DW_AT_name("counter_current")
    3484                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_counter_current")
    3485                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3486                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3487              $C$DW$440       .dwtag  DW_TAG_member
    3488                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$53)
    3489                      .dwattr $C$DW$440, DW_AT_name("counter_isr")
    3490                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_counter_isr")
    3491                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3492                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$441       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$53)
    3495                      .dwattr $C$DW$441, DW_AT_name("counter_speed")
    3496                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_counter_speed")
    3497                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3498                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3499              $C$DW$442       .dwtag  DW_TAG_member
    3500                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    3501                      .dwattr $C$DW$442, DW_AT_name("counter_traj")
    3502                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_counter_traj")
    3503                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3504                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3505              $C$DW$443       .dwtag  DW_TAG_member
    3506                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3507                      .dwattr $C$DW$443, DW_AT_name("flag_enableCtrl")
    3508                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3509                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3510                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$444       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3513                      .dwattr $C$DW$444, DW_AT_name("flag_enableDcBusComp")
    3514                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3515                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3516                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3517              $C$DW$445       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   70

    3519                      .dwattr $C$DW$445, DW_AT_name("flag_enablePowerWarp")
    3520                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3521                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3522                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3523              $C$DW$446       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3525                      .dwattr $C$DW$446, DW_AT_name("flag_enableOffset")
    3526                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_flag_enableOffset")
    3527                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3528                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3529              $C$DW$447       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    3531                      .dwattr $C$DW$447, DW_AT_name("flag_enableSpeedCtrl")
    3532                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3533                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3534                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3535              $C$DW$448       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    3537                      .dwattr $C$DW$448, DW_AT_name("flag_enableUserMotorParams")
    3538                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3539                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3540                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3541              $C$DW$449       .dwtag  DW_TAG_member
    3542                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
    3543                      .dwattr $C$DW$449, DW_AT_name("Idq_offset_pu")
    3544                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3545                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3546                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3547              $C$DW$450       .dwtag  DW_TAG_member
    3548                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$55)
    3549                      .dwattr $C$DW$450, DW_AT_name("Vdq_offset_pu")
    3550                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3551                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3552                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3553              $C$DW$451       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    3555                      .dwattr $C$DW$451, DW_AT_name("angle_pu")
    3556                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_angle_pu")
    3557                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3558                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3559              $C$DW$452       .dwtag  DW_TAG_member
    3560                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    3561                      .dwattr $C$DW$452, DW_AT_name("speed_ref_pu")
    3562                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_speed_ref_pu")
    3563                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3564                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3565              $C$DW$453       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    3567                      .dwattr $C$DW$453, DW_AT_name("speed_fb_pu")
    3568                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_speed_fb_pu")
    3569                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3570                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3571              $C$DW$454       .dwtag  DW_TAG_member
    3572                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    3573                      .dwattr $C$DW$454, DW_AT_name("speed_outMax_pu")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   71

    3574                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3575                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3576                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3577              $C$DW$455       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3579                      .dwattr $C$DW$455, DW_AT_name("flag_enableCurrentCtrl")
    3580                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3581                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3582                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3583                      .dwendtag $C$DW$T$57
    3584              
    3585              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3586                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3587                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3588              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3589                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3590                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3591              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3592                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3593                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3594              $C$DW$456       .dwtag  DW_TAG_TI_far_type
    3595                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$87)
    3596              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3597                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$456)
    3598              
    3599              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3600                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3601                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3602              $C$DW$457       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$21)
    3604                      .dwattr $C$DW$457, DW_AT_name("rsvd")
    3605                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd")
    3606                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3607                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$458       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$59)
    3610                      .dwattr $C$DW$458, DW_AT_name("targetProc")
    3611                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_targetProc")
    3612                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3613                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$459       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    3616                      .dwattr $C$DW$459, DW_AT_name("major")
    3617                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_major")
    3618                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3619                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3620              $C$DW$460       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
    3622                      .dwattr $C$DW$460, DW_AT_name("minor")
    3623                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_minor")
    3624                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3625                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3626                      .dwendtag $C$DW$T$60
    3627              
    3628              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   72

    3629                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3630                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3631              
    3632              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3633                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3634                      .dwattr $C$DW$T$19, DW_AT_declaration
    3635                      .dwendtag $C$DW$T$19
    3636              
    3637              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3638                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3639                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3640              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3641                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3642                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3643              
    3644              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3645                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3646                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3647              $C$DW$461       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    3649                      .dwattr $C$DW$461, DW_AT_name("sinTh")
    3650                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_sinTh")
    3651                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3652                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3653              $C$DW$462       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    3655                      .dwattr $C$DW$462, DW_AT_name("cosTh")
    3656                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_cosTh")
    3657                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3658                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3659                      .dwendtag $C$DW$T$61
    3660              
    3661              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3662                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3663                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3664              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3665                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3666                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3667              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3668                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3669                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3670              
    3671              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3672                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3673                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3674              $C$DW$463       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$62)
    3676                      .dwattr $C$DW$463, DW_AT_name("value")
    3677                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_value")
    3678                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3679                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3680                      .dwendtag $C$DW$T$63
    3681              
    3682              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3683                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   73

    3684                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3685              
    3686              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3687                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3688                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3689              $C$DW$464       .dwtag  DW_TAG_member
    3690                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$65)
    3691                      .dwattr $C$DW$464, DW_AT_name("type")
    3692                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_type")
    3693                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3694                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$465       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$53)
    3697                      .dwattr $C$DW$465, DW_AT_name("numPolePairs")
    3698                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numPolePairs")
    3699                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3700                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3701              $C$DW$466       .dwtag  DW_TAG_member
    3702                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3703                      .dwattr $C$DW$466, DW_AT_name("Lr_H")
    3704                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Lr_H")
    3705                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3706                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3707              $C$DW$467       .dwtag  DW_TAG_member
    3708                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3709                      .dwattr $C$DW$467, DW_AT_name("Ls_d_H")
    3710                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Ls_d_H")
    3711                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3712                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3713              $C$DW$468       .dwtag  DW_TAG_member
    3714                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3715                      .dwattr $C$DW$468, DW_AT_name("Ls_q_H")
    3716                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Ls_q_H")
    3717                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3718                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3719              $C$DW$469       .dwtag  DW_TAG_member
    3720                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3721                      .dwattr $C$DW$469, DW_AT_name("Rr_Ohm")
    3722                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Rr_Ohm")
    3723                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3724                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3725              $C$DW$470       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3727                      .dwattr $C$DW$470, DW_AT_name("Rs_Ohm")
    3728                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Rs_Ohm")
    3729                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3730                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$471       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3733                      .dwattr $C$DW$471, DW_AT_name("ratedFlux_VpHz")
    3734                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3735                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3736                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3737                      .dwendtag $C$DW$T$66
    3738              
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   74

    3739              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3740                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3741                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3742              
    3743              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3744                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3745                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3746              $C$DW$472       .dwtag  DW_TAG_member
    3747                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3748                      .dwattr $C$DW$472, DW_AT_name("sinTh")
    3749                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_sinTh")
    3750                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3751                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3752              $C$DW$473       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3754                      .dwattr $C$DW$473, DW_AT_name("cosTh")
    3755                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_cosTh")
    3756                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3757                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3758                      .dwendtag $C$DW$T$67
    3759              
    3760              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3761                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3762                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3763              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3764                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3765                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3766              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3767                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3768                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3769              
    3770              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3771                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3772                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3773              $C$DW$474       .dwtag  DW_TAG_member
    3774                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3775                      .dwattr $C$DW$474, DW_AT_name("Kp")
    3776                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_Kp")
    3777                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3778                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3779              $C$DW$475       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3781                      .dwattr $C$DW$475, DW_AT_name("Ki")
    3782                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_Ki")
    3783                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3784                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3785              $C$DW$476       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3787                      .dwattr $C$DW$476, DW_AT_name("Kd")
    3788                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_Kd")
    3789                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3790                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3791              $C$DW$477       .dwtag  DW_TAG_member
    3792                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3793                      .dwattr $C$DW$477, DW_AT_name("Ui")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   75

    3794                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_Ui")
    3795                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3796                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3797              $C$DW$478       .dwtag  DW_TAG_member
    3798                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3799                      .dwattr $C$DW$478, DW_AT_name("refValue")
    3800                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_refValue")
    3801                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3802                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3803              $C$DW$479       .dwtag  DW_TAG_member
    3804                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3805                      .dwattr $C$DW$479, DW_AT_name("fbackValue")
    3806                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_fbackValue")
    3807                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3808                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3809              $C$DW$480       .dwtag  DW_TAG_member
    3810                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3811                      .dwattr $C$DW$480, DW_AT_name("outMin")
    3812                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_outMin")
    3813                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3814                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3815              $C$DW$481       .dwtag  DW_TAG_member
    3816                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3817                      .dwattr $C$DW$481, DW_AT_name("outMax")
    3818                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_outMax")
    3819                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3820                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3821                      .dwendtag $C$DW$T$68
    3822              
    3823              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3824                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3825                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3826              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3827                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3828                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3829              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3830                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3831                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3832              
    3833              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3834                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3835                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3836              $C$DW$482       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3838                      .dwattr $C$DW$482, DW_AT_name("maxModulation")
    3839                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxModulation")
    3840                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3841                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3842                      .dwendtag $C$DW$T$69
    3843              
    3844              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3845                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3846                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3847              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3848                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   76

    3849                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3850              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3851                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3852                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3853              
    3854              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3855                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3856                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3857              $C$DW$483       .dwtag  DW_TAG_member
    3858                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    3859                      .dwattr $C$DW$483, DW_AT_name("targetValue")
    3860                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_targetValue")
    3861                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3862                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3863              $C$DW$484       .dwtag  DW_TAG_member
    3864                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    3865                      .dwattr $C$DW$484, DW_AT_name("intValue")
    3866                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_intValue")
    3867                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3868                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3869              $C$DW$485       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    3871                      .dwattr $C$DW$485, DW_AT_name("minValue")
    3872                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_minValue")
    3873                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3874                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3875              $C$DW$486       .dwtag  DW_TAG_member
    3876                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    3877                      .dwattr $C$DW$486, DW_AT_name("maxValue")
    3878                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxValue")
    3879                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3880                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3881              $C$DW$487       .dwtag  DW_TAG_member
    3882                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    3883                      .dwattr $C$DW$487, DW_AT_name("maxDelta")
    3884                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_maxDelta")
    3885                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3886                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3887                      .dwendtag $C$DW$T$70
    3888              
    3889              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3890                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3891                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3892              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3893                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3894                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3895              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3896                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3897                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3898              
    3899              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3900                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3901                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3902              $C$DW$488       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   77

    3904                      .dwattr $C$DW$488, DW_AT_name("iqFullScaleCurrent_A")
    3905                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3906                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3907                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$489       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    3910                      .dwattr $C$DW$489, DW_AT_name("iqFullScaleVoltage_V")
    3911                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3912                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3913                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$490       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    3916                      .dwattr $C$DW$490, DW_AT_name("iqFullScaleFreq_Hz")
    3917                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3918                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3919                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$491       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$53)
    3922                      .dwattr $C$DW$491, DW_AT_name("numIsrTicksPerCtrlTick")
    3923                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3924                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3925                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$492       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3928                      .dwattr $C$DW$492, DW_AT_name("numCtrlTicksPerCurrentTick")
    3929                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3930                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3931                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$493       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$53)
    3934                      .dwattr $C$DW$493, DW_AT_name("numCtrlTicksPerEstTick")
    3935                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3936                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3937                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$494       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    3940                      .dwattr $C$DW$494, DW_AT_name("numCtrlTicksPerSpeedTick")
    3941                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3942                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3943                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$495       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    3946                      .dwattr $C$DW$495, DW_AT_name("numCtrlTicksPerTrajTick")
    3947                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3948                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3949                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$496       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    3952                      .dwattr $C$DW$496, DW_AT_name("numCurrentSensors")
    3953                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_numCurrentSensors")
    3954                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3955                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$497       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
    3958                      .dwattr $C$DW$497, DW_AT_name("numVoltageSensors")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   78

    3959                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_numVoltageSensors")
    3960                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3961                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$498       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3964                      .dwattr $C$DW$498, DW_AT_name("offsetPole_rps")
    3965                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_offsetPole_rps")
    3966                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3967                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$499       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3970                      .dwattr $C$DW$499, DW_AT_name("fluxPole_rps")
    3971                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_fluxPole_rps")
    3972                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3973                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$500       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3976                      .dwattr $C$DW$500, DW_AT_name("zeroSpeedLimit")
    3977                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3978                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3979                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$501       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3982                      .dwattr $C$DW$501, DW_AT_name("forceAngleFreq_Hz")
    3983                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3984                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3985                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3986              $C$DW$502       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3988                      .dwattr $C$DW$502, DW_AT_name("maxAccel_Hzps")
    3989                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3990                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3991                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$503       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3994                      .dwattr $C$DW$503, DW_AT_name("maxAccel_est_Hzps")
    3995                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3996                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3997                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$504       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    4000                      .dwattr $C$DW$504, DW_AT_name("directionPole_rps")
    4001                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_directionPole_rps")
    4002                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4003                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$505       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    4006                      .dwattr $C$DW$505, DW_AT_name("speedPole_rps")
    4007                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_speedPole_rps")
    4008                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4009                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$506       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    4012                      .dwattr $C$DW$506, DW_AT_name("dcBusPole_rps")
    4013                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_dcBusPole_rps")
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   79

    4014                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4015                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$507       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    4018                      .dwattr $C$DW$507, DW_AT_name("fluxFraction")
    4019                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_fluxFraction")
    4020                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4021                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4022              $C$DW$508       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    4024                      .dwattr $C$DW$508, DW_AT_name("indEst_speedMaxFraction")
    4025                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4026                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4027                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4028              $C$DW$509       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    4030                      .dwattr $C$DW$509, DW_AT_name("powerWarpGain")
    4031                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_powerWarpGain")
    4032                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4033                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4034              $C$DW$510       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$53)
    4036                      .dwattr $C$DW$510, DW_AT_name("systemFreq_MHz")
    4037                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4038                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4039                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4040              $C$DW$511       .dwtag  DW_TAG_member
    4041                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    4042                      .dwattr $C$DW$511, DW_AT_name("pwmPeriod_usec")
    4043                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4044                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4045                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4046              $C$DW$512       .dwtag  DW_TAG_member
    4047                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    4048                      .dwattr $C$DW$512, DW_AT_name("voltage_sf")
    4049                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_voltage_sf")
    4050                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4051                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4052              $C$DW$513       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    4054                      .dwattr $C$DW$513, DW_AT_name("current_sf")
    4055                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_current_sf")
    4056                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4057                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4058              $C$DW$514       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4060                      .dwattr $C$DW$514, DW_AT_name("voltageFilterPole_rps")
    4061                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4062                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4063                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4064              $C$DW$515       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    4066                      .dwattr $C$DW$515, DW_AT_name("maxVsMag_pu")
    4067                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4068                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   80

    4069                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4070              $C$DW$516       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    4072                      .dwattr $C$DW$516, DW_AT_name("estKappa")
    4073                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_estKappa")
    4074                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4075                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$517       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$65)
    4078                      .dwattr $C$DW$517, DW_AT_name("motor_type")
    4079                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_type")
    4080                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4081                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$518       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$53)
    4084                      .dwattr $C$DW$518, DW_AT_name("motor_numPolePairs")
    4085                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4086                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4087                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4088              $C$DW$519       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    4090                      .dwattr $C$DW$519, DW_AT_name("motor_ratedFlux")
    4091                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4092                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4093                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$520       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4096                      .dwattr $C$DW$520, DW_AT_name("motor_Rr")
    4097                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_motor_Rr")
    4098                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4099                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4100              $C$DW$521       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4102                      .dwattr $C$DW$521, DW_AT_name("motor_Rs")
    4103                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_motor_Rs")
    4104                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4105                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4106              $C$DW$522       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4108                      .dwattr $C$DW$522, DW_AT_name("motor_Ls_d")
    4109                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_motor_Ls_d")
    4110                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4111                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$523       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4114                      .dwattr $C$DW$523, DW_AT_name("motor_Ls_q")
    4115                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_motor_Ls_q")
    4116                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4117                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$524       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4120                      .dwattr $C$DW$524, DW_AT_name("maxCurrent")
    4121                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_maxCurrent")
    4122                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4123                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   81

    4124              $C$DW$525       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4126                      .dwattr $C$DW$525, DW_AT_name("maxCurrent_resEst")
    4127                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4128                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4129                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$526       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4132                      .dwattr $C$DW$526, DW_AT_name("maxCurrent_indEst")
    4133                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4134                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4135                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$527       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4138                      .dwattr $C$DW$527, DW_AT_name("maxCurrentSlope")
    4139                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4140                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4141                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$528       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4144                      .dwattr $C$DW$528, DW_AT_name("maxCurrentSlope_powerWarp")
    4145                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4146                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4147                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$529       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4150                      .dwattr $C$DW$529, DW_AT_name("IdRated")
    4151                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_IdRated")
    4152                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4153                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$530       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$54)
    4156                      .dwattr $C$DW$530, DW_AT_name("IdRatedFraction_indEst")
    4157                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4158                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4159                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$531       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$54)
    4162                      .dwattr $C$DW$531, DW_AT_name("IdRatedFraction_ratedFlux")
    4163                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4164                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4165                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$532       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$54)
    4168                      .dwattr $C$DW$532, DW_AT_name("IdRated_delta")
    4169                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_IdRated_delta")
    4170                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4171                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$533       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$54)
    4174                      .dwattr $C$DW$533, DW_AT_name("fluxEstFreq_Hz")
    4175                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4176                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4177                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$534       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Fri Jan 20 18:10:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0023210                            PAGE   82

    4179                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$52)
    4180                      .dwattr $C$DW$534, DW_AT_name("ctrlWaitTime")
    4181                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4182                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4183                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$535       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$71)
    4186                      .dwattr $C$DW$535, DW_AT_name("estWaitTime")
    4187                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_estWaitTime")
    4188                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4189                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
