TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Sep 05 19:06:40 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/drivers/pie/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_6.4.11\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp\\28136

    1978              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT5"), DW_AT_const_value(0x05)
    1979              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT6"), DW_AT_const_value(0x06)
    1980              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT7"), DW_AT_const_value(0x07)
    1981              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT8"), DW_AT_const_value(0x08)
    1982              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT9"), DW_AT_const_value(0x09)
    1983              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT10"), DW_AT_const_value(0x0a)
    1984              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT11"), DW_AT_const_value(0x0b)
    1985              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT12"), DW_AT_const_value(0x0c)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   38

    1986              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT1"), DW_AT_const_value(0x0d)
    1987              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT2"), DW_AT_const_value(0x0e)
    1988              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_DATALOG"), DW_AT_const_value(0x0f
    1989              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_RTOSINT"), DW_AT_const_value(0x10
    1990              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_EMUINT"), DW_AT_const_value(0x11)
    1991              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_NMI"), DW_AT_const_value(0x12)
    1992              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_ILLEGAL"), DW_AT_const_value(0x13
    1993              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER1"), DW_AT_const_value(0x14)
    1994              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER2"), DW_AT_const_value(0x15)
    1995              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER3"), DW_AT_const_value(0x16)
    1996              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER4"), DW_AT_const_value(0x17)
    1997              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER5"), DW_AT_const_value(0x18)
    1998              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER6"), DW_AT_const_value(0x19)
    1999              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER7"), DW_AT_const_value(0x1a)
    2000              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER8"), DW_AT_const_value(0x1b)
    2001              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER9"), DW_AT_const_value(0x1c)
    2002              $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER10"), DW_AT_const_value(0x1d)
    2003              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER11"), DW_AT_const_value(0x1e)
    2004              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER12"), DW_AT_const_value(0x1f)
    2005                      .dwendtag $C$DW$T$52
    2006              
    2007              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_SystemInterrupts_e")
    2008                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2009                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2010              $C$DW$259       .dwtag  DW_TAG_TI_far_type
    2011                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$53)
    2012              $C$DW$T$54      .dwtag  DW_TAG_const_type
    2013                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$259)
    2014              
    2015              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    2016                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    2017              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_FallingEdge"), DW_AT_const_value(0x
    2018              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingEdge"), DW_AT_const_value(0x0
    2019              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge"), DW_AT_const
    2020                      .dwendtag $C$DW$T$55
    2021              
    2022              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_ExtIntPolarity_e")
    2023                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    2024                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2025              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    2026                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$56)
    2027              $C$DW$T$57      .dwtag  DW_TAG_const_type
    2028                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$263)
    2029              
    2030              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2031                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    2032                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    2033              $C$DW$264       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2035                      .dwattr $C$DW$264, DW_AT_name("IER")
    2036                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_IER")
    2037                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2039              $C$DW$265       .dwtag  DW_TAG_member
    2040                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   39

    2041                      .dwattr $C$DW$265, DW_AT_name("IFR")
    2042                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_IFR")
    2043                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2044                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2045                      .dwendtag $C$DW$T$21
    2046              
    2047              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    2048                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2049                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2050              $C$DW$266       .dwtag  DW_TAG_TI_far_type
    2051                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$22)
    2052              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2053                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$266)
    2054              
    2055              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2056                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2057                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2058                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2059              $C$DW$267       .dwtag  DW_TAG_subrange_type
    2060                      .dwattr $C$DW$267, DW_AT_upper_bound(0x0b)
    2061                      .dwendtag $C$DW$T$24
    2062              
    2063              
    2064              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2065                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2066                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2067              $C$DW$268       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    2069                      .dwattr $C$DW$268, DW_AT_name("PIECTRL")
    2070                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_PIECTRL")
    2071                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$269       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$20)
    2075                      .dwattr $C$DW$269, DW_AT_name("PIEACK")
    2076                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_PIEACK")
    2077                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2078                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$270       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$24)
    2081                      .dwattr $C$DW$270, DW_AT_name("PIEIER_PIEIFR")
    2082                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2083                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2084                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2085              $C$DW$271       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
    2087                      .dwattr $C$DW$271, DW_AT_name("rsvd_1")
    2088                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_rsvd_1")
    2089                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2090                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$272       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    2093                      .dwattr $C$DW$272, DW_AT_name("Reset")
    2094                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_Reset")
    2095                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   40

    2096                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$273       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$29)
    2099                      .dwattr $C$DW$273, DW_AT_name("INT1")
    2100                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INT1")
    2101                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2102                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$274       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$29)
    2105                      .dwattr $C$DW$274, DW_AT_name("INT2")
    2106                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT2")
    2107                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2108                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2109              $C$DW$275       .dwtag  DW_TAG_member
    2110                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    2111                      .dwattr $C$DW$275, DW_AT_name("INT3")
    2112                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INT3")
    2113                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2114                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$276       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$29)
    2117                      .dwattr $C$DW$276, DW_AT_name("INT4")
    2118                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INT4")
    2119                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2120                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$277       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    2123                      .dwattr $C$DW$277, DW_AT_name("INT5")
    2124                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT5")
    2125                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2126                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$278       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$29)
    2129                      .dwattr $C$DW$278, DW_AT_name("INT6")
    2130                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INT6")
    2131                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2132                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$279       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    2135                      .dwattr $C$DW$279, DW_AT_name("INT7")
    2136                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT7")
    2137                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2138                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2139              $C$DW$280       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$29)
    2141                      .dwattr $C$DW$280, DW_AT_name("INT8")
    2142                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INT8")
    2143                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2144                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$281       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
    2147                      .dwattr $C$DW$281, DW_AT_name("INT9")
    2148                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INT9")
    2149                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2150                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   41

    2151              $C$DW$282       .dwtag  DW_TAG_member
    2152                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$29)
    2153                      .dwattr $C$DW$282, DW_AT_name("INT10")
    2154                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INT10")
    2155                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2156                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$283       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$29)
    2159                      .dwattr $C$DW$283, DW_AT_name("INT11")
    2160                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_INT11")
    2161                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2162                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2163              $C$DW$284       .dwtag  DW_TAG_member
    2164                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    2165                      .dwattr $C$DW$284, DW_AT_name("INT12")
    2166                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_INT12")
    2167                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2168                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2169              $C$DW$285       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$29)
    2171                      .dwattr $C$DW$285, DW_AT_name("TINT1")
    2172                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_TINT1")
    2173                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2174                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2175              $C$DW$286       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$29)
    2177                      .dwattr $C$DW$286, DW_AT_name("TINT2")
    2178                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_TINT2")
    2179                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2180                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2181              $C$DW$287       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$29)
    2183                      .dwattr $C$DW$287, DW_AT_name("DATALOG")
    2184                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_DATALOG")
    2185                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2186                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$288       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$29)
    2189                      .dwattr $C$DW$288, DW_AT_name("RTOSINT")
    2190                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_RTOSINT")
    2191                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2192                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2193              $C$DW$289       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    2195                      .dwattr $C$DW$289, DW_AT_name("EMUINT")
    2196                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_EMUINT")
    2197                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2198                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$290       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    2201                      .dwattr $C$DW$290, DW_AT_name("NMI")
    2202                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_NMI")
    2203                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2204                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2205              $C$DW$291       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   42

    2206                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    2207                      .dwattr $C$DW$291, DW_AT_name("ILLEGAL")
    2208                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_ILLEGAL")
    2209                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2210                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$292       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    2213                      .dwattr $C$DW$292, DW_AT_name("USER1")
    2214                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_USER1")
    2215                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2216                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2217              $C$DW$293       .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
    2219                      .dwattr $C$DW$293, DW_AT_name("USER2")
    2220                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_USER2")
    2221                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2222                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2223              $C$DW$294       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    2225                      .dwattr $C$DW$294, DW_AT_name("USER3")
    2226                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_USER3")
    2227                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2228                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$295       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    2231                      .dwattr $C$DW$295, DW_AT_name("USER4")
    2232                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_USER4")
    2233                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2234                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2235              $C$DW$296       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    2237                      .dwattr $C$DW$296, DW_AT_name("USER5")
    2238                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_USER5")
    2239                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2240                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2241              $C$DW$297       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    2243                      .dwattr $C$DW$297, DW_AT_name("USER6")
    2244                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_USER6")
    2245                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2246                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2247              $C$DW$298       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    2249                      .dwattr $C$DW$298, DW_AT_name("USER7")
    2250                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_USER7")
    2251                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2252                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2253              $C$DW$299       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    2255                      .dwattr $C$DW$299, DW_AT_name("USER8")
    2256                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_USER8")
    2257                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2258                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2259              $C$DW$300       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   43

    2261                      .dwattr $C$DW$300, DW_AT_name("USER9")
    2262                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_USER9")
    2263                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2264                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$301       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$29)
    2267                      .dwattr $C$DW$301, DW_AT_name("USER10")
    2268                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_USER10")
    2269                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2270                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$302       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$29)
    2273                      .dwattr $C$DW$302, DW_AT_name("USER11")
    2274                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_USER11")
    2275                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2276                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$303       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$29)
    2279                      .dwattr $C$DW$303, DW_AT_name("USER12")
    2280                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_USER12")
    2281                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2282                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$304       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$29)
    2285                      .dwattr $C$DW$304, DW_AT_name("ADCINT1_HP")
    2286                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2287                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2288                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$305       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$29)
    2291                      .dwattr $C$DW$305, DW_AT_name("ADCINT2_HP")
    2292                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2293                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2294                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$306       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$29)
    2297                      .dwattr $C$DW$306, DW_AT_name("rsvd1_3")
    2298                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_rsvd1_3")
    2299                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2300                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2301              $C$DW$307       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$29)
    2303                      .dwattr $C$DW$307, DW_AT_name("XINT1")
    2304                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_XINT1")
    2305                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2306                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$308       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$29)
    2309                      .dwattr $C$DW$308, DW_AT_name("XINT2")
    2310                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_XINT2")
    2311                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2312                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$309       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    2315                      .dwattr $C$DW$309, DW_AT_name("ADCINT9")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   44

    2316                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_ADCINT9")
    2317                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2318                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$310       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    2321                      .dwattr $C$DW$310, DW_AT_name("TINT0")
    2322                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_TINT0")
    2323                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2324                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2325              $C$DW$311       .dwtag  DW_TAG_member
    2326                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$29)
    2327                      .dwattr $C$DW$311, DW_AT_name("WAKEINT")
    2328                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_WAKEINT")
    2329                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2330                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$312       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    2333                      .dwattr $C$DW$312, DW_AT_name("EPWM1_TZINT")
    2334                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2335                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2336                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$313       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2339                      .dwattr $C$DW$313, DW_AT_name("EPWM2_TZINT")
    2340                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2341                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2342                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$314       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2345                      .dwattr $C$DW$314, DW_AT_name("EPWM3_TZINT")
    2346                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2347                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2348                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$315       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    2351                      .dwattr $C$DW$315, DW_AT_name("EPWM4_TZINT")
    2352                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2353                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2354                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$316       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    2357                      .dwattr $C$DW$316, DW_AT_name("rsvd2_5")
    2358                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd2_5")
    2359                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2360                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2361              $C$DW$317       .dwtag  DW_TAG_member
    2362                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    2363                      .dwattr $C$DW$317, DW_AT_name("rsvd2_6")
    2364                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_rsvd2_6")
    2365                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2366                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2367              $C$DW$318       .dwtag  DW_TAG_member
    2368                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    2369                      .dwattr $C$DW$318, DW_AT_name("rsvd2_7")
    2370                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_rsvd2_7")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   45

    2371                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2372                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$319       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    2375                      .dwattr $C$DW$319, DW_AT_name("rsvd2_8")
    2376                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_rsvd2_8")
    2377                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2378                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$320       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    2381                      .dwattr $C$DW$320, DW_AT_name("EPWM1_INT")
    2382                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_EPWM1_INT")
    2383                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2384                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$321       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    2387                      .dwattr $C$DW$321, DW_AT_name("EPWM2_INT")
    2388                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_EPWM2_INT")
    2389                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2390                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$322       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
    2393                      .dwattr $C$DW$322, DW_AT_name("EPWM3_INT")
    2394                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_EPWM3_INT")
    2395                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2396                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$323       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    2399                      .dwattr $C$DW$323, DW_AT_name("EPWM4_INT")
    2400                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_EPWM4_INT")
    2401                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2402                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$324       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    2405                      .dwattr $C$DW$324, DW_AT_name("rsvd3_5")
    2406                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_rsvd3_5")
    2407                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2408                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$325       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    2411                      .dwattr $C$DW$325, DW_AT_name("rsvd3_6")
    2412                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_rsvd3_6")
    2413                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2414                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2415              $C$DW$326       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    2417                      .dwattr $C$DW$326, DW_AT_name("rsvd3_7")
    2418                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_rsvd3_7")
    2419                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2420                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$327       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    2423                      .dwattr $C$DW$327, DW_AT_name("rsvd3_8")
    2424                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_rsvd3_8")
    2425                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   46

    2426                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2427              $C$DW$328       .dwtag  DW_TAG_member
    2428                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    2429                      .dwattr $C$DW$328, DW_AT_name("ECAP1_INT")
    2430                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_ECAP1_INT")
    2431                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2432                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$329       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    2435                      .dwattr $C$DW$329, DW_AT_name("rsvd4_2")
    2436                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_rsvd4_2")
    2437                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2438                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$330       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    2441                      .dwattr $C$DW$330, DW_AT_name("rsvd4_3")
    2442                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd4_3")
    2443                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2444                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$331       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    2447                      .dwattr $C$DW$331, DW_AT_name("rsvd4_4")
    2448                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_rsvd4_4")
    2449                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2450                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$332       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    2453                      .dwattr $C$DW$332, DW_AT_name("rsvd4_5")
    2454                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd4_5")
    2455                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2456                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2457              $C$DW$333       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    2459                      .dwattr $C$DW$333, DW_AT_name("rsvd4_6")
    2460                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd4_6")
    2461                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2462                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$334       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    2465                      .dwattr $C$DW$334, DW_AT_name("rsvd4_7")
    2466                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_rsvd4_7")
    2467                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2468                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2469              $C$DW$335       .dwtag  DW_TAG_member
    2470                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    2471                      .dwattr $C$DW$335, DW_AT_name("rsvd4_8")
    2472                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd4_8")
    2473                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2474                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$336       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    2477                      .dwattr $C$DW$336, DW_AT_name("rsvd5_1")
    2478                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_rsvd5_1")
    2479                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2480                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   47

    2481              $C$DW$337       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    2483                      .dwattr $C$DW$337, DW_AT_name("rsvd5_2")
    2484                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd5_2")
    2485                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2486                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2487              $C$DW$338       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    2489                      .dwattr $C$DW$338, DW_AT_name("rsvd5_3")
    2490                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_rsvd5_3")
    2491                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2492                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2493              $C$DW$339       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    2495                      .dwattr $C$DW$339, DW_AT_name("rsvd5_4")
    2496                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd5_4")
    2497                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2498                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2499              $C$DW$340       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    2501                      .dwattr $C$DW$340, DW_AT_name("rsvd5_5")
    2502                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd5_5")
    2503                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2504                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2505              $C$DW$341       .dwtag  DW_TAG_member
    2506                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    2507                      .dwattr $C$DW$341, DW_AT_name("rsvd5_6")
    2508                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_rsvd5_6")
    2509                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2510                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2511              $C$DW$342       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    2513                      .dwattr $C$DW$342, DW_AT_name("rsvd5_7")
    2514                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd5_7")
    2515                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2516                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$343       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    2519                      .dwattr $C$DW$343, DW_AT_name("rsvd5_8")
    2520                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_rsvd5_8")
    2521                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2522                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2523              $C$DW$344       .dwtag  DW_TAG_member
    2524                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    2525                      .dwattr $C$DW$344, DW_AT_name("SPIRXINTA")
    2526                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_SPIRXINTA")
    2527                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2528                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2529              $C$DW$345       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    2531                      .dwattr $C$DW$345, DW_AT_name("SPITXINTA")
    2532                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_SPITXINTA")
    2533                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2534                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$346       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   48

    2536                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    2537                      .dwattr $C$DW$346, DW_AT_name("rsvd6_3")
    2538                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_rsvd6_3")
    2539                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2540                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$347       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    2543                      .dwattr $C$DW$347, DW_AT_name("rsvd6_4")
    2544                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd6_4")
    2545                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2546                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$348       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
    2549                      .dwattr $C$DW$348, DW_AT_name("rsvd6_5")
    2550                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_rsvd6_5")
    2551                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2552                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$349       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    2555                      .dwattr $C$DW$349, DW_AT_name("rsvd6_6")
    2556                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd6_6")
    2557                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2558                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$350       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    2561                      .dwattr $C$DW$350, DW_AT_name("rsvd6_7")
    2562                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_rsvd6_7")
    2563                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2564                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$351       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    2567                      .dwattr $C$DW$351, DW_AT_name("rsvd6_8")
    2568                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_rsvd6_8")
    2569                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2570                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$352       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    2573                      .dwattr $C$DW$352, DW_AT_name("rsvd7_1")
    2574                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd7_1")
    2575                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2576                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2577              $C$DW$353       .dwtag  DW_TAG_member
    2578                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    2579                      .dwattr $C$DW$353, DW_AT_name("rsvd7_2")
    2580                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_rsvd7_2")
    2581                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2582                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$354       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    2585                      .dwattr $C$DW$354, DW_AT_name("rsvd7_3")
    2586                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd7_3")
    2587                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2588                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2589              $C$DW$355       .dwtag  DW_TAG_member
    2590                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   49

    2591                      .dwattr $C$DW$355, DW_AT_name("rsvd7_4")
    2592                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_rsvd7_4")
    2593                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2594                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$356       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    2597                      .dwattr $C$DW$356, DW_AT_name("rsvd7_5")
    2598                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd7_5")
    2599                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2600                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$357       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    2603                      .dwattr $C$DW$357, DW_AT_name("rsvd7_6")
    2604                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_rsvd7_6")
    2605                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2606                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2607              $C$DW$358       .dwtag  DW_TAG_member
    2608                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    2609                      .dwattr $C$DW$358, DW_AT_name("rsvd7_7")
    2610                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd7_7")
    2611                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2612                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$359       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    2615                      .dwattr $C$DW$359, DW_AT_name("rsvd7_8")
    2616                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd7_8")
    2617                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2618                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2619              $C$DW$360       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
    2621                      .dwattr $C$DW$360, DW_AT_name("I2CINT1A")
    2622                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_I2CINT1A")
    2623                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2624                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2625              $C$DW$361       .dwtag  DW_TAG_member
    2626                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    2627                      .dwattr $C$DW$361, DW_AT_name("I2CINT2A")
    2628                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_I2CINT2A")
    2629                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2630                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2631              $C$DW$362       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    2633                      .dwattr $C$DW$362, DW_AT_name("rsvd8_3")
    2634                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd8_3")
    2635                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2636                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2637              $C$DW$363       .dwtag  DW_TAG_member
    2638                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    2639                      .dwattr $C$DW$363, DW_AT_name("rsvd8_4")
    2640                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd8_4")
    2641                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2642                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2643              $C$DW$364       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    2645                      .dwattr $C$DW$364, DW_AT_name("rsvd8_5")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   50

    2646                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd8_5")
    2647                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2648                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2649              $C$DW$365       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    2651                      .dwattr $C$DW$365, DW_AT_name("rsvd8_6")
    2652                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_rsvd8_6")
    2653                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2654                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2655              $C$DW$366       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    2657                      .dwattr $C$DW$366, DW_AT_name("rsvd8_7")
    2658                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_rsvd8_7")
    2659                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2660                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2661              $C$DW$367       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    2663                      .dwattr $C$DW$367, DW_AT_name("rsvd8_8")
    2664                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd8_8")
    2665                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2666                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$368       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    2669                      .dwattr $C$DW$368, DW_AT_name("SCIRXINTA")
    2670                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_SCIRXINTA")
    2671                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2672                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2673              $C$DW$369       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    2675                      .dwattr $C$DW$369, DW_AT_name("SCITXINTA")
    2676                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_SCITXINTA")
    2677                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2678                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2679              $C$DW$370       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    2681                      .dwattr $C$DW$370, DW_AT_name("rsvd9_3")
    2682                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd9_3")
    2683                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2684                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2685              $C$DW$371       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    2687                      .dwattr $C$DW$371, DW_AT_name("rsvd9_4")
    2688                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd9_4")
    2689                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2690                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2691              $C$DW$372       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    2693                      .dwattr $C$DW$372, DW_AT_name("rsvd9_5")
    2694                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd9_5")
    2695                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2696                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2697              $C$DW$373       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    2699                      .dwattr $C$DW$373, DW_AT_name("rsvd9_6")
    2700                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd9_6")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   51

    2701                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2702                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$374       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    2705                      .dwattr $C$DW$374, DW_AT_name("rsvd9_7")
    2706                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_rsvd9_7")
    2707                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2708                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2709              $C$DW$375       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    2711                      .dwattr $C$DW$375, DW_AT_name("rsvd9_8")
    2712                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd9_8")
    2713                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2714                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2715              $C$DW$376       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    2717                      .dwattr $C$DW$376, DW_AT_name("ADCINT1")
    2718                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINT1")
    2719                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2720                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2721              $C$DW$377       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    2723                      .dwattr $C$DW$377, DW_AT_name("ADCINT2")
    2724                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINT2")
    2725                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2726                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2727              $C$DW$378       .dwtag  DW_TAG_member
    2728                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    2729                      .dwattr $C$DW$378, DW_AT_name("ADCINT3")
    2730                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCINT3")
    2731                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2732                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2733              $C$DW$379       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    2735                      .dwattr $C$DW$379, DW_AT_name("ADCINT4")
    2736                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINT4")
    2737                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2738                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2739              $C$DW$380       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    2741                      .dwattr $C$DW$380, DW_AT_name("ADCINT5")
    2742                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINT5")
    2743                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2744                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2745              $C$DW$381       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    2747                      .dwattr $C$DW$381, DW_AT_name("ADCINT6")
    2748                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCINT6")
    2749                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2750                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2751              $C$DW$382       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    2753                      .dwattr $C$DW$382, DW_AT_name("ADCINT7")
    2754                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCINT7")
    2755                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   52

    2756                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2757              $C$DW$383       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    2759                      .dwattr $C$DW$383, DW_AT_name("ADCINT8")
    2760                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCINT8")
    2761                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2762                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2763              $C$DW$384       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    2765                      .dwattr $C$DW$384, DW_AT_name("rsvd11_1")
    2766                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd11_1")
    2767                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2768                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2769              $C$DW$385       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    2771                      .dwattr $C$DW$385, DW_AT_name("rsvd11_2")
    2772                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd11_2")
    2773                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2774                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2775              $C$DW$386       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    2777                      .dwattr $C$DW$386, DW_AT_name("rsvd11_3")
    2778                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd11_3")
    2779                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2780                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2781              $C$DW$387       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    2783                      .dwattr $C$DW$387, DW_AT_name("rsvd11_4")
    2784                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd11_4")
    2785                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2786                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2787              $C$DW$388       .dwtag  DW_TAG_member
    2788                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    2789                      .dwattr $C$DW$388, DW_AT_name("rsvd11_5")
    2790                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd11_5")
    2791                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    2792                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2793              $C$DW$389       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    2795                      .dwattr $C$DW$389, DW_AT_name("rsvd11_6")
    2796                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd11_6")
    2797                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2798                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2799              $C$DW$390       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    2801                      .dwattr $C$DW$390, DW_AT_name("rsvd11_7")
    2802                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd11_7")
    2803                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
    2804                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2805              $C$DW$391       .dwtag  DW_TAG_member
    2806                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    2807                      .dwattr $C$DW$391, DW_AT_name("rsvd11_8")
    2808                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd11_8")
    2809                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2810                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   53

    2811              $C$DW$392       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    2813                      .dwattr $C$DW$392, DW_AT_name("XINT3")
    2814                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_XINT3")
    2815                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2816                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2817              $C$DW$393       .dwtag  DW_TAG_member
    2818                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    2819                      .dwattr $C$DW$393, DW_AT_name("rsvd12_2")
    2820                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd12_2")
    2821                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2822                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2823              $C$DW$394       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    2825                      .dwattr $C$DW$394, DW_AT_name("rsvd12_3")
    2826                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_rsvd12_3")
    2827                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2828                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2829              $C$DW$395       .dwtag  DW_TAG_member
    2830                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    2831                      .dwattr $C$DW$395, DW_AT_name("rsvd12_4")
    2832                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd12_4")
    2833                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2834                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2835              $C$DW$396       .dwtag  DW_TAG_member
    2836                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    2837                      .dwattr $C$DW$396, DW_AT_name("rsvd12_5")
    2838                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd12_5")
    2839                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2840                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    2841              $C$DW$397       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    2843                      .dwattr $C$DW$397, DW_AT_name("rsvd12_6")
    2844                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd12_6")
    2845                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    2846                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2847              $C$DW$398       .dwtag  DW_TAG_member
    2848                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$29)
    2849                      .dwattr $C$DW$398, DW_AT_name("rsvd12_7")
    2850                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_rsvd12_7")
    2851                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2852                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2853              $C$DW$399       .dwtag  DW_TAG_member
    2854                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$29)
    2855                      .dwattr $C$DW$399, DW_AT_name("rsvd12_8")
    2856                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_rsvd12_8")
    2857                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    2858                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2859              $C$DW$400       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$30)
    2861                      .dwattr $C$DW$400, DW_AT_name("rsvd13")
    2862                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_rsvd13")
    2863                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2864                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$401       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   54

    2866                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
    2867                      .dwattr $C$DW$401, DW_AT_name("XINTnCR")
    2868                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_XINTnCR")
    2869                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    2870                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    2871              $C$DW$402       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$32)
    2873                      .dwattr $C$DW$402, DW_AT_name("rsvd14")
    2874                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_rsvd14")
    2875                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    2876                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$403       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$31)
    2879                      .dwattr $C$DW$403, DW_AT_name("XINTnCTR")
    2880                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_XINTnCTR")
    2881                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    2882                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    2883                      .dwendtag $C$DW$T$33
    2884              
    2885              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Obj")
    2886                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    2887                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2888              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2889                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
    2890                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    2891              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Handle")
    2892                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2893                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2894              $C$DW$404       .dwtag  DW_TAG_TI_far_type
    2895                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$62)
    2896              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2897                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$404)
    2898              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2899                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2900              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2901                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2902                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2903              
    2904              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2905                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2906              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2907                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2908                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2909              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IntVec_t")
    2910                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2911                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2912              $C$DW$405       .dwtag  DW_TAG_TI_far_type
    2913                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$28)
    2914              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    2915                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$405)
    2916              $C$DW$406       .dwtag  DW_TAG_TI_far_type
    2917                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$28)
    2918              $C$DW$T$70      .dwtag  DW_TAG_const_type
    2919                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$406)
    2920              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:06:41 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2813610                            PAGE   55

    2921                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    2922                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    2923              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2924                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2925                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2926                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2927              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2928                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2929                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2930                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2931              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2932                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2933                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2934                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
