TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Wed Nov 23 09:26:04 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3367              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    3368              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    3369              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    3370              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    3371              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    3372              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    3373              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3374              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3375              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3376              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3377              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3378                      .dwendtag $C$DW$T$215
    3379              
    3380              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3381                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    3382                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    3383              
    3384              $C$DW$T$218     .dwtag  DW_TAG_enumeration_type
    3385                      .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    3386              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3387              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   68

    3388              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3389              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3390              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3391              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3392              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3393              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3394              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3395              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3396              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3397              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3398                      .dwendtag $C$DW$T$218
    3399              
    3400              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3401                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    3402                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    3403              
    3404              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    3405                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    3406              $C$DW$540       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3407              $C$DW$541       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3408              $C$DW$542       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3409                      .dwendtag $C$DW$T$221
    3410              
    3411              $C$DW$T$222     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3412                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    3413                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    3414              
    3415              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    3416                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    3417              $C$DW$543       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3418              $C$DW$544       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3419                      .dwendtag $C$DW$T$224
    3420              
    3421              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3422                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    3423                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    3424              
    3425              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3426                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3427                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3428              $C$DW$545       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$25)
    3430                      .dwattr $C$DW$545, DW_AT_name("ADCRESULT")
    3431                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_ADCRESULT")
    3432                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3434              $C$DW$546       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$26)
    3436                      .dwattr $C$DW$546, DW_AT_name("resvd_1")
    3437                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_resvd_1")
    3438                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3439                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$547       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$24)
    3442                      .dwattr $C$DW$547, DW_AT_name("ADCCTL1")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   69

    3443                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_ADCCTL1")
    3444                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3445                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3446              $C$DW$548       .dwtag  DW_TAG_member
    3447                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$24)
    3448                      .dwattr $C$DW$548, DW_AT_name("ADCCTL2")
    3449                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_ADCCTL2")
    3450                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3451                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3452              $C$DW$549       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$27)
    3454                      .dwattr $C$DW$549, DW_AT_name("rsvd_2")
    3455                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd_2")
    3456                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3457                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3458              $C$DW$550       .dwtag  DW_TAG_member
    3459                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$24)
    3460                      .dwattr $C$DW$550, DW_AT_name("ADCINTFLG")
    3461                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_ADCINTFLG")
    3462                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3463                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$551       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$24)
    3466                      .dwattr $C$DW$551, DW_AT_name("ADCINTFLGCLR")
    3467                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3468                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3469                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3470              $C$DW$552       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$24)
    3472                      .dwattr $C$DW$552, DW_AT_name("ADCINTOVF")
    3473                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_ADCINTOVF")
    3474                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3475                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3476              $C$DW$553       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$24)
    3478                      .dwattr $C$DW$553, DW_AT_name("ADCINTOVFCLR")
    3479                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3480                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3481                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3482              $C$DW$554       .dwtag  DW_TAG_member
    3483                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$28)
    3484                      .dwattr $C$DW$554, DW_AT_name("INTSELxNy")
    3485                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_INTSELxNy")
    3486                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3487                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3488              $C$DW$555       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$29)
    3490                      .dwattr $C$DW$555, DW_AT_name("rsvd_3")
    3491                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_rsvd_3")
    3492                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3493                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3494              $C$DW$556       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$24)
    3496                      .dwattr $C$DW$556, DW_AT_name("SOCPRICTRL")
    3497                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_SOCPRICTRL")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   70

    3498                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3499                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3500              $C$DW$557       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$24)
    3502                      .dwattr $C$DW$557, DW_AT_name("rsvd_4")
    3503                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_rsvd_4")
    3504                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    3505                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$558       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$24)
    3508                      .dwattr $C$DW$558, DW_AT_name("ADCSAMPLEMODE")
    3509                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3510                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3511                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$559       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$24)
    3514                      .dwattr $C$DW$559, DW_AT_name("rsvd_5")
    3515                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd_5")
    3516                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3517                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$560       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$24)
    3520                      .dwattr $C$DW$560, DW_AT_name("ADCINTSOCSEL1")
    3521                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3522                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3523                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$561       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$24)
    3526                      .dwattr $C$DW$561, DW_AT_name("ADCINTSOCSEL2")
    3527                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3528                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3529                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3530              $C$DW$562       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$27)
    3532                      .dwattr $C$DW$562, DW_AT_name("rsvd_6")
    3533                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_rsvd_6")
    3534                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3535                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3536              $C$DW$563       .dwtag  DW_TAG_member
    3537                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$24)
    3538                      .dwattr $C$DW$563, DW_AT_name("ADCSOCFLG1")
    3539                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3540                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3541                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3542              $C$DW$564       .dwtag  DW_TAG_member
    3543                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$24)
    3544                      .dwattr $C$DW$564, DW_AT_name("rsvd_7")
    3545                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_rsvd_7")
    3546                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3547                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3548              $C$DW$565       .dwtag  DW_TAG_member
    3549                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$24)
    3550                      .dwattr $C$DW$565, DW_AT_name("ADCSOCFRC1")
    3551                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3552                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   71

    3553                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3554              $C$DW$566       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$24)
    3556                      .dwattr $C$DW$566, DW_AT_name("rsvd_8")
    3557                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_8")
    3558                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3559                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3560              $C$DW$567       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$24)
    3562                      .dwattr $C$DW$567, DW_AT_name("ADCSOCOVF1")
    3563                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3564                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3565                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$568       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$24)
    3568                      .dwattr $C$DW$568, DW_AT_name("rsvd_9")
    3569                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_rsvd_9")
    3570                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3571                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3572              $C$DW$569       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$24)
    3574                      .dwattr $C$DW$569, DW_AT_name("ADCSOCOVFCLR1")
    3575                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3576                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3577                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3578              $C$DW$570       .dwtag  DW_TAG_member
    3579                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$24)
    3580                      .dwattr $C$DW$570, DW_AT_name("rsvd_10")
    3581                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_rsvd_10")
    3582                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3583                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$571       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$25)
    3586                      .dwattr $C$DW$571, DW_AT_name("ADCSOCxCTL")
    3587                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3588                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3589                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3590              $C$DW$572       .dwtag  DW_TAG_member
    3591                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$25)
    3592                      .dwattr $C$DW$572, DW_AT_name("rsvd_11")
    3593                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_11")
    3594                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3595                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3596              $C$DW$573       .dwtag  DW_TAG_member
    3597                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    3598                      .dwattr $C$DW$573, DW_AT_name("ADCREFTRIM")
    3599                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3600                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3601                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3602              $C$DW$574       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    3604                      .dwattr $C$DW$574, DW_AT_name("ADCOFFTRIM")
    3605                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3606                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3607                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   72

    3608              $C$DW$575       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$30)
    3610                      .dwattr $C$DW$575, DW_AT_name("resvd_12")
    3611                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_resvd_12")
    3612                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3613                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3614              $C$DW$576       .dwtag  DW_TAG_member
    3615                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    3616                      .dwattr $C$DW$576, DW_AT_name("ADCREV")
    3617                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_ADCREV")
    3618                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3619                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3620                      .dwendtag $C$DW$T$31
    3621              
    3622              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3623                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$31)
    3624                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    3625              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3626                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$31)
    3627                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3628              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3629                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3630                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3631              
    3632              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3633                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3634                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3635              $C$DW$577       .dwtag  DW_TAG_member
    3636                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$32)
    3637                      .dwattr $C$DW$577, DW_AT_name("alpha_sf")
    3638                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_alpha_sf")
    3639                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3640                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3641              $C$DW$578       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$32)
    3643                      .dwattr $C$DW$578, DW_AT_name("beta_sf")
    3644                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_beta_sf")
    3645                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3646                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3647              $C$DW$579       .dwtag  DW_TAG_member
    3648                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$33)
    3649                      .dwattr $C$DW$579, DW_AT_name("numSensors")
    3650                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_numSensors")
    3651                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3652                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3653                      .dwendtag $C$DW$T$34
    3654              
    3655              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3656                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3657                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3658              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3659                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3660                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3661              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3662                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   73

    3663                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3664              
    3665              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3666                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3667                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3668              $C$DW$580       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$24)
    3670                      .dwattr $C$DW$580, DW_AT_name("XCLK")
    3671                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_XCLK")
    3672                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3673                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$581       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$24)
    3676                      .dwattr $C$DW$581, DW_AT_name("rsvd_1")
    3677                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_rsvd_1")
    3678                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3679                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$582       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$24)
    3682                      .dwattr $C$DW$582, DW_AT_name("CLKCTL")
    3683                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_CLKCTL")
    3684                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3685                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$583       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$35)
    3688                      .dwattr $C$DW$583, DW_AT_name("rsvd_2")
    3689                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_rsvd_2")
    3690                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3691                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$584       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$24)
    3694                      .dwattr $C$DW$584, DW_AT_name("LOSPCP")
    3695                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_LOSPCP")
    3696                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3697                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3698              $C$DW$585       .dwtag  DW_TAG_member
    3699                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$24)
    3700                      .dwattr $C$DW$585, DW_AT_name("PCLKCR0")
    3701                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_PCLKCR0")
    3702                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3703                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3704              $C$DW$586       .dwtag  DW_TAG_member
    3705                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$24)
    3706                      .dwattr $C$DW$586, DW_AT_name("PCLKCR1")
    3707                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_PCLKCR1")
    3708                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3709                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3710              $C$DW$587       .dwtag  DW_TAG_member
    3711                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$27)
    3712                      .dwattr $C$DW$587, DW_AT_name("rsvd_3")
    3713                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd_3")
    3714                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3715                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3716              $C$DW$588       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   74

    3718                      .dwattr $C$DW$588, DW_AT_name("PCLKCR3")
    3719                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_PCLKCR3")
    3720                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3721                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3722                      .dwendtag $C$DW$T$36
    3723              
    3724              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    3725                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$36)
    3726                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    3727              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    3728                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    3729                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3730              
    3731              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3732                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    3733                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3734              $C$DW$589       .dwtag  DW_TAG_member
    3735                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$33)
    3736                      .dwattr $C$DW$589, DW_AT_name("tmp")
    3737                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_tmp")
    3738                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3739                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3740                      .dwendtag $C$DW$T$37
    3741              
    3742              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3743                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$37)
    3744                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3745              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    3746                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    3747                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3748              
    3749              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    3750                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    3751                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    3752              $C$DW$590       .dwtag  DW_TAG_member
    3753                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$38)
    3754                      .dwattr $C$DW$590, DW_AT_name("version")
    3755                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_version")
    3756                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3757                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$591       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$40)
    3760                      .dwattr $C$DW$591, DW_AT_name("state")
    3761                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_state")
    3762                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3763                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$592       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$40)
    3766                      .dwattr $C$DW$592, DW_AT_name("prevState")
    3767                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_prevState")
    3768                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3769                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3770              $C$DW$593       .dwtag  DW_TAG_member
    3771                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$42)
    3772                      .dwattr $C$DW$593, DW_AT_name("errorCode")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   75

    3773                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_errorCode")
    3774                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3775                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3776              $C$DW$594       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$44)
    3778                      .dwattr $C$DW$594, DW_AT_name("clarkeHandle_I")
    3779                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3780                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3781                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3782              $C$DW$595       .dwtag  DW_TAG_member
    3783                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$45)
    3784                      .dwattr $C$DW$595, DW_AT_name("clarke_I")
    3785                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_clarke_I")
    3786                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3787                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3788              $C$DW$596       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$44)
    3790                      .dwattr $C$DW$596, DW_AT_name("clarkeHandle_V")
    3791                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3792                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3793                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3794              $C$DW$597       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$45)
    3796                      .dwattr $C$DW$597, DW_AT_name("clarke_V")
    3797                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_clarke_V")
    3798                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3799                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3800              $C$DW$598       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$47)
    3802                      .dwattr $C$DW$598, DW_AT_name("estHandle")
    3803                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_estHandle")
    3804                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3805                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$599       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$49)
    3808                      .dwattr $C$DW$599, DW_AT_name("parkHandle")
    3809                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_parkHandle")
    3810                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3811                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3812              $C$DW$600       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$50)
    3814                      .dwattr $C$DW$600, DW_AT_name("park")
    3815                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_park")
    3816                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3817                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$601       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$52)
    3820                      .dwattr $C$DW$601, DW_AT_name("pidHandle_Id")
    3821                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_pidHandle_Id")
    3822                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3823                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$602       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$53)
    3826                      .dwattr $C$DW$602, DW_AT_name("pid_Id")
    3827                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_pid_Id")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   76

    3828                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3829                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3830              $C$DW$603       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$52)
    3832                      .dwattr $C$DW$603, DW_AT_name("pidHandle_Iq")
    3833                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3834                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3835                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    3836              $C$DW$604       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$53)
    3838                      .dwattr $C$DW$604, DW_AT_name("pid_Iq")
    3839                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_pid_Iq")
    3840                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3841                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3842              $C$DW$605       .dwtag  DW_TAG_member
    3843                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$52)
    3844                      .dwattr $C$DW$605, DW_AT_name("pidHandle_spd")
    3845                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_pidHandle_spd")
    3846                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3847                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3848              $C$DW$606       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$53)
    3850                      .dwattr $C$DW$606, DW_AT_name("pid_spd")
    3851                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_pid_spd")
    3852                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3853                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3854              $C$DW$607       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$55)
    3856                      .dwattr $C$DW$607, DW_AT_name("iparkHandle")
    3857                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_iparkHandle")
    3858                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3859                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3860              $C$DW$608       .dwtag  DW_TAG_member
    3861                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$56)
    3862                      .dwattr $C$DW$608, DW_AT_name("ipark")
    3863                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_ipark")
    3864                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3865                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3866              $C$DW$609       .dwtag  DW_TAG_member
    3867                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$58)
    3868                      .dwattr $C$DW$609, DW_AT_name("svgenHandle")
    3869                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_svgenHandle")
    3870                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3871                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$610       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$59)
    3874                      .dwattr $C$DW$610, DW_AT_name("svgen")
    3875                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_svgen")
    3876                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3877                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    3878              $C$DW$611       .dwtag  DW_TAG_member
    3879                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$61)
    3880                      .dwattr $C$DW$611, DW_AT_name("trajHandle_Id")
    3881                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_trajHandle_Id")
    3882                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   77

    3883                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    3884              $C$DW$612       .dwtag  DW_TAG_member
    3885                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$62)
    3886                      .dwattr $C$DW$612, DW_AT_name("traj_Id")
    3887                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_traj_Id")
    3888                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3889                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$613       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$61)
    3892                      .dwattr $C$DW$613, DW_AT_name("trajHandle_spd")
    3893                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_trajHandle_spd")
    3894                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3895                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    3896              $C$DW$614       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$62)
    3898                      .dwattr $C$DW$614, DW_AT_name("traj_spd")
    3899                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_traj_spd")
    3900                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3901                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    3902              $C$DW$615       .dwtag  DW_TAG_member
    3903                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$61)
    3904                      .dwattr $C$DW$615, DW_AT_name("trajHandle_spdMax")
    3905                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3906                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3907                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    3908              $C$DW$616       .dwtag  DW_TAG_member
    3909                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$62)
    3910                      .dwattr $C$DW$616, DW_AT_name("traj_spdMax")
    3911                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_traj_spdMax")
    3912                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3913                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    3914              $C$DW$617       .dwtag  DW_TAG_member
    3915                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$63)
    3916                      .dwattr $C$DW$617, DW_AT_name("motorParams")
    3917                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_motorParams")
    3918                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3919                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    3920              $C$DW$618       .dwtag  DW_TAG_member
    3921                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$66)
    3922                      .dwattr $C$DW$618, DW_AT_name("waitTimes")
    3923                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_waitTimes")
    3924                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3925                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    3926              $C$DW$619       .dwtag  DW_TAG_member
    3927                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$65)
    3928                      .dwattr $C$DW$619, DW_AT_name("counter_state")
    3929                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_counter_state")
    3930                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3931                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$620       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$67)
    3934                      .dwattr $C$DW$620, DW_AT_name("numIsrTicksPerCtrlTick")
    3935                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3936                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3937                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   78

    3938              $C$DW$621       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$67)
    3940                      .dwattr $C$DW$621, DW_AT_name("numCtrlTicksPerCurrentTick")
    3941                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3942                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3943                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    3944              $C$DW$622       .dwtag  DW_TAG_member
    3945                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$67)
    3946                      .dwattr $C$DW$622, DW_AT_name("numCtrlTicksPerSpeedTick")
    3947                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3948                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3949                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    3950              $C$DW$623       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$67)
    3952                      .dwattr $C$DW$623, DW_AT_name("numCtrlTicksPerTrajTick")
    3953                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3954                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3955                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$624       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$65)
    3958                      .dwattr $C$DW$624, DW_AT_name("ctrlFreq_Hz")
    3959                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3960                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3961                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$625       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$65)
    3964                      .dwattr $C$DW$625, DW_AT_name("trajFreq_Hz")
    3965                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3966                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3967                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$626       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$32)
    3970                      .dwattr $C$DW$626, DW_AT_name("trajPeriod_sec")
    3971                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3972                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3973                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$627       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$68)
    3976                      .dwattr $C$DW$627, DW_AT_name("ctrlPeriod_sec")
    3977                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3978                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3979                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$628       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$32)
    3982                      .dwattr $C$DW$628, DW_AT_name("maxVsMag_pu")
    3983                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3984                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3985                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    3986              $C$DW$629       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$69)
    3988                      .dwattr $C$DW$629, DW_AT_name("Iab_in")
    3989                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_Iab_in")
    3990                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3991                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$630       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   79

    3993                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$69)
    3994                      .dwattr $C$DW$630, DW_AT_name("Iab_filt")
    3995                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_Iab_filt")
    3996                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3997                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$631       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$69)
    4000                      .dwattr $C$DW$631, DW_AT_name("Idq_in")
    4001                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_Idq_in")
    4002                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4003                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$632       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$69)
    4006                      .dwattr $C$DW$632, DW_AT_name("Vab_in")
    4007                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_Vab_in")
    4008                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4009                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$633       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$32)
    4012                      .dwattr $C$DW$633, DW_AT_name("spd_out")
    4013                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_spd_out")
    4014                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4015                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$634       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$69)
    4018                      .dwattr $C$DW$634, DW_AT_name("Vab_out")
    4019                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_Vab_out")
    4020                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4021                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4022              $C$DW$635       .dwtag  DW_TAG_member
    4023                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$69)
    4024                      .dwattr $C$DW$635, DW_AT_name("Vdq_out")
    4025                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_Vdq_out")
    4026                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4027                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4028              $C$DW$636       .dwtag  DW_TAG_member
    4029                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$68)
    4030                      .dwattr $C$DW$636, DW_AT_name("Rhf")
    4031                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_Rhf")
    4032                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4033                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4034              $C$DW$637       .dwtag  DW_TAG_member
    4035                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$68)
    4036                      .dwattr $C$DW$637, DW_AT_name("Lhf")
    4037                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_Lhf")
    4038                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4039                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4040              $C$DW$638       .dwtag  DW_TAG_member
    4041                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$68)
    4042                      .dwattr $C$DW$638, DW_AT_name("RoverL")
    4043                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_RoverL")
    4044                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4045                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4046              $C$DW$639       .dwtag  DW_TAG_member
    4047                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   80

    4048                      .dwattr $C$DW$639, DW_AT_name("Kp_Id")
    4049                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_Kp_Id")
    4050                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4051                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4052              $C$DW$640       .dwtag  DW_TAG_member
    4053                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$32)
    4054                      .dwattr $C$DW$640, DW_AT_name("Kp_Iq")
    4055                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_Kp_Iq")
    4056                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4057                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4058              $C$DW$641       .dwtag  DW_TAG_member
    4059                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$32)
    4060                      .dwattr $C$DW$641, DW_AT_name("Kp_spd")
    4061                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_Kp_spd")
    4062                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4063                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4064              $C$DW$642       .dwtag  DW_TAG_member
    4065                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$32)
    4066                      .dwattr $C$DW$642, DW_AT_name("Ki_Id")
    4067                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_Ki_Id")
    4068                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4069                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4070              $C$DW$643       .dwtag  DW_TAG_member
    4071                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$32)
    4072                      .dwattr $C$DW$643, DW_AT_name("Ki_Iq")
    4073                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_Ki_Iq")
    4074                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4075                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4076              $C$DW$644       .dwtag  DW_TAG_member
    4077                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$32)
    4078                      .dwattr $C$DW$644, DW_AT_name("Ki_spd")
    4079                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_Ki_spd")
    4080                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4081                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$645       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$32)
    4084                      .dwattr $C$DW$645, DW_AT_name("Kd_Id")
    4085                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_Kd_Id")
    4086                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4087                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4088              $C$DW$646       .dwtag  DW_TAG_member
    4089                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$32)
    4090                      .dwattr $C$DW$646, DW_AT_name("Kd_Iq")
    4091                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Kd_Iq")
    4092                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4093                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4094              $C$DW$647       .dwtag  DW_TAG_member
    4095                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$32)
    4096                      .dwattr $C$DW$647, DW_AT_name("Kd_spd")
    4097                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Kd_spd")
    4098                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4099                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4100              $C$DW$648       .dwtag  DW_TAG_member
    4101                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$32)
    4102                      .dwattr $C$DW$648, DW_AT_name("Ui_Id")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   81

    4103                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Ui_Id")
    4104                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4105                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4106              $C$DW$649       .dwtag  DW_TAG_member
    4107                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$32)
    4108                      .dwattr $C$DW$649, DW_AT_name("Ui_Iq")
    4109                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Ui_Iq")
    4110                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4111                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4112              $C$DW$650       .dwtag  DW_TAG_member
    4113                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$32)
    4114                      .dwattr $C$DW$650, DW_AT_name("Ui_spd")
    4115                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_Ui_spd")
    4116                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4117                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4118              $C$DW$651       .dwtag  DW_TAG_member
    4119                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$69)
    4120                      .dwattr $C$DW$651, DW_AT_name("Idq_ref")
    4121                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Idq_ref")
    4122                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4123                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$652       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$32)
    4126                      .dwattr $C$DW$652, DW_AT_name("IdRated")
    4127                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_IdRated")
    4128                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4129                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4130              $C$DW$653       .dwtag  DW_TAG_member
    4131                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$32)
    4132                      .dwattr $C$DW$653, DW_AT_name("spd_ref")
    4133                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_spd_ref")
    4134                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4135                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4136              $C$DW$654       .dwtag  DW_TAG_member
    4137                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$32)
    4138                      .dwattr $C$DW$654, DW_AT_name("spd_max")
    4139                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_spd_max")
    4140                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4141                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4142              $C$DW$655       .dwtag  DW_TAG_member
    4143                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$67)
    4144                      .dwattr $C$DW$655, DW_AT_name("counter_current")
    4145                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_counter_current")
    4146                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4147                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4148              $C$DW$656       .dwtag  DW_TAG_member
    4149                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$67)
    4150                      .dwattr $C$DW$656, DW_AT_name("counter_isr")
    4151                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_counter_isr")
    4152                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4153                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4154              $C$DW$657       .dwtag  DW_TAG_member
    4155                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$67)
    4156                      .dwattr $C$DW$657, DW_AT_name("counter_speed")
    4157                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_counter_speed")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   82

    4158                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4159                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4160              $C$DW$658       .dwtag  DW_TAG_member
    4161                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$67)
    4162                      .dwattr $C$DW$658, DW_AT_name("counter_traj")
    4163                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_counter_traj")
    4164                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4165                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$659       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$70)
    4168                      .dwattr $C$DW$659, DW_AT_name("flag_enableCtrl")
    4169                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4170                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4171                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$660       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$70)
    4174                      .dwattr $C$DW$660, DW_AT_name("flag_enableDcBusComp")
    4175                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4176                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4177                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4178              $C$DW$661       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$70)
    4180                      .dwattr $C$DW$661, DW_AT_name("flag_enablePowerWarp")
    4181                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4182                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4183                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$662       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$70)
    4186                      .dwattr $C$DW$662, DW_AT_name("flag_enableOffset")
    4187                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_flag_enableOffset")
    4188                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4189                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$663       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$70)
    4192                      .dwattr $C$DW$663, DW_AT_name("flag_enableSpeedCtrl")
    4193                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4194                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4195                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$664       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$70)
    4198                      .dwattr $C$DW$664, DW_AT_name("flag_enableUserMotorParams")
    4199                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4200                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4201                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$665       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$69)
    4204                      .dwattr $C$DW$665, DW_AT_name("Idq_offset_pu")
    4205                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4206                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4207                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$666       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$69)
    4210                      .dwattr $C$DW$666, DW_AT_name("Vdq_offset_pu")
    4211                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4212                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   83

    4213                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4214              $C$DW$667       .dwtag  DW_TAG_member
    4215                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$32)
    4216                      .dwattr $C$DW$667, DW_AT_name("angle_pu")
    4217                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_angle_pu")
    4218                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4219                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4220              $C$DW$668       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$32)
    4222                      .dwattr $C$DW$668, DW_AT_name("speed_ref_pu")
    4223                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_speed_ref_pu")
    4224                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4225                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$669       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$32)
    4228                      .dwattr $C$DW$669, DW_AT_name("speed_fb_pu")
    4229                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_speed_fb_pu")
    4230                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4231                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$670       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$32)
    4234                      .dwattr $C$DW$670, DW_AT_name("speed_outMax_pu")
    4235                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4236                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4237                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$671       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$70)
    4240                      .dwattr $C$DW$671, DW_AT_name("flag_enableCurrentCtrl")
    4241                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4242                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4243                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4244                      .dwendtag $C$DW$T$71
    4245              
    4246              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4247                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$71)
    4248                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    4249              $C$DW$T$229     .dwtag  DW_TAG_pointer_type
    4250                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$228)
    4251                      .dwattr $C$DW$T$229, DW_AT_address_class(0x20)
    4252              $C$DW$T$199     .dwtag  DW_TAG_pointer_type
    4253                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$71)
    4254                      .dwattr $C$DW$T$199, DW_AT_address_class(0x20)
    4255              $C$DW$T$200     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4256                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    4257                      .dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
    4258              $C$DW$672       .dwtag  DW_TAG_TI_far_type
    4259                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$200)
    4260              $C$DW$T$230     .dwtag  DW_TAG_const_type
    4261                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$672)
    4262              
    4263              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4264                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4265                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4266              $C$DW$673       .dwtag  DW_TAG_member
    4267                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   84

    4268                      .dwattr $C$DW$673, DW_AT_name("rsvd")
    4269                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_rsvd")
    4270                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4271                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4272              $C$DW$674       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$73)
    4274                      .dwattr $C$DW$674, DW_AT_name("targetProc")
    4275                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_targetProc")
    4276                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4277                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4278              $C$DW$675       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    4280                      .dwattr $C$DW$675, DW_AT_name("major")
    4281                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_major")
    4282                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4283                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4284              $C$DW$676       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    4286                      .dwattr $C$DW$676, DW_AT_name("minor")
    4287                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_minor")
    4288                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4289                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4290                      .dwendtag $C$DW$T$74
    4291              
    4292              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4293                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    4294                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4295              $C$DW$T$238     .dwtag  DW_TAG_pointer_type
    4296                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$T$38)
    4297                      .dwattr $C$DW$T$238, DW_AT_address_class(0x20)
    4298              
    4299              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4300                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8301_Obj_")
    4301                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    4302              $C$DW$677       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$76)
    4304                      .dwattr $C$DW$677, DW_AT_name("spiHandle")
    4305                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_spiHandle")
    4306                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4307                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$678       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$78)
    4310                      .dwattr $C$DW$678, DW_AT_name("gpioHandle")
    4311                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_gpioHandle")
    4312                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4313                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$679       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$80)
    4316                      .dwattr $C$DW$679, DW_AT_name("gpioNumber")
    4317                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_gpioNumber")
    4318                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4319                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$680       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$70)
    4322                      .dwattr $C$DW$680, DW_AT_name("RxTimeOut")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   85

    4323                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_RxTimeOut")
    4324                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4325                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$681       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    4328                      .dwattr $C$DW$681, DW_AT_name("enableTimeOut")
    4329                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_enableTimeOut")
    4330                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4331                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4332                      .dwendtag $C$DW$T$81
    4333              
    4334              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    4335                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$81)
    4336                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    4337              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    4338                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$81)
    4339                      .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    4340              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    4341                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    4342                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4343              
    4344              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    4345                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4346                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x05)
    4347              $C$DW$682       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$83)
    4349                      .dwattr $C$DW$682, DW_AT_name("DRV8301_CURRENT")
    4350                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4351                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4352                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$683       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$85)
    4355                      .dwattr $C$DW$683, DW_AT_name("DRV8301_RESET")
    4356                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4357                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4358                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$684       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$87)
    4361                      .dwattr $C$DW$684, DW_AT_name("PWM_MODE")
    4362                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_PWM_MODE")
    4363                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4364                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$685       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$89)
    4367                      .dwattr $C$DW$685, DW_AT_name("OC_MODE")
    4368                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_OC_MODE")
    4369                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4370                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$686       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$91)
    4373                      .dwattr $C$DW$686, DW_AT_name("OC_ADJ_SET")
    4374                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4375                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4376                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4377                      .dwendtag $C$DW$T$92
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   86

    4378              
    4379              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4380                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$92)
    4381                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    4382              
    4383              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    4384                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    4385                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x04)
    4386              $C$DW$687       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$94)
    4388                      .dwattr $C$DW$687, DW_AT_name("OCTW_SET")
    4389                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_OCTW_SET")
    4390                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4391                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$688       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$96)
    4394                      .dwattr $C$DW$688, DW_AT_name("GAIN")
    4395                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_GAIN")
    4396                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4397                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$689       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$98)
    4400                      .dwattr $C$DW$689, DW_AT_name("DC_CAL_CH1p2")
    4401                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4402                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4403                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$690       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$100)
    4406                      .dwattr $C$DW$690, DW_AT_name("OC_TOFF")
    4407                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_OC_TOFF")
    4408                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4409                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4410                      .dwendtag $C$DW$T$101
    4411              
    4412              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4413                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$101)
    4414                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4415              
    4416              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    4417                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4418                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x0b)
    4419              $C$DW$691       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$70)
    4421                      .dwattr $C$DW$691, DW_AT_name("FAULT")
    4422                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_FAULT")
    4423                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4424                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$692       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$70)
    4427                      .dwattr $C$DW$692, DW_AT_name("GVDD_UV")
    4428                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_GVDD_UV")
    4429                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4430                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$693       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$70)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   87

    4433                      .dwattr $C$DW$693, DW_AT_name("PVDD_UV")
    4434                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_PVDD_UV")
    4435                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4436                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$694       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$70)
    4439                      .dwattr $C$DW$694, DW_AT_name("OTSD")
    4440                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_OTSD")
    4441                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4442                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$695       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$70)
    4445                      .dwattr $C$DW$695, DW_AT_name("OTW")
    4446                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_OTW")
    4447                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4448                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$696       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$70)
    4451                      .dwattr $C$DW$696, DW_AT_name("FETHA_OC")
    4452                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_FETHA_OC")
    4453                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4454                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$697       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$70)
    4457                      .dwattr $C$DW$697, DW_AT_name("FETLA_OC")
    4458                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_FETLA_OC")
    4459                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4460                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$698       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$70)
    4463                      .dwattr $C$DW$698, DW_AT_name("FETHB_OC")
    4464                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_FETHB_OC")
    4465                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4466                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$699       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$70)
    4469                      .dwattr $C$DW$699, DW_AT_name("FETLB_OC")
    4470                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_FETLB_OC")
    4471                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4472                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$700       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$70)
    4475                      .dwattr $C$DW$700, DW_AT_name("FETHC_OC")
    4476                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_FETHC_OC")
    4477                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4478                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$701       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$70)
    4481                      .dwattr $C$DW$701, DW_AT_name("FETLC_OC")
    4482                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_FETLC_OC")
    4483                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4484                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4485                      .dwendtag $C$DW$T$102
    4486              
    4487              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   88

    4488                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$102)
    4489                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4490              
    4491              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    4492                      .dwattr $C$DW$T$103, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4493                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    4494              $C$DW$702       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$70)
    4496                      .dwattr $C$DW$702, DW_AT_name("GVDD_OV")
    4497                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_GVDD_OV")
    4498                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4499                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$703       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    4502                      .dwattr $C$DW$703, DW_AT_name("DeviceID")
    4503                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_DeviceID")
    4504                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4505                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4506                      .dwendtag $C$DW$T$103
    4507              
    4508              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4509                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$103)
    4510                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4511              
    4512              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    4513                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4514                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x18)
    4515              $C$DW$704       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$104)
    4517                      .dwattr $C$DW$704, DW_AT_name("Stat_Reg_1")
    4518                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4519                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4520                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$705       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$105)
    4523                      .dwattr $C$DW$705, DW_AT_name("Stat_Reg_2")
    4524                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4525                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4526                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$706       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$106)
    4529                      .dwattr $C$DW$706, DW_AT_name("Ctrl_Reg_1")
    4530                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4531                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4532                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4533              $C$DW$707       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$107)
    4535                      .dwattr $C$DW$707, DW_AT_name("Ctrl_Reg_2")
    4536                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4537                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4538                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4539              $C$DW$708       .dwtag  DW_TAG_member
    4540                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$70)
    4541                      .dwattr $C$DW$708, DW_AT_name("SndCmd")
    4542                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_SndCmd")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:26:04 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3596410                            PAGE   89

    4543                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4544                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4545              $C$DW$709       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$70)
    4547                      .dwattr $C$DW$709, DW_AT_name("RcvCmd")
    4548                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_RcvCmd")
    4549                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4550                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4551                      .dwendtag $C$DW$T$108
    4552              
    4553              $C$DW$T$241     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    4554                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$108)
    4555                      .dwattr $C$DW$T$241, DW_AT_language(DW_LANG_C)
    4556              $C$DW$T$242     .dwtag  DW_TAG_pointer_type
    4557                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$241)
    4558                      .dwattr $C$DW$T$242, DW_AT_address_class(0x20)
    4559              
    4560              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4561                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4562                      .dwattr $C$DW$T$19, DW_AT_declaration
    4563                      .dwendtag $C$DW$T$19
    4564              
    4565              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4566                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$19)
    4567                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4568              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
