TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Sat Nov 26 18:11:58 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("WDOG_disable")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_WDOG_disable")

   10798              $C$DW$1846      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
   10799              $C$DW$1847      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
   10800                      .dwendtag $C$DW$T$332
   10801              
   10802              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
   10803                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$332)
   10804                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10805              $C$DW$1848      .dwtag  DW_TAG_TI_far_type
   10806                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$333)
   10807              $C$DW$T$334     .dwtag  DW_TAG_const_type
   10808                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$1848)
   10809              
   10810              $C$DW$T$335     .dwtag  DW_TAG_enumeration_type
   10811                      .dwattr $C$DW$T$335, DW_AT_byte_size(0x01)
   10812              $C$DW$1849      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
   10813              $C$DW$1850      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
   10814              $C$DW$1851      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
   10815                      .dwendtag $C$DW$T$335
   10816              
   10817              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
   10818                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
   10819                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  208

   10820              $C$DW$1852      .dwtag  DW_TAG_TI_far_type
   10821                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$336)
   10822              $C$DW$T$337     .dwtag  DW_TAG_const_type
   10823                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$1852)
   10824              
   10825              $C$DW$T$338     .dwtag  DW_TAG_enumeration_type
   10826                      .dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
   10827              $C$DW$1853      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
   10828              $C$DW$1854      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
   10829              $C$DW$1855      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
   10830                      .dwendtag $C$DW$T$338
   10831              
   10832              $C$DW$T$339     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
   10833                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
   10834                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   10835              $C$DW$1856      .dwtag  DW_TAG_TI_far_type
   10836                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$339)
   10837              $C$DW$T$340     .dwtag  DW_TAG_const_type
   10838                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$1856)
   10839              
   10840              $C$DW$T$341     .dwtag  DW_TAG_enumeration_type
   10841                      .dwattr $C$DW$T$341, DW_AT_byte_size(0x01)
   10842              $C$DW$1857      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
   10843              $C$DW$1858      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
   10844              $C$DW$1859      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
   10845              $C$DW$1860      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
   10846              $C$DW$1861      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
   10847              $C$DW$1862      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
   10848              $C$DW$1863      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
   10849                      .dwendtag $C$DW$T$341
   10850              
   10851              $C$DW$T$342     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
   10852                      .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
   10853                      .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
   10854              
   10855              $C$DW$T$343     .dwtag  DW_TAG_enumeration_type
   10856                      .dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
   10857              $C$DW$1864      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10858              $C$DW$1865      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10859                      .dwendtag $C$DW$T$343
   10860              
   10861              $C$DW$T$344     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10862                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
   10863                      .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   10864              
   10865              $C$DW$T$30      .dwtag  DW_TAG_structure_type
   10866                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10867                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10868              $C$DW$1866      .dwtag  DW_TAG_member
   10869                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$24)
   10870                      .dwattr $C$DW$1866, DW_AT_name("ADCRESULT")
   10871                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_ADCRESULT")
   10872                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10873                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10874              $C$DW$1867      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  209

   10875                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$25)
   10876                      .dwattr $C$DW$1867, DW_AT_name("resvd_1")
   10877                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_resvd_1")
   10878                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10879                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10880              $C$DW$1868      .dwtag  DW_TAG_member
   10881                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10882                      .dwattr $C$DW$1868, DW_AT_name("ADCCTL1")
   10883                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ADCCTL1")
   10884                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10885                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10886              $C$DW$1869      .dwtag  DW_TAG_member
   10887                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   10888                      .dwattr $C$DW$1869, DW_AT_name("ADCCTL2")
   10889                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_ADCCTL2")
   10890                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10891                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10892              $C$DW$1870      .dwtag  DW_TAG_member
   10893                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$26)
   10894                      .dwattr $C$DW$1870, DW_AT_name("rsvd_2")
   10895                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_rsvd_2")
   10896                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10897                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10898              $C$DW$1871      .dwtag  DW_TAG_member
   10899                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10900                      .dwattr $C$DW$1871, DW_AT_name("ADCINTFLG")
   10901                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_ADCINTFLG")
   10902                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10903                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10904              $C$DW$1872      .dwtag  DW_TAG_member
   10905                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$23)
   10906                      .dwattr $C$DW$1872, DW_AT_name("ADCINTFLGCLR")
   10907                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10908                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10909                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10910              $C$DW$1873      .dwtag  DW_TAG_member
   10911                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$23)
   10912                      .dwattr $C$DW$1873, DW_AT_name("ADCINTOVF")
   10913                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_ADCINTOVF")
   10914                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10915                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10916              $C$DW$1874      .dwtag  DW_TAG_member
   10917                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$23)
   10918                      .dwattr $C$DW$1874, DW_AT_name("ADCINTOVFCLR")
   10919                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10920                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   10921                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10922              $C$DW$1875      .dwtag  DW_TAG_member
   10923                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$27)
   10924                      .dwattr $C$DW$1875, DW_AT_name("INTSELxNy")
   10925                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_INTSELxNy")
   10926                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10927                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10928              $C$DW$1876      .dwtag  DW_TAG_member
   10929                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  210

   10930                      .dwattr $C$DW$1876, DW_AT_name("rsvd_3")
   10931                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_rsvd_3")
   10932                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10933                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10934              $C$DW$1877      .dwtag  DW_TAG_member
   10935                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$23)
   10936                      .dwattr $C$DW$1877, DW_AT_name("SOCPRICTRL")
   10937                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10938                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10939                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10940              $C$DW$1878      .dwtag  DW_TAG_member
   10941                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10942                      .dwattr $C$DW$1878, DW_AT_name("rsvd_4")
   10943                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_rsvd_4")
   10944                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10945                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10946              $C$DW$1879      .dwtag  DW_TAG_member
   10947                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10948                      .dwattr $C$DW$1879, DW_AT_name("ADCSAMPLEMODE")
   10949                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10950                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10951                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10952              $C$DW$1880      .dwtag  DW_TAG_member
   10953                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$23)
   10954                      .dwattr $C$DW$1880, DW_AT_name("rsvd_5")
   10955                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_rsvd_5")
   10956                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10957                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10958              $C$DW$1881      .dwtag  DW_TAG_member
   10959                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$23)
   10960                      .dwattr $C$DW$1881, DW_AT_name("ADCINTSOCSEL1")
   10961                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10962                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10963                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10964              $C$DW$1882      .dwtag  DW_TAG_member
   10965                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$23)
   10966                      .dwattr $C$DW$1882, DW_AT_name("ADCINTSOCSEL2")
   10967                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10968                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10969                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10970              $C$DW$1883      .dwtag  DW_TAG_member
   10971                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$26)
   10972                      .dwattr $C$DW$1883, DW_AT_name("rsvd_6")
   10973                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_rsvd_6")
   10974                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10975                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10976              $C$DW$1884      .dwtag  DW_TAG_member
   10977                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$23)
   10978                      .dwattr $C$DW$1884, DW_AT_name("ADCSOCFLG1")
   10979                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10980                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10981                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10982              $C$DW$1885      .dwtag  DW_TAG_member
   10983                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$23)
   10984                      .dwattr $C$DW$1885, DW_AT_name("rsvd_7")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  211

   10985                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_7")
   10986                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10987                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10988              $C$DW$1886      .dwtag  DW_TAG_member
   10989                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$23)
   10990                      .dwattr $C$DW$1886, DW_AT_name("ADCSOCFRC1")
   10991                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   10992                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   10993                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10994              $C$DW$1887      .dwtag  DW_TAG_member
   10995                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$23)
   10996                      .dwattr $C$DW$1887, DW_AT_name("rsvd_8")
   10997                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_8")
   10998                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   10999                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   11000              $C$DW$1888      .dwtag  DW_TAG_member
   11001                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$23)
   11002                      .dwattr $C$DW$1888, DW_AT_name("ADCSOCOVF1")
   11003                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   11004                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   11005                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   11006              $C$DW$1889      .dwtag  DW_TAG_member
   11007                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$23)
   11008                      .dwattr $C$DW$1889, DW_AT_name("rsvd_9")
   11009                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_rsvd_9")
   11010                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   11011                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   11012              $C$DW$1890      .dwtag  DW_TAG_member
   11013                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$23)
   11014                      .dwattr $C$DW$1890, DW_AT_name("ADCSOCOVFCLR1")
   11015                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   11016                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   11017                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   11018              $C$DW$1891      .dwtag  DW_TAG_member
   11019                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$23)
   11020                      .dwattr $C$DW$1891, DW_AT_name("rsvd_10")
   11021                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_rsvd_10")
   11022                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   11023                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   11024              $C$DW$1892      .dwtag  DW_TAG_member
   11025                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$24)
   11026                      .dwattr $C$DW$1892, DW_AT_name("ADCSOCxCTL")
   11027                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   11028                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   11029                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   11030              $C$DW$1893      .dwtag  DW_TAG_member
   11031                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$24)
   11032                      .dwattr $C$DW$1893, DW_AT_name("rsvd_11")
   11033                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_11")
   11034                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   11035                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   11036              $C$DW$1894      .dwtag  DW_TAG_member
   11037                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$23)
   11038                      .dwattr $C$DW$1894, DW_AT_name("ADCREFTRIM")
   11039                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_ADCREFTRIM")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  212

   11040                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   11041                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   11042              $C$DW$1895      .dwtag  DW_TAG_member
   11043                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$23)
   11044                      .dwattr $C$DW$1895, DW_AT_name("ADCOFFTRIM")
   11045                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   11046                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   11047                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   11048              $C$DW$1896      .dwtag  DW_TAG_member
   11049                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$29)
   11050                      .dwattr $C$DW$1896, DW_AT_name("resvd_12")
   11051                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_resvd_12")
   11052                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   11053                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   11054              $C$DW$1897      .dwtag  DW_TAG_member
   11055                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$23)
   11056                      .dwattr $C$DW$1897, DW_AT_name("ADCREV")
   11057                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_ADCREV")
   11058                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   11059                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   11060                      .dwendtag $C$DW$T$30
   11061              
   11062              $C$DW$T$346     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   11063                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$30)
   11064                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   11065              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   11066                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$30)
   11067                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   11068              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   11069                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   11070                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   11071              
   11072              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   11073                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   11074                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   11075              $C$DW$1898      .dwtag  DW_TAG_member
   11076                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$23)
   11077                      .dwattr $C$DW$1898, DW_AT_name("XCLK")
   11078                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_XCLK")
   11079                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11080                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   11081              $C$DW$1899      .dwtag  DW_TAG_member
   11082                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$23)
   11083                      .dwattr $C$DW$1899, DW_AT_name("rsvd_1")
   11084                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_rsvd_1")
   11085                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11086                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   11087              $C$DW$1900      .dwtag  DW_TAG_member
   11088                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$23)
   11089                      .dwattr $C$DW$1900, DW_AT_name("CLKCTL")
   11090                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_CLKCTL")
   11091                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11092                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   11093              $C$DW$1901      .dwtag  DW_TAG_member
   11094                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  213

   11095                      .dwattr $C$DW$1901, DW_AT_name("rsvd_2")
   11096                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_2")
   11097                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11098                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   11099              $C$DW$1902      .dwtag  DW_TAG_member
   11100                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$23)
   11101                      .dwattr $C$DW$1902, DW_AT_name("LOSPCP")
   11102                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_LOSPCP")
   11103                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11104                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   11105              $C$DW$1903      .dwtag  DW_TAG_member
   11106                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$23)
   11107                      .dwattr $C$DW$1903, DW_AT_name("PCLKCR0")
   11108                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_PCLKCR0")
   11109                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11110                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   11111              $C$DW$1904      .dwtag  DW_TAG_member
   11112                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$23)
   11113                      .dwattr $C$DW$1904, DW_AT_name("PCLKCR1")
   11114                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_PCLKCR1")
   11115                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11116                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   11117              $C$DW$1905      .dwtag  DW_TAG_member
   11118                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$26)
   11119                      .dwattr $C$DW$1905, DW_AT_name("rsvd_3")
   11120                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_rsvd_3")
   11121                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11122                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   11123              $C$DW$1906      .dwtag  DW_TAG_member
   11124                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$23)
   11125                      .dwattr $C$DW$1906, DW_AT_name("PCLKCR3")
   11126                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_PCLKCR3")
   11127                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11128                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   11129                      .dwendtag $C$DW$T$32
   11130              
   11131              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   11132                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$32)
   11133                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   11134              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   11135                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   11136                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   11137              
   11138              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   11139                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   11140                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
   11141              $C$DW$1907      .dwtag  DW_TAG_member
   11142                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$33)
   11143                      .dwattr $C$DW$1907, DW_AT_name("tmp")
   11144                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_tmp")
   11145                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11146                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   11147                      .dwendtag $C$DW$T$34
   11148              
   11149              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  214

   11150                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$34)
   11151                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11152              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
   11153                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$34)
   11154                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
   11155              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   11156                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   11157                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   11158              
   11159              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11160                      .dwattr $C$DW$T$37, DW_AT_name("_CTRL_Version_")
   11161                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
   11162              $C$DW$1908      .dwtag  DW_TAG_member
   11163                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$22)
   11164                      .dwattr $C$DW$1908, DW_AT_name("rsvd")
   11165                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_rsvd")
   11166                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11167                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   11168              $C$DW$1909      .dwtag  DW_TAG_member
   11169                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$36)
   11170                      .dwattr $C$DW$1909, DW_AT_name("targetProc")
   11171                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_targetProc")
   11172                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11173                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   11174              $C$DW$1910      .dwtag  DW_TAG_member
   11175                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$22)
   11176                      .dwattr $C$DW$1910, DW_AT_name("major")
   11177                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_major")
   11178                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11179                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   11180              $C$DW$1911      .dwtag  DW_TAG_member
   11181                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$22)
   11182                      .dwattr $C$DW$1911, DW_AT_name("minor")
   11183                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_minor")
   11184                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11185                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   11186                      .dwendtag $C$DW$T$37
   11187              
   11188              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
   11189                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$37)
   11190                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   11191              
   11192              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   11193                      .dwattr $C$DW$T$45, DW_AT_name("_DRV8301_Obj_")
   11194                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
   11195              $C$DW$1912      .dwtag  DW_TAG_member
   11196                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   11197                      .dwattr $C$DW$1912, DW_AT_name("spiHandle")
   11198                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_spiHandle")
   11199                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11200                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   11201              $C$DW$1913      .dwtag  DW_TAG_member
   11202                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$41)
   11203                      .dwattr $C$DW$1913, DW_AT_name("gpioHandle")
   11204                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_gpioHandle")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  215

   11205                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11206                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   11207              $C$DW$1914      .dwtag  DW_TAG_member
   11208                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$43)
   11209                      .dwattr $C$DW$1914, DW_AT_name("gpioNumber")
   11210                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_gpioNumber")
   11211                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11212                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   11213              $C$DW$1915      .dwtag  DW_TAG_member
   11214                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$44)
   11215                      .dwattr $C$DW$1915, DW_AT_name("RxTimeOut")
   11216                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_RxTimeOut")
   11217                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11218                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   11219              $C$DW$1916      .dwtag  DW_TAG_member
   11220                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$44)
   11221                      .dwattr $C$DW$1916, DW_AT_name("enableTimeOut")
   11222                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_enableTimeOut")
   11223                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11224                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   11225                      .dwendtag $C$DW$T$45
   11226              
   11227              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   11228                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$45)
   11229                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   11230              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
   11231                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$45)
   11232                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
   11233              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   11234                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
   11235                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   11236              
   11237              $C$DW$T$56      .dwtag  DW_TAG_structure_type
   11238                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   11239                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
   11240              $C$DW$1917      .dwtag  DW_TAG_member
   11241                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$47)
   11242                      .dwattr $C$DW$1917, DW_AT_name("DRV8301_CURRENT")
   11243                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   11244                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11245                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   11246              $C$DW$1918      .dwtag  DW_TAG_member
   11247                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$49)
   11248                      .dwattr $C$DW$1918, DW_AT_name("DRV8301_RESET")
   11249                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_DRV8301_RESET")
   11250                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11251                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   11252              $C$DW$1919      .dwtag  DW_TAG_member
   11253                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$51)
   11254                      .dwattr $C$DW$1919, DW_AT_name("PWM_MODE")
   11255                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_PWM_MODE")
   11256                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11257                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   11258              $C$DW$1920      .dwtag  DW_TAG_member
   11259                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  216

   11260                      .dwattr $C$DW$1920, DW_AT_name("OC_MODE")
   11261                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_OC_MODE")
   11262                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11263                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   11264              $C$DW$1921      .dwtag  DW_TAG_member
   11265                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$55)
   11266                      .dwattr $C$DW$1921, DW_AT_name("OC_ADJ_SET")
   11267                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   11268                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11269                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   11270                      .dwendtag $C$DW$T$56
   11271              
   11272              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   11273                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$56)
   11274                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   11275              
   11276              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   11277                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   11278                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
   11279              $C$DW$1922      .dwtag  DW_TAG_member
   11280                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$58)
   11281                      .dwattr $C$DW$1922, DW_AT_name("OCTW_SET")
   11282                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_OCTW_SET")
   11283                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11284                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   11285              $C$DW$1923      .dwtag  DW_TAG_member
   11286                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$60)
   11287                      .dwattr $C$DW$1923, DW_AT_name("GAIN")
   11288                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_GAIN")
   11289                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11290                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   11291              $C$DW$1924      .dwtag  DW_TAG_member
   11292                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$62)
   11293                      .dwattr $C$DW$1924, DW_AT_name("DC_CAL_CH1p2")
   11294                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   11295                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11296                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   11297              $C$DW$1925      .dwtag  DW_TAG_member
   11298                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$64)
   11299                      .dwattr $C$DW$1925, DW_AT_name("OC_TOFF")
   11300                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_OC_TOFF")
   11301                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11302                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   11303                      .dwendtag $C$DW$T$65
   11304              
   11305              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
   11306                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$65)
   11307                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
   11308              
   11309              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   11310                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   11311                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0b)
   11312              $C$DW$1926      .dwtag  DW_TAG_member
   11313                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$44)
   11314                      .dwattr $C$DW$1926, DW_AT_name("FAULT")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  217

   11315                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_FAULT")
   11316                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11317                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   11318              $C$DW$1927      .dwtag  DW_TAG_member
   11319                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$44)
   11320                      .dwattr $C$DW$1927, DW_AT_name("GVDD_UV")
   11321                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_GVDD_UV")
   11322                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11323                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   11324              $C$DW$1928      .dwtag  DW_TAG_member
   11325                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$44)
   11326                      .dwattr $C$DW$1928, DW_AT_name("PVDD_UV")
   11327                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_PVDD_UV")
   11328                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11329                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   11330              $C$DW$1929      .dwtag  DW_TAG_member
   11331                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$44)
   11332                      .dwattr $C$DW$1929, DW_AT_name("OTSD")
   11333                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_OTSD")
   11334                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11335                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   11336              $C$DW$1930      .dwtag  DW_TAG_member
   11337                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$44)
   11338                      .dwattr $C$DW$1930, DW_AT_name("OTW")
   11339                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_OTW")
   11340                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11341                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   11342              $C$DW$1931      .dwtag  DW_TAG_member
   11343                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$44)
   11344                      .dwattr $C$DW$1931, DW_AT_name("FETHA_OC")
   11345                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_FETHA_OC")
   11346                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11347                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   11348              $C$DW$1932      .dwtag  DW_TAG_member
   11349                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$44)
   11350                      .dwattr $C$DW$1932, DW_AT_name("FETLA_OC")
   11351                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_FETLA_OC")
   11352                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11353                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   11354              $C$DW$1933      .dwtag  DW_TAG_member
   11355                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$44)
   11356                      .dwattr $C$DW$1933, DW_AT_name("FETHB_OC")
   11357                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_FETHB_OC")
   11358                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11359                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   11360              $C$DW$1934      .dwtag  DW_TAG_member
   11361                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$44)
   11362                      .dwattr $C$DW$1934, DW_AT_name("FETLB_OC")
   11363                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_FETLB_OC")
   11364                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11365                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   11366              $C$DW$1935      .dwtag  DW_TAG_member
   11367                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$44)
   11368                      .dwattr $C$DW$1935, DW_AT_name("FETHC_OC")
   11369                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_FETHC_OC")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  218

   11370                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11371                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   11372              $C$DW$1936      .dwtag  DW_TAG_member
   11373                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$44)
   11374                      .dwattr $C$DW$1936, DW_AT_name("FETLC_OC")
   11375                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_FETLC_OC")
   11376                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11377                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   11378                      .dwendtag $C$DW$T$66
   11379              
   11380              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   11381                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
   11382                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   11383              
   11384              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   11385                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   11386                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
   11387              $C$DW$1937      .dwtag  DW_TAG_member
   11388                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$44)
   11389                      .dwattr $C$DW$1937, DW_AT_name("GVDD_OV")
   11390                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_GVDD_OV")
   11391                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11392                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   11393              $C$DW$1938      .dwtag  DW_TAG_member
   11394                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$22)
   11395                      .dwattr $C$DW$1938, DW_AT_name("DeviceID")
   11396                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_DeviceID")
   11397                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11398                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   11399                      .dwendtag $C$DW$T$67
   11400              
   11401              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   11402                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
   11403                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   11404              
   11405              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   11406                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   11407                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
   11408              $C$DW$1939      .dwtag  DW_TAG_member
   11409                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$68)
   11410                      .dwattr $C$DW$1939, DW_AT_name("Stat_Reg_1")
   11411                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_Stat_Reg_1")
   11412                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11413                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   11414              $C$DW$1940      .dwtag  DW_TAG_member
   11415                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$69)
   11416                      .dwattr $C$DW$1940, DW_AT_name("Stat_Reg_2")
   11417                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_Stat_Reg_2")
   11418                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11419                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11420              $C$DW$1941      .dwtag  DW_TAG_member
   11421                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$70)
   11422                      .dwattr $C$DW$1941, DW_AT_name("Ctrl_Reg_1")
   11423                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   11424                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  219

   11425                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11426              $C$DW$1942      .dwtag  DW_TAG_member
   11427                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$71)
   11428                      .dwattr $C$DW$1942, DW_AT_name("Ctrl_Reg_2")
   11429                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   11430                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11431                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   11432              $C$DW$1943      .dwtag  DW_TAG_member
   11433                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$44)
   11434                      .dwattr $C$DW$1943, DW_AT_name("SndCmd")
   11435                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_SndCmd")
   11436                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11437                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11438              $C$DW$1944      .dwtag  DW_TAG_member
   11439                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$44)
   11440                      .dwattr $C$DW$1944, DW_AT_name("RcvCmd")
   11441                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_RcvCmd")
   11442                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   11443                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11444                      .dwendtag $C$DW$T$72
   11445              
   11446              $C$DW$T$362     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   11447                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$72)
   11448                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   11449              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   11450                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   11451                      .dwattr $C$DW$T$363, DW_AT_address_class(0x20)
   11452              
   11453              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   11454                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
   11455                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
   11456              $C$DW$1945      .dwtag  DW_TAG_member
   11457                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$73)
   11458                      .dwattr $C$DW$1945, DW_AT_name("a1")
   11459                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_a1")
   11460                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11461                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11462              $C$DW$1946      .dwtag  DW_TAG_member
   11463                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$73)
   11464                      .dwattr $C$DW$1946, DW_AT_name("b0")
   11465                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_b0")
   11466                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11467                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11468              $C$DW$1947      .dwtag  DW_TAG_member
   11469                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$73)
   11470                      .dwattr $C$DW$1947, DW_AT_name("b1")
   11471                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_b1")
   11472                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11473                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11474              $C$DW$1948      .dwtag  DW_TAG_member
   11475                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$73)
   11476                      .dwattr $C$DW$1948, DW_AT_name("x1")
   11477                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_x1")
   11478                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11479                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  220

   11480              $C$DW$1949      .dwtag  DW_TAG_member
   11481                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$73)
   11482                      .dwattr $C$DW$1949, DW_AT_name("y1")
   11483                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_y1")
   11484                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11485                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11486                      .dwendtag $C$DW$T$74
   11487              
   11488              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   11489                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$74)
   11490                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   11491              
   11492              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   11493                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   11494                      .dwattr $C$DW$T$19, DW_AT_declaration
   11495                      .dwendtag $C$DW$T$19
   11496              
   11497              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
   11498                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
   11499                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
   11500              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   11501                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
   11502                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
   11503              
   11504              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   11505                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
   11506                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
   11507              $C$DW$1950      .dwtag  DW_TAG_member
   11508                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$23)
   11509                      .dwattr $C$DW$1950, DW_AT_name("FOPT")
   11510                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_FOPT")
   11511                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11512                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11513              $C$DW$1951      .dwtag  DW_TAG_member
   11514                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$23)
   11515                      .dwattr $C$DW$1951, DW_AT_name("rsvd_1")
   11516                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_rsvd_1")
   11517                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11518                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11519              $C$DW$1952      .dwtag  DW_TAG_member
   11520                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$23)
   11521                      .dwattr $C$DW$1952, DW_AT_name("FPWR")
   11522                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_FPWR")
   11523                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11524                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11525              $C$DW$1953      .dwtag  DW_TAG_member
   11526                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$23)
   11527                      .dwattr $C$DW$1953, DW_AT_name("FSTATUS")
   11528                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_FSTATUS")
   11529                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11530                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11531              $C$DW$1954      .dwtag  DW_TAG_member
   11532                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$23)
   11533                      .dwattr $C$DW$1954, DW_AT_name("FSTDBYWAIT")
   11534                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_FSTDBYWAIT")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  221

   11535                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11536                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11537              $C$DW$1955      .dwtag  DW_TAG_member
   11538                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$23)
   11539                      .dwattr $C$DW$1955, DW_AT_name("FACTIVEWAIT")
   11540                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   11541                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11542                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11543              $C$DW$1956      .dwtag  DW_TAG_member
   11544                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$23)
   11545                      .dwattr $C$DW$1956, DW_AT_name("FBANKWAIT")
   11546                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_FBANKWAIT")
   11547                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11548                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11549              $C$DW$1957      .dwtag  DW_TAG_member
   11550                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$23)
   11551                      .dwattr $C$DW$1957, DW_AT_name("FOTPWAIT")
   11552                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_FOTPWAIT")
   11553                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11554                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11555                      .dwendtag $C$DW$T$75
   11556              
   11557              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
   11558                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$75)
   11559                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
   11560              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   11561                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11562                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11563              
   11564              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   11565                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
   11566                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
   11567              $C$DW$1958      .dwtag  DW_TAG_member
   11568                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$77)
   11569                      .dwattr $C$DW$1958, DW_AT_name("GPACTRL")
   11570                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_GPACTRL")
   11571                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11572                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11573              $C$DW$1959      .dwtag  DW_TAG_member
   11574                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$77)
   11575                      .dwattr $C$DW$1959, DW_AT_name("GPAQSEL1")
   11576                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_GPAQSEL1")
   11577                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11578                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11579              $C$DW$1960      .dwtag  DW_TAG_member
   11580                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$77)
   11581                      .dwattr $C$DW$1960, DW_AT_name("GPAQSEL2")
   11582                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_GPAQSEL2")
   11583                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11584                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11585              $C$DW$1961      .dwtag  DW_TAG_member
   11586                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$77)
   11587                      .dwattr $C$DW$1961, DW_AT_name("GPAMUX1")
   11588                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_GPAMUX1")
   11589                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  222

   11590                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   11591              $C$DW$1962      .dwtag  DW_TAG_member
   11592                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$77)
   11593                      .dwattr $C$DW$1962, DW_AT_name("GPAMUX2")
   11594                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_GPAMUX2")
   11595                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11596                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11597              $C$DW$1963      .dwtag  DW_TAG_member
   11598                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$77)
   11599                      .dwattr $C$DW$1963, DW_AT_name("GPADIR")
   11600                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_GPADIR")
   11601                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11602                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11603              $C$DW$1964      .dwtag  DW_TAG_member
   11604                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$77)
   11605                      .dwattr $C$DW$1964, DW_AT_name("GPAPUD")
   11606                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_GPAPUD")
   11607                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11608                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11609              $C$DW$1965      .dwtag  DW_TAG_member
   11610                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$26)
   11611                      .dwattr $C$DW$1965, DW_AT_name("rsvd_1")
   11612                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_rsvd_1")
   11613                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11614                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11615              $C$DW$1966      .dwtag  DW_TAG_member
   11616                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$77)
   11617                      .dwattr $C$DW$1966, DW_AT_name("GPBCTRL")
   11618                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_GPBCTRL")
   11619                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11620                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11621              $C$DW$1967      .dwtag  DW_TAG_member
   11622                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$77)
   11623                      .dwattr $C$DW$1967, DW_AT_name("GPBQSEL1")
   11624                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_GPBQSEL1")
   11625                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11626                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11627              $C$DW$1968      .dwtag  DW_TAG_member
   11628                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$26)
   11629                      .dwattr $C$DW$1968, DW_AT_name("rsvd_2")
   11630                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_rsvd_2")
   11631                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11632                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   11633              $C$DW$1969      .dwtag  DW_TAG_member
   11634                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$77)
   11635                      .dwattr $C$DW$1969, DW_AT_name("GPBMUX1")
   11636                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_GPBMUX1")
   11637                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11638                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11639              $C$DW$1970      .dwtag  DW_TAG_member
   11640                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$26)
   11641                      .dwattr $C$DW$1970, DW_AT_name("rsvd_3")
   11642                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_rsvd_3")
   11643                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11644                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  223

   11645              $C$DW$1971      .dwtag  DW_TAG_member
   11646                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$77)
   11647                      .dwattr $C$DW$1971, DW_AT_name("GPBDIR")
   11648                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_GPBDIR")
   11649                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11650                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11651              $C$DW$1972      .dwtag  DW_TAG_member
   11652                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$77)
   11653                      .dwattr $C$DW$1972, DW_AT_name("GPBPUD")
   11654                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_GPBPUD")
   11655                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11656                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11657              $C$DW$1973      .dwtag  DW_TAG_member
   11658                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$78)
   11659                      .dwattr $C$DW$1973, DW_AT_name("rsvd_4")
   11660                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_rsvd_4")
   11661                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11662                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11663              $C$DW$1974      .dwtag  DW_TAG_member
   11664                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$77)
   11665                      .dwattr $C$DW$1974, DW_AT_name("AIOMUX1")
   11666                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_AIOMUX1")
   11667                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11668                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11669              $C$DW$1975      .dwtag  DW_TAG_member
   11670                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$26)
   11671                      .dwattr $C$DW$1975, DW_AT_name("rsvd_5")
   11672                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_rsvd_5")
   11673                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   11674                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11675              $C$DW$1976      .dwtag  DW_TAG_member
   11676                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$77)
   11677                      .dwattr $C$DW$1976, DW_AT_name("AIODIR")
   11678                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_AIODIR")
   11679                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11680                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11681              $C$DW$1977      .dwtag  DW_TAG_member
   11682                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$79)
   11683                      .dwattr $C$DW$1977, DW_AT_name("rsvd_6")
   11684                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_rsvd_6")
   11685                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   11686                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   11687              $C$DW$1978      .dwtag  DW_TAG_member
   11688                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$77)
   11689                      .dwattr $C$DW$1978, DW_AT_name("GPADAT")
   11690                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_GPADAT")
   11691                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11692                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   11693              $C$DW$1979      .dwtag  DW_TAG_member
   11694                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$77)
   11695                      .dwattr $C$DW$1979, DW_AT_name("GPASET")
   11696                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_GPASET")
   11697                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   11698                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11699              $C$DW$1980      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  224

   11700                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$77)
   11701                      .dwattr $C$DW$1980, DW_AT_name("GPACLEAR")
   11702                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_GPACLEAR")
   11703                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   11704                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11705              $C$DW$1981      .dwtag  DW_TAG_member
   11706                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$77)
   11707                      .dwattr $C$DW$1981, DW_AT_name("GPATOGGLE")
   11708                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_GPATOGGLE")
   11709                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11710                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11711              $C$DW$1982      .dwtag  DW_TAG_member
   11712                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$77)
   11713                      .dwattr $C$DW$1982, DW_AT_name("GPBDAT")
   11714                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_GPBDAT")
   11715                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   11716                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11717              $C$DW$1983      .dwtag  DW_TAG_member
   11718                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$77)
   11719                      .dwattr $C$DW$1983, DW_AT_name("GPBSET")
   11720                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_GPBSET")
   11721                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11722                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11723              $C$DW$1984      .dwtag  DW_TAG_member
   11724                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$77)
   11725                      .dwattr $C$DW$1984, DW_AT_name("GPBCLEAR")
   11726                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_GPBCLEAR")
   11727                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   11728                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   11729              $C$DW$1985      .dwtag  DW_TAG_member
   11730                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$77)
   11731                      .dwattr $C$DW$1985, DW_AT_name("GPBTOGGLE")
   11732                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_GPBTOGGLE")
   11733                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11734                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   11735              $C$DW$1986      .dwtag  DW_TAG_member
   11736                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$31)
   11737                      .dwattr $C$DW$1986, DW_AT_name("rsvd_7")
   11738                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_rsvd_7")
   11739                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   11740                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   11741              $C$DW$1987      .dwtag  DW_TAG_member
   11742                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$77)
   11743                      .dwattr $C$DW$1987, DW_AT_name("AIODAT")
   11744                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_AIODAT")
   11745                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
   11746                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   11747              $C$DW$1988      .dwtag  DW_TAG_member
   11748                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$77)
   11749                      .dwattr $C$DW$1988, DW_AT_name("AIOSET")
   11750                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_AIOSET")
   11751                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11752                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   11753              $C$DW$1989      .dwtag  DW_TAG_member
   11754                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  225

   11755                      .dwattr $C$DW$1989, DW_AT_name("AIOCLEAR")
   11756                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_AIOCLEAR")
   11757                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   11758                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   11759              $C$DW$1990      .dwtag  DW_TAG_member
   11760                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$77)
   11761                      .dwattr $C$DW$1990, DW_AT_name("AIOTOGGLE")
   11762                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_AIOTOGGLE")
   11763                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11764                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   11765              $C$DW$1991      .dwtag  DW_TAG_member
   11766                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$28)
   11767                      .dwattr $C$DW$1991, DW_AT_name("GPIOXINTnSEL")
   11768                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   11769                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   11770                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   11771              $C$DW$1992      .dwtag  DW_TAG_member
   11772                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$27)
   11773                      .dwattr $C$DW$1992, DW_AT_name("rsvd_8")
   11774                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_rsvd_8")
   11775                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   11776                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   11777              $C$DW$1993      .dwtag  DW_TAG_member
   11778                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$77)
   11779                      .dwattr $C$DW$1993, DW_AT_name("GPIOLPMSEL")
   11780                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   11781                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   11782                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   11783                      .dwendtag $C$DW$T$80
   11784              
   11785              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   11786                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$80)
   11787                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
   11788              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   11789                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
   11790                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
   11791              
   11792              $C$DW$T$82      .dwtag  DW_TAG_structure_type
   11793                      .dwattr $C$DW$T$82, DW_AT_name("_HAL_AdcData_t_")
   11794                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x10)
   11795              $C$DW$1994      .dwtag  DW_TAG_member
   11796                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$81)
   11797                      .dwattr $C$DW$1994, DW_AT_name("I")
   11798                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_I")
   11799                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11800                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
   11801              $C$DW$1995      .dwtag  DW_TAG_member
   11802                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$81)
   11803                      .dwattr $C$DW$1995, DW_AT_name("V")
   11804                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_V")
   11805                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11806                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   11807              $C$DW$1996      .dwtag  DW_TAG_member
   11808                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$73)
   11809                      .dwattr $C$DW$1996, DW_AT_name("dcBus")
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  226

   11810                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_dcBus")
   11811                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11812                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   11813              $C$DW$1997      .dwtag  DW_TAG_member
   11814                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$12)
   11815                      .dwattr $C$DW$1997, DW_AT_name("throttle")
   11816                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_throttle")
   11817                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11818                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   11819                      .dwendtag $C$DW$T$82
   11820              
   11821              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11822                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$82)
   11823                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   11824              $C$DW$T$373     .dwtag  DW_TAG_pointer_type
   11825                      .dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$121)
   11826                      .dwattr $C$DW$T$373, DW_AT_address_class(0x20)
   11827              $C$DW$1998      .dwtag  DW_TAG_TI_far_type
   11828                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$373)
   11829              $C$DW$T$374     .dwtag  DW_TAG_const_type
   11830                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$1998)
   11831              
   11832              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   11833                      .dwattr $C$DW$T$91, DW_AT_name("_HAL_MOTOR_Vars_t_")
   11834                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x68)
   11835              $C$DW$1999      .dwtag  DW_TAG_member
   11836                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$44)
   11837                      .dwattr $C$DW$1999, DW_AT_name("Flag_enableSys")
   11838                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_Flag_enableSys")
   11839                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11840                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   11841              $C$DW$2000      .dwtag  DW_TAG_member
   11842                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$44)
   11843                      .dwattr $C$DW$2000, DW_AT_name("Flag_Run_Identify")
   11844                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_Flag_Run_Identify")
   11845                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11846                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   11847              $C$DW$2001      .dwtag  DW_TAG_member
   11848                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$44)
   11849                      .dwattr $C$DW$2001, DW_AT_name("Flag_MotorIdentified")
   11850                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
   11851                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11852                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   11853              $C$DW$2002      .dwtag  DW_TAG_member
   11854                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$44)
   11855                      .dwattr $C$DW$2002, DW_AT_name("Flag_enableForceAngle")
   11856                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
   11857                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11858                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   11859              $C$DW$2003      .dwtag  DW_TAG_member
   11860                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$44)
   11861                      .dwattr $C$DW$2003, DW_AT_name("Flag_enableFieldWeakening")
   11862                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
   11863                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11864                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  227

   11865              $C$DW$2004      .dwtag  DW_TAG_member
   11866                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$44)
   11867                      .dwattr $C$DW$2004, DW_AT_name("Flag_enableRsRecalc")
   11868                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
   11869                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11870                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   11871              $C$DW$2005      .dwtag  DW_TAG_member
   11872                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$44)
   11873                      .dwattr $C$DW$2005, DW_AT_name("Flag_enableUserParams")
   11874                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_Flag_enableUserParams")
   11875                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11876                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   11877              $C$DW$2006      .dwtag  DW_TAG_member
   11878                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$44)
   11879                      .dwattr $C$DW$2006, DW_AT_name("Flag_enableOffsetcalc")
   11880                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
   11881                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11882                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   11883              $C$DW$2007      .dwtag  DW_TAG_member
   11884                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$44)
   11885                      .dwattr $C$DW$2007, DW_AT_name("Flag_enablePowerWarp")
   11886                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
   11887                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11888                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   11889              $C$DW$2008      .dwtag  DW_TAG_member
   11890                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$44)
   11891                      .dwattr $C$DW$2008, DW_AT_name("Flag_enableSpeedCtrl")
   11892                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
   11893                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11894                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   11895              $C$DW$2009      .dwtag  DW_TAG_member
   11896                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$44)
   11897                      .dwattr $C$DW$2009, DW_AT_name("startup")
   11898                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_startup")
   11899                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11900                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   11901              $C$DW$2010      .dwtag  DW_TAG_member
   11902                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$84)
   11903                      .dwattr $C$DW$2010, DW_AT_name("CtrlState")
   11904                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_CtrlState")
   11905                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11906                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   11907              $C$DW$2011      .dwtag  DW_TAG_member
   11908                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$86)
   11909                      .dwattr $C$DW$2011, DW_AT_name("EstState")
   11910                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_EstState")
   11911                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11912                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   11913              $C$DW$2012      .dwtag  DW_TAG_member
   11914                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$88)
   11915                      .dwattr $C$DW$2012, DW_AT_name("UserErrorCode")
   11916                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_UserErrorCode")
   11917                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11918                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   11919              $C$DW$2013      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  228

   11920                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$89)
   11921                      .dwattr $C$DW$2013, DW_AT_name("CtrlVersion")
   11922                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_CtrlVersion")
   11923                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11924                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   11925              $C$DW$2014      .dwtag  DW_TAG_member
   11926                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$73)
   11927                      .dwattr $C$DW$2014, DW_AT_name("IdRef_A")
   11928                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_IdRef_A")
   11929                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11930                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   11931              $C$DW$2015      .dwtag  DW_TAG_member
   11932                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$73)
   11933                      .dwattr $C$DW$2015, DW_AT_name("IqRef_A")
   11934                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_IqRef_A")
   11935                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11936                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   11937              $C$DW$2016      .dwtag  DW_TAG_member
   11938                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$73)
   11939                      .dwattr $C$DW$2016, DW_AT_name("SpeedRef_pu")
   11940                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_SpeedRef_pu")
   11941                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11942                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   11943              $C$DW$2017      .dwtag  DW_TAG_member
   11944                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$73)
   11945                      .dwattr $C$DW$2017, DW_AT_name("SpeedRef_krpm")
   11946                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_SpeedRef_krpm")
   11947                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11948                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   11949              $C$DW$2018      .dwtag  DW_TAG_member
   11950                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$73)
   11951                      .dwattr $C$DW$2018, DW_AT_name("SpeedTraj_krpm")
   11952                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
   11953                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11954                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   11955              $C$DW$2019      .dwtag  DW_TAG_member
   11956                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$73)
   11957                      .dwattr $C$DW$2019, DW_AT_name("MaxAccel_krpmps")
   11958                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
   11959                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11960                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   11961              $C$DW$2020      .dwtag  DW_TAG_member
   11962                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$73)
   11963                      .dwattr $C$DW$2020, DW_AT_name("Speed_krpm")
   11964                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_Speed_krpm")
   11965                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11966                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   11967              $C$DW$2021      .dwtag  DW_TAG_member
   11968                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$73)
   11969                      .dwattr $C$DW$2021, DW_AT_name("OverModulation")
   11970                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_OverModulation")
   11971                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11972                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   11973              $C$DW$2022      .dwtag  DW_TAG_member
   11974                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$73)
TMS320C2000 Assembler PC v6.4.11 Sat Nov 26 18:11:58 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2220410                            PAGE  229

   11975                      .dwattr $C$DW$2022, DW_AT_name("RsOnLineCurrent_A")
   11976                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
   11977                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11978                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   11979              $C$DW$2023      .dwtag  DW_TAG_member
   11980                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$73)
   11981                      .dwattr $C$DW$2023, DW_AT_name("SvgenMaxModulation_ticks")
   11982                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
   11983                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11984                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   11985              $C$DW$2024      .dwtag  DW_TAG_member
   11986                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$73)
   11987                      .dwattr $C$DW$2024, DW_AT_name("Flux_Wb")
   11988                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_Flux_Wb")
   11989                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   11990                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   11991              $C$DW$2025      .dwtag  DW_TAG_member
   11992                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$73)
   11993                      .dwattr $C$DW$2025, DW_AT_name("Torque_Nm")
   11994                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_Torque_Nm")
   11995                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   11996                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   11997              $C$DW$2026      .dwtag  DW_TAG_member
   11998                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$90)
   11999                      .dwattr $C$DW$2026, DW_AT_name("MagnCurr_A")
   12000                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_MagnCurr_A")
   12001                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   12002                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   12003              $C$DW$2027      .dwtag  DW_TAG_member
   12004                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$90)
   12005                      .dwattr $C$DW$2027, DW_AT_name("Rr_Ohm")
