TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Oct 03 09:35:11 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1479              $C$DW$334       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_9"), DW_AT_const_value(0x08)
    1480              $C$DW$335       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_1HP"), DW_AT_const_value(0x09)
    1481              $C$DW$336       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_2HP"), DW_AT_const_value(0x0a)
    1482              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_IntNumber_9HP"), DW_AT_const_value(0x0e)
    1483                      .dwendtag $C$DW$T$170
    1484              
    1485              $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntNumber_e")
    1486                      .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$170)
    1487                      .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    1488              
    1489              $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
    1490                      .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    1491              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_0"), DW_AT_const_value(0x00)
    1492              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_1"), DW_AT_const_value(0x01)
    1493              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_2"), DW_AT_const_value(0x02)
    1494              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_3"), DW_AT_const_value(0x03)
    1495              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_4"), DW_AT_const_value(0x04)
    1496              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    1497              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    1498              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    1499              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    1500              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   31

    1501              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    1502              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    1503              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    1504              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    1505              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    1506              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    1507                      .dwendtag $C$DW$T$173
    1508              
    1509              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    1510                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    1511                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    1512              
    1513              $C$DW$T$176     .dwtag  DW_TAG_enumeration_type
    1514                      .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    1515              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    1516              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    1517              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    1518              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    1519              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    1520              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    1521              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    1522              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    1523              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    1524              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    1525              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    1526              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    1527                      .dwendtag $C$DW$T$176
    1528              
    1529              $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    1530                      .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$176)
    1531                      .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    1532              
    1533              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1534                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    1535                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    1536              $C$DW$366       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
    1538                      .dwattr $C$DW$366, DW_AT_name("ADCRESULT")
    1539                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_ADCRESULT")
    1540                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$367       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$25)
    1544                      .dwattr $C$DW$367, DW_AT_name("resvd_1")
    1545                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_resvd_1")
    1546                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1547                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$368       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    1550                      .dwattr $C$DW$368, DW_AT_name("ADCCTL1")
    1551                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ADCCTL1")
    1552                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    1553                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$369       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   32

    1556                      .dwattr $C$DW$369, DW_AT_name("ADCCTL2")
    1557                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCCTL2")
    1558                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    1559                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    1560              $C$DW$370       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$26)
    1562                      .dwattr $C$DW$370, DW_AT_name("rsvd_2")
    1563                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd_2")
    1564                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    1565                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$371       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    1568                      .dwattr $C$DW$371, DW_AT_name("ADCINTFLG")
    1569                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_ADCINTFLG")
    1570                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    1571                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    1572              $C$DW$372       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
    1574                      .dwattr $C$DW$372, DW_AT_name("ADCINTFLGCLR")
    1575                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    1576                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    1577                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$373       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    1580                      .dwattr $C$DW$373, DW_AT_name("ADCINTOVF")
    1581                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCINTOVF")
    1582                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    1583                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    1584              $C$DW$374       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    1586                      .dwattr $C$DW$374, DW_AT_name("ADCINTOVFCLR")
    1587                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    1588                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    1589                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$375       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$27)
    1592                      .dwattr $C$DW$375, DW_AT_name("INTSELxNy")
    1593                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_INTSELxNy")
    1594                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    1595                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    1596              $C$DW$376       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$28)
    1598                      .dwattr $C$DW$376, DW_AT_name("rsvd_3")
    1599                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_rsvd_3")
    1600                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    1601                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    1602              $C$DW$377       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    1604                      .dwattr $C$DW$377, DW_AT_name("SOCPRICTRL")
    1605                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_SOCPRICTRL")
    1606                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    1607                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$378       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    1610                      .dwattr $C$DW$378, DW_AT_name("rsvd_4")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   33

    1611                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_rsvd_4")
    1612                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    1613                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    1614              $C$DW$379       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
    1616                      .dwattr $C$DW$379, DW_AT_name("ADCSAMPLEMODE")
    1617                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    1618                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    1619                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    1620              $C$DW$380       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
    1622                      .dwattr $C$DW$380, DW_AT_name("rsvd_5")
    1623                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_rsvd_5")
    1624                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    1625                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    1626              $C$DW$381       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
    1628                      .dwattr $C$DW$381, DW_AT_name("ADCINTSOCSEL1")
    1629                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    1630                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    1631                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$382       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    1634                      .dwattr $C$DW$382, DW_AT_name("ADCINTSOCSEL2")
    1635                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    1636                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    1637                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$383       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$26)
    1640                      .dwattr $C$DW$383, DW_AT_name("rsvd_6")
    1641                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd_6")
    1642                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    1643                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$384       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    1646                      .dwattr $C$DW$384, DW_AT_name("ADCSOCFLG1")
    1647                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    1648                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    1649                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    1650              $C$DW$385       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
    1652                      .dwattr $C$DW$385, DW_AT_name("rsvd_7")
    1653                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd_7")
    1654                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    1655                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    1656              $C$DW$386       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
    1658                      .dwattr $C$DW$386, DW_AT_name("ADCSOCFRC1")
    1659                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    1660                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    1661                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    1662              $C$DW$387       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
    1664                      .dwattr $C$DW$387, DW_AT_name("rsvd_8")
    1665                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   34

    1666                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    1667                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    1668              $C$DW$388       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
    1670                      .dwattr $C$DW$388, DW_AT_name("ADCSOCOVF1")
    1671                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    1672                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    1673                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$389       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
    1676                      .dwattr $C$DW$389, DW_AT_name("rsvd_9")
    1677                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_rsvd_9")
    1678                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    1679                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    1680              $C$DW$390       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    1682                      .dwattr $C$DW$390, DW_AT_name("ADCSOCOVFCLR1")
    1683                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    1684                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    1685                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$391       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    1688                      .dwattr $C$DW$391, DW_AT_name("rsvd_10")
    1689                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd_10")
    1690                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    1691                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$392       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$24)
    1694                      .dwattr $C$DW$392, DW_AT_name("ADCSOCxCTL")
    1695                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    1696                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    1697                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$393       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
    1700                      .dwattr $C$DW$393, DW_AT_name("rsvd_11")
    1701                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd_11")
    1702                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    1703                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    1704              $C$DW$394       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
    1706                      .dwattr $C$DW$394, DW_AT_name("ADCREFTRIM")
    1707                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_ADCREFTRIM")
    1708                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    1709                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$395       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
    1712                      .dwattr $C$DW$395, DW_AT_name("ADCOFFTRIM")
    1713                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1714                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    1715                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$396       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    1718                      .dwattr $C$DW$396, DW_AT_name("resvd_12")
    1719                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_resvd_12")
    1720                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   35

    1721                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$397       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    1724                      .dwattr $C$DW$397, DW_AT_name("ADCREV")
    1725                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_ADCREV")
    1726                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    1727                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    1728                      .dwendtag $C$DW$T$30
    1729              
    1730              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    1731                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$30)
    1732                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1733              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    1734                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$30)
    1735                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    1736              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    1737                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    1738                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1739              
    1740              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1741                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
    1742                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
    1743              $C$DW$398       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    1745                      .dwattr $C$DW$398, DW_AT_name("XCLK")
    1746                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_XCLK")
    1747                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$399       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    1751                      .dwattr $C$DW$399, DW_AT_name("rsvd_1")
    1752                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_rsvd_1")
    1753                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1754                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$400       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$23)
    1757                      .dwattr $C$DW$400, DW_AT_name("CLKCTL")
    1758                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_CLKCTL")
    1759                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1760                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$401       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
    1763                      .dwattr $C$DW$401, DW_AT_name("rsvd_2")
    1764                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd_2")
    1765                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1766                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    1767              $C$DW$402       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    1769                      .dwattr $C$DW$402, DW_AT_name("LOSPCP")
    1770                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_LOSPCP")
    1771                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1772                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$403       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
    1775                      .dwattr $C$DW$403, DW_AT_name("PCLKCR0")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   36

    1776                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_PCLKCR0")
    1777                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1778                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$404       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
    1781                      .dwattr $C$DW$404, DW_AT_name("PCLKCR1")
    1782                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_PCLKCR1")
    1783                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1784                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$405       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$26)
    1787                      .dwattr $C$DW$405, DW_AT_name("rsvd_3")
    1788                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd_3")
    1789                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1790                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$406       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
    1793                      .dwattr $C$DW$406, DW_AT_name("PCLKCR3")
    1794                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_PCLKCR3")
    1795                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1796                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    1797                      .dwendtag $C$DW$T$32
    1798              
    1799              $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    1800                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$32)
    1801                      .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    1802              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    1803                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    1804                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1805              
    1806              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1807                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
    1808                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1809              $C$DW$407       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$33)
    1811                      .dwattr $C$DW$407, DW_AT_name("tmp")
    1812                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_tmp")
    1813                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    1815                      .dwendtag $C$DW$T$34
    1816              
    1817              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1818                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$34)
    1819                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    1820              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    1821                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1822                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1823              
    1824              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1825                      .dwattr $C$DW$T$37, DW_AT_name("_CTRL_Version_")
    1826                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1827              $C$DW$408       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$22)
    1829                      .dwattr $C$DW$408, DW_AT_name("rsvd")
    1830                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_rsvd")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   37

    1831                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$409       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$36)
    1835                      .dwattr $C$DW$409, DW_AT_name("targetProc")
    1836                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_targetProc")
    1837                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1838                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    1839              $C$DW$410       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$22)
    1841                      .dwattr $C$DW$410, DW_AT_name("major")
    1842                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_major")
    1843                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1844                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$411       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$22)
    1847                      .dwattr $C$DW$411, DW_AT_name("minor")
    1848                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_minor")
    1849                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1850                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    1851                      .dwendtag $C$DW$T$37
    1852              
    1853              $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    1854                      .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$37)
    1855                      .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    1856              
    1857              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1858                      .dwattr $C$DW$T$45, DW_AT_name("_DRV8301_Obj_")
    1859                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    1860              $C$DW$412       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$39)
    1862                      .dwattr $C$DW$412, DW_AT_name("spiHandle")
    1863                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_spiHandle")
    1864                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$413       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$41)
    1868                      .dwattr $C$DW$413, DW_AT_name("gpioHandle")
    1869                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_gpioHandle")
    1870                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1871                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$414       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$43)
    1874                      .dwattr $C$DW$414, DW_AT_name("gpioNumber")
    1875                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_gpioNumber")
    1876                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1877                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$415       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$44)
    1880                      .dwattr $C$DW$415, DW_AT_name("RxTimeOut")
    1881                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_RxTimeOut")
    1882                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1883                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$416       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$44)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   38

    1886                      .dwattr $C$DW$416, DW_AT_name("enableTimeOut")
    1887                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_enableTimeOut")
    1888                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1889                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    1890                      .dwendtag $C$DW$T$45
    1891              
    1892              $C$DW$T$116     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    1893                      .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$45)
    1894                      .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    1895              $C$DW$T$114     .dwtag  DW_TAG_pointer_type
    1896                      .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$45)
    1897                      .dwattr $C$DW$T$114, DW_AT_address_class(0x20)
    1898              $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    1899                      .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
    1900                      .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    1901              
    1902              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    1903                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    1904                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
    1905              $C$DW$417       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$47)
    1907                      .dwattr $C$DW$417, DW_AT_name("DRV8301_CURRENT")
    1908                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    1909                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$418       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$49)
    1913                      .dwattr $C$DW$418, DW_AT_name("DRV8301_RESET")
    1914                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_DRV8301_RESET")
    1915                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1916                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$419       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$51)
    1919                      .dwattr $C$DW$419, DW_AT_name("PWM_MODE")
    1920                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_PWM_MODE")
    1921                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1922                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$420       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$53)
    1925                      .dwattr $C$DW$420, DW_AT_name("OC_MODE")
    1926                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_OC_MODE")
    1927                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1928                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$421       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$55)
    1931                      .dwattr $C$DW$421, DW_AT_name("OC_ADJ_SET")
    1932                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    1933                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1934                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    1935                      .dwendtag $C$DW$T$56
    1936              
    1937              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    1938                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$56)
    1939                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1940              
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   39

    1941              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    1942                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    1943                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    1944              $C$DW$422       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$58)
    1946                      .dwattr $C$DW$422, DW_AT_name("OCTW_SET")
    1947                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_OCTW_SET")
    1948                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$423       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$60)
    1952                      .dwattr $C$DW$423, DW_AT_name("GAIN")
    1953                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_GAIN")
    1954                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1955                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$424       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$62)
    1958                      .dwattr $C$DW$424, DW_AT_name("DC_CAL_CH1p2")
    1959                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    1960                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1961                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$425       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$64)
    1964                      .dwattr $C$DW$425, DW_AT_name("OC_TOFF")
    1965                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_OC_TOFF")
    1966                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1967                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    1968                      .dwendtag $C$DW$T$65
    1969              
    1970              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    1971                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$65)
    1972                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1973              
    1974              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    1975                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    1976                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0b)
    1977              $C$DW$426       .dwtag  DW_TAG_member
    1978                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$44)
    1979                      .dwattr $C$DW$426, DW_AT_name("FAULT")
    1980                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_FAULT")
    1981                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$427       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$44)
    1985                      .dwattr $C$DW$427, DW_AT_name("GVDD_UV")
    1986                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_GVDD_UV")
    1987                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1988                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$428       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$44)
    1991                      .dwattr $C$DW$428, DW_AT_name("PVDD_UV")
    1992                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_PVDD_UV")
    1993                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1994                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$429       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   40

    1996                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$44)
    1997                      .dwattr $C$DW$429, DW_AT_name("OTSD")
    1998                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_OTSD")
    1999                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2000                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    2001              $C$DW$430       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$44)
    2003                      .dwattr $C$DW$430, DW_AT_name("OTW")
    2004                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_OTW")
    2005                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2006                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$431       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$44)
    2009                      .dwattr $C$DW$431, DW_AT_name("FETHA_OC")
    2010                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_FETHA_OC")
    2011                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2012                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$432       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$44)
    2015                      .dwattr $C$DW$432, DW_AT_name("FETLA_OC")
    2016                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_FETLA_OC")
    2017                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2018                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    2019              $C$DW$433       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$44)
    2021                      .dwattr $C$DW$433, DW_AT_name("FETHB_OC")
    2022                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_FETHB_OC")
    2023                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2024                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$434       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$44)
    2027                      .dwattr $C$DW$434, DW_AT_name("FETLB_OC")
    2028                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_FETLB_OC")
    2029                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2030                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$435       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$44)
    2033                      .dwattr $C$DW$435, DW_AT_name("FETHC_OC")
    2034                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_FETHC_OC")
    2035                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2036                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$436       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$44)
    2039                      .dwattr $C$DW$436, DW_AT_name("FETLC_OC")
    2040                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_FETLC_OC")
    2041                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2042                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    2043                      .dwendtag $C$DW$T$66
    2044              
    2045              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    2046                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
    2047                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2048              
    2049              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    2050                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   41

    2051                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    2052              $C$DW$437       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$44)
    2054                      .dwattr $C$DW$437, DW_AT_name("GVDD_OV")
    2055                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_GVDD_OV")
    2056                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2057                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$438       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$22)
    2060                      .dwattr $C$DW$438, DW_AT_name("DeviceID")
    2061                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DeviceID")
    2062                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2063                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    2064                      .dwendtag $C$DW$T$67
    2065              
    2066              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    2067                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
    2068                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2069              
    2070              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    2071                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    2072                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
    2073              $C$DW$439       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$68)
    2075                      .dwattr $C$DW$439, DW_AT_name("Stat_Reg_1")
    2076                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_Stat_Reg_1")
    2077                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$440       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$69)
    2081                      .dwattr $C$DW$440, DW_AT_name("Stat_Reg_2")
    2082                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_Stat_Reg_2")
    2083                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2084                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    2085              $C$DW$441       .dwtag  DW_TAG_member
    2086                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$70)
    2087                      .dwattr $C$DW$441, DW_AT_name("Ctrl_Reg_1")
    2088                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    2089                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2090                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$442       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$71)
    2093                      .dwattr $C$DW$442, DW_AT_name("Ctrl_Reg_2")
    2094                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    2095                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2096                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$443       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$44)
    2099                      .dwattr $C$DW$443, DW_AT_name("SndCmd")
    2100                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_SndCmd")
    2101                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2102                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$444       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$44)
    2105                      .dwattr $C$DW$444, DW_AT_name("RcvCmd")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   42

    2106                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_RcvCmd")
    2107                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2108                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    2109                      .dwendtag $C$DW$T$72
    2110              
    2111              $C$DW$T$180     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    2112                      .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$72)
    2113                      .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    2114              $C$DW$T$181     .dwtag  DW_TAG_pointer_type
    2115                      .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$180)
    2116                      .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
    2117              
    2118              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    2119                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
    2120                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
    2121              $C$DW$445       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$73)
    2123                      .dwattr $C$DW$445, DW_AT_name("a1")
    2124                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_a1")
    2125                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$446       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$73)
    2129                      .dwattr $C$DW$446, DW_AT_name("b0")
    2130                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_b0")
    2131                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2132                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$447       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$73)
    2135                      .dwattr $C$DW$447, DW_AT_name("b1")
    2136                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_b1")
    2137                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2138                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    2139              $C$DW$448       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$73)
    2141                      .dwattr $C$DW$448, DW_AT_name("x1")
    2142                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_x1")
    2143                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2144                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$449       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$73)
    2147                      .dwattr $C$DW$449, DW_AT_name("y1")
    2148                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_y1")
    2149                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2150                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    2151                      .dwendtag $C$DW$T$74
    2152              
    2153              $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    2154                      .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$74)
    2155                      .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    2156              
    2157              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2158                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
    2159                      .dwattr $C$DW$T$19, DW_AT_declaration
    2160                      .dwendtag $C$DW$T$19
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   43

    2161              
    2162              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    2163                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$19)
    2164                      .dwattr $C$DW$T$133, DW_AT_address_class(0x20)
    2165              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    2166                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
    2167                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    2168              
    2169              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    2170                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
    2171                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    2172              $C$DW$450       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    2174                      .dwattr $C$DW$450, DW_AT_name("FOPT")
    2175                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_FOPT")
    2176                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$451       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$23)
    2180                      .dwattr $C$DW$451, DW_AT_name("rsvd_1")
    2181                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_rsvd_1")
    2182                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2183                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$452       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$23)
    2186                      .dwattr $C$DW$452, DW_AT_name("FPWR")
    2187                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_FPWR")
    2188                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2189                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$453       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$23)
    2192                      .dwattr $C$DW$453, DW_AT_name("FSTATUS")
    2193                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_FSTATUS")
    2194                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2195                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    2196              $C$DW$454       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$23)
    2198                      .dwattr $C$DW$454, DW_AT_name("FSTDBYWAIT")
    2199                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    2200                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2201                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$455       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$23)
    2204                      .dwattr $C$DW$455, DW_AT_name("FACTIVEWAIT")
    2205                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    2206                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2207                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$456       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$23)
    2210                      .dwattr $C$DW$456, DW_AT_name("FBANKWAIT")
    2211                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_FBANKWAIT")
    2212                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2213                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$457       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   44

    2216                      .dwattr $C$DW$457, DW_AT_name("FOTPWAIT")
    2217                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_FOTPWAIT")
    2218                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2219                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    2220                      .dwendtag $C$DW$T$75
    2221              
    2222              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    2223                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$75)
    2224                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    2225              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    2226                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    2227                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2228              
    2229              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    2230                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
    2231                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
    2232              $C$DW$458       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$77)
    2234                      .dwattr $C$DW$458, DW_AT_name("GPACTRL")
    2235                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_GPACTRL")
    2236                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    2238              $C$DW$459       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$77)
    2240                      .dwattr $C$DW$459, DW_AT_name("GPAQSEL1")
    2241                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_GPAQSEL1")
    2242                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2243                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$460       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$77)
    2246                      .dwattr $C$DW$460, DW_AT_name("GPAQSEL2")
    2247                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_GPAQSEL2")
    2248                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2249                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$461       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$77)
    2252                      .dwattr $C$DW$461, DW_AT_name("GPAMUX1")
    2253                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_GPAMUX1")
    2254                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2255                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$462       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$77)
    2258                      .dwattr $C$DW$462, DW_AT_name("GPAMUX2")
    2259                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_GPAMUX2")
    2260                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2261                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$463       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$77)
    2264                      .dwattr $C$DW$463, DW_AT_name("GPADIR")
    2265                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_GPADIR")
    2266                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2267                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    2268              $C$DW$464       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$77)
    2270                      .dwattr $C$DW$464, DW_AT_name("GPAPUD")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   45

    2271                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_GPAPUD")
    2272                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2273                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    2274              $C$DW$465       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$26)
    2276                      .dwattr $C$DW$465, DW_AT_name("rsvd_1")
    2277                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_rsvd_1")
    2278                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2279                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    2280              $C$DW$466       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$77)
    2282                      .dwattr $C$DW$466, DW_AT_name("GPBCTRL")
    2283                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_GPBCTRL")
    2284                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2285                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$467       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$77)
    2288                      .dwattr $C$DW$467, DW_AT_name("GPBQSEL1")
    2289                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_GPBQSEL1")
    2290                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2291                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$468       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$26)
    2294                      .dwattr $C$DW$468, DW_AT_name("rsvd_2")
    2295                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_rsvd_2")
    2296                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2297                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$469       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$77)
    2300                      .dwattr $C$DW$469, DW_AT_name("GPBMUX1")
    2301                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_GPBMUX1")
    2302                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2303                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    2304              $C$DW$470       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$26)
    2306                      .dwattr $C$DW$470, DW_AT_name("rsvd_3")
    2307                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_rsvd_3")
    2308                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2309                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$471       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$77)
    2312                      .dwattr $C$DW$471, DW_AT_name("GPBDIR")
    2313                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_GPBDIR")
    2314                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2315                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$472       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$77)
    2318                      .dwattr $C$DW$472, DW_AT_name("GPBPUD")
    2319                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_GPBPUD")
    2320                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2321                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$473       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$78)
    2324                      .dwattr $C$DW$473, DW_AT_name("rsvd_4")
    2325                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_rsvd_4")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   46

    2326                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2327                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$474       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$77)
    2330                      .dwattr $C$DW$474, DW_AT_name("AIOMUX1")
    2331                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_AIOMUX1")
    2332                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2333                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    2334              $C$DW$475       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$26)
    2336                      .dwattr $C$DW$475, DW_AT_name("rsvd_5")
    2337                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_rsvd_5")
    2338                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2339                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$476       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$77)
    2342                      .dwattr $C$DW$476, DW_AT_name("AIODIR")
    2343                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_AIODIR")
    2344                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2345                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    2346              $C$DW$477       .dwtag  DW_TAG_member
    2347                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$79)
    2348                      .dwattr $C$DW$477, DW_AT_name("rsvd_6")
    2349                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_rsvd_6")
    2350                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2351                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$478       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$77)
    2354                      .dwattr $C$DW$478, DW_AT_name("GPADAT")
    2355                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_GPADAT")
    2356                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2357                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$479       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$77)
    2360                      .dwattr $C$DW$479, DW_AT_name("GPASET")
    2361                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_GPASET")
    2362                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2363                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$480       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$77)
    2366                      .dwattr $C$DW$480, DW_AT_name("GPACLEAR")
    2367                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_GPACLEAR")
    2368                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2369                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$481       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$77)
    2372                      .dwattr $C$DW$481, DW_AT_name("GPATOGGLE")
    2373                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_GPATOGGLE")
    2374                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2375                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$482       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$77)
    2378                      .dwattr $C$DW$482, DW_AT_name("GPBDAT")
    2379                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_GPBDAT")
    2380                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   47

    2381                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    2382              $C$DW$483       .dwtag  DW_TAG_member
    2383                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$77)
    2384                      .dwattr $C$DW$483, DW_AT_name("GPBSET")
    2385                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_GPBSET")
    2386                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2387                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$484       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$77)
    2390                      .dwattr $C$DW$484, DW_AT_name("GPBCLEAR")
    2391                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_GPBCLEAR")
    2392                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2393                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    2394              $C$DW$485       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$77)
    2396                      .dwattr $C$DW$485, DW_AT_name("GPBTOGGLE")
    2397                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_GPBTOGGLE")
    2398                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2399                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$486       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$31)
    2402                      .dwattr $C$DW$486, DW_AT_name("rsvd_7")
    2403                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_rsvd_7")
    2404                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2405                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$487       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$77)
    2408                      .dwattr $C$DW$487, DW_AT_name("AIODAT")
    2409                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_AIODAT")
    2410                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2411                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$488       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$77)
    2414                      .dwattr $C$DW$488, DW_AT_name("AIOSET")
    2415                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_AIOSET")
    2416                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2417                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$489       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$77)
    2420                      .dwattr $C$DW$489, DW_AT_name("AIOCLEAR")
    2421                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_AIOCLEAR")
    2422                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2423                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$490       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$77)
    2426                      .dwattr $C$DW$490, DW_AT_name("AIOTOGGLE")
    2427                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_AIOTOGGLE")
    2428                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2429                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    2430              $C$DW$491       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$28)
    2432                      .dwattr $C$DW$491, DW_AT_name("GPIOXINTnSEL")
    2433                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    2434                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2435                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   48

    2436              $C$DW$492       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$27)
    2438                      .dwattr $C$DW$492, DW_AT_name("rsvd_8")
    2439                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_rsvd_8")
    2440                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    2441                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$493       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$77)
    2444                      .dwattr $C$DW$493, DW_AT_name("GPIOLPMSEL")
    2445                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    2446                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2447                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    2448                      .dwendtag $C$DW$T$80
    2449              
    2450              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2451                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$80)
    2452                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    2453              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    2454                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2455                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2456              
    2457              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    2458                      .dwattr $C$DW$T$82, DW_AT_name("_HAL_AdcData_t_")
    2459                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x10)
    2460              $C$DW$494       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$81)
    2462                      .dwattr $C$DW$494, DW_AT_name("I")
    2463                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_I")
    2464                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2465                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$495       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$81)
    2468                      .dwattr $C$DW$495, DW_AT_name("V")
    2469                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_V")
    2470                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2471                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$496       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$73)
    2474                      .dwattr $C$DW$496, DW_AT_name("dcBus")
    2475                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_dcBus")
    2476                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2477                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$497       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$12)
    2480                      .dwattr $C$DW$497, DW_AT_name("throttle")
    2481                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_throttle")
    2482                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2483                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    2484                      .dwendtag $C$DW$T$82
    2485              
    2486              $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
    2487                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$82)
    2488                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2489              $C$DW$T$183     .dwtag  DW_TAG_pointer_type
    2490                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$112)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   49

    2491                      .dwattr $C$DW$T$183, DW_AT_address_class(0x20)
    2492              $C$DW$498       .dwtag  DW_TAG_TI_far_type
    2493                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$183)
    2494              $C$DW$T$184     .dwtag  DW_TAG_const_type
    2495                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$498)
    2496              
    2497              $C$DW$T$119     .dwtag  DW_TAG_structure_type
    2498                      .dwattr $C$DW$T$119, DW_AT_name("_HAL_Obj_")
    2499                      .dwattr $C$DW$T$119, DW_AT_byte_size(0xc6)
    2500              $C$DW$499       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$84)
    2502                      .dwattr $C$DW$499, DW_AT_name("adcHandle")
    2503                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_adcHandle")
    2504                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$500       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$86)
    2508                      .dwattr $C$DW$500, DW_AT_name("clkHandle")
    2509                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_clkHandle")
    2510                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2511                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$501       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$88)
    2514                      .dwattr $C$DW$501, DW_AT_name("cpuHandle")
    2515                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_cpuHandle")
    2516                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2517                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$502       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$90)
    2520                      .dwattr $C$DW$502, DW_AT_name("flashHandle")
    2521                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_flashHandle")
    2522                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2523                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$503       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$41)
    2526                      .dwattr $C$DW$503, DW_AT_name("gpioHandle")
    2527                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_gpioHandle")
    2528                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2529                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$504       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$93)
    2532                      .dwattr $C$DW$504, DW_AT_name("offsetHandle_I")
    2533                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_offsetHandle_I")
    2534                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2535                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$505       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$95)
    2538                      .dwattr $C$DW$505, DW_AT_name("offset_I")
    2539                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_offset_I")
    2540                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2541                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$506       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$93)
    2544                      .dwattr $C$DW$506, DW_AT_name("offsetHandle_V")
    2545                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_offsetHandle_V")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   50

    2546                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2547                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$507       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$95)
    2550                      .dwattr $C$DW$507, DW_AT_name("offset_V")
    2551                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_offset_V")
    2552                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2553                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$508       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$97)
    2556                      .dwattr $C$DW$508, DW_AT_name("oscHandle")
    2557                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_oscHandle")
    2558                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2559                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$509       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$99)
    2562                      .dwattr $C$DW$509, DW_AT_name("pieHandle")
    2563                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_pieHandle")
    2564                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2565                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$510       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$101)
    2568                      .dwattr $C$DW$510, DW_AT_name("pllHandle")
    2569                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_pllHandle")
    2570                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2571                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$511       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$104)
    2574                      .dwattr $C$DW$511, DW_AT_name("pwmHandle")
    2575                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_pwmHandle")
    2576                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2577                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$512       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$104)
    2580                      .dwattr $C$DW$512, DW_AT_name("pwmDacHandle")
    2581                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_pwmDacHandle")
    2582                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2583                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$513       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$106)
    2586                      .dwattr $C$DW$513, DW_AT_name("pwrHandle")
    2587                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_pwrHandle")
    2588                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2589                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$514       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$109)
    2592                      .dwattr $C$DW$514, DW_AT_name("timerHandle")
    2593                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_timerHandle")
    2594                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2595                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    2596              $C$DW$515       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$111)
    2598                      .dwattr $C$DW$515, DW_AT_name("wdogHandle")
    2599                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_wdogHandle")
    2600                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   51

    2601                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$516       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$112)
    2604                      .dwattr $C$DW$516, DW_AT_name("adcBias")
    2605                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_adcBias")
    2606                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2607                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$517       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$73)
    2610                      .dwattr $C$DW$517, DW_AT_name("current_sf")
    2611                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_current_sf")
    2612                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2613                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    2614              $C$DW$518       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$73)
    2616                      .dwattr $C$DW$518, DW_AT_name("voltage_sf")
    2617                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_voltage_sf")
    2618                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2619                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$519       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$33)
    2622                      .dwattr $C$DW$519, DW_AT_name("numCurrentSensors")
    2623                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_numCurrentSensors")
    2624                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2625                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$520       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$33)
    2628                      .dwattr $C$DW$520, DW_AT_name("numVoltageSensors")
    2629                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_numVoltageSensors")
    2630                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0xa7]
    2631                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$521       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$39)
    2634                      .dwattr $C$DW$521, DW_AT_name("spiAHandle")
    2635                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_spiAHandle")
    2636                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2637                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$522       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$113)
    2640                      .dwattr $C$DW$522, DW_AT_name("spiA")
    2641                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_spiA")
    2642                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2643                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$523       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$115)
    2646                      .dwattr $C$DW$523, DW_AT_name("drv8301Handle")
    2647                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_drv8301Handle")
    2648                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2649                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$524       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$116)
    2652                      .dwattr $C$DW$524, DW_AT_name("drv8301")
    2653                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_drv8301")
    2654                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2655                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 09:35:11 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\0699610                            PAGE   52

    2656              $C$DW$525       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$118)
    2658                      .dwattr $C$DW$525, DW_AT_name("i2cHandle")
    2659                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_i2cHandle")
    2660                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2661                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    2662                      .dwendtag $C$DW$T$119
    2663              
    2664              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Obj")
    2665                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$119)
    2666                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    2667              $C$DW$T$188     .dwtag  DW_TAG_pointer_type
    2668                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    2669                      .dwattr $C$DW$T$188, DW_AT_address_class(0x20)
    2670              $C$DW$T$189     .dwtag  DW_TAG_pointer_type
    2671                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$119)
    2672                      .dwattr $C$DW$T$189, DW_AT_address_class(0x20)
    2673              $C$DW$T$190     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_Handle")
    2674                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$189)
    2675                      .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    2676              $C$DW$526       .dwtag  DW_TAG_TI_far_type
    2677                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$190)
    2678              $C$DW$T$191     .dwtag  DW_TAG_const_type
    2679                      .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$526)
    2680              
    2681              $C$DW$T$120     .dwtag  DW_TAG_structure_type
    2682                      .dwattr $C$DW$T$120, DW_AT_name("_HAL_PwmData_t_")
    2683                      .dwattr $C$DW$T$120, DW_AT_byte_size(0x06)
    2684              $C$DW$527       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$81)
    2686                      .dwattr $C$DW$527, DW_AT_name("Tabc")
    2687                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_Tabc")
    2688                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2689                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    2690                      .dwendtag $C$DW$T$120
    2691              
