TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Sep 05 19:08:09 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CTRL_setGains")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CTRL_setGains")

    3001              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    3002              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    3003              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    3004              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    3005              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    3006              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    3007              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    3008              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    3009              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    3010              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    3011              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    3012              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    3013              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    3014              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    3015              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    3016              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    3017              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    3018              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    3019              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    3020              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    3021              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    3022              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    3023              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    3024              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    3025              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   61

    3026              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    3027              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    3028                      .dwendtag $C$DW$T$74
    3029              
    3030              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    3031                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3032                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3033              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    3034                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$75)
    3035              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3036                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$366)
    3037              
    3038              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3039                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3040              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3041              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3042              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3043                      .dwendtag $C$DW$T$82
    3044              
    3045              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3046                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3047                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3048              $C$DW$370       .dwtag  DW_TAG_TI_far_type
    3049                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$83)
    3050              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3051                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$370)
    3052              
    3053              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3054                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3055                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3056              $C$DW$371       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    3058                      .dwattr $C$DW$371, DW_AT_name("alpha_sf")
    3059                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_alpha_sf")
    3060                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3061                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3062              $C$DW$372       .dwtag  DW_TAG_member
    3063                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    3064                      .dwattr $C$DW$372, DW_AT_name("beta_sf")
    3065                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_beta_sf")
    3066                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3067                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3068              $C$DW$373       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    3070                      .dwattr $C$DW$373, DW_AT_name("numSensors")
    3071                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_numSensors")
    3072                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3073                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3074                      .dwendtag $C$DW$T$23
    3075              
    3076              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3077                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    3078                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3079              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3080                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   62

    3081                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3082              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3083                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3084                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3085              
    3086              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3087                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3088                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3089              $C$DW$374       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$24)
    3091                      .dwattr $C$DW$374, DW_AT_name("version")
    3092                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_version")
    3093                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3094                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3095              $C$DW$375       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$26)
    3097                      .dwattr $C$DW$375, DW_AT_name("state")
    3098                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_state")
    3099                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3100                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3101              $C$DW$376       .dwtag  DW_TAG_member
    3102                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    3103                      .dwattr $C$DW$376, DW_AT_name("prevState")
    3104                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_prevState")
    3105                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3106                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3107              $C$DW$377       .dwtag  DW_TAG_member
    3108                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$28)
    3109                      .dwattr $C$DW$377, DW_AT_name("errorCode")
    3110                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_errorCode")
    3111                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3112                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$378       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3115                      .dwattr $C$DW$378, DW_AT_name("clarkeHandle_I")
    3116                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3117                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3118                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$379       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
    3121                      .dwattr $C$DW$379, DW_AT_name("clarke_I")
    3122                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_clarke_I")
    3123                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3124                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3125              $C$DW$380       .dwtag  DW_TAG_member
    3126                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    3127                      .dwattr $C$DW$380, DW_AT_name("clarkeHandle_V")
    3128                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3129                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3130                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$381       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$31)
    3133                      .dwattr $C$DW$381, DW_AT_name("clarke_V")
    3134                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_clarke_V")
    3135                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   63

    3136                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$382       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$33)
    3139                      .dwattr $C$DW$382, DW_AT_name("estHandle")
    3140                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_estHandle")
    3141                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3142                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3143              $C$DW$383       .dwtag  DW_TAG_member
    3144                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$35)
    3145                      .dwattr $C$DW$383, DW_AT_name("parkHandle")
    3146                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_parkHandle")
    3147                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3148                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3149              $C$DW$384       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$36)
    3151                      .dwattr $C$DW$384, DW_AT_name("park")
    3152                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_park")
    3153                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3154                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$385       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$38)
    3157                      .dwattr $C$DW$385, DW_AT_name("pidHandle_Id")
    3158                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pidHandle_Id")
    3159                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3160                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3161              $C$DW$386       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$39)
    3163                      .dwattr $C$DW$386, DW_AT_name("pid_Id")
    3164                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pid_Id")
    3165                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3166                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3167              $C$DW$387       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$38)
    3169                      .dwattr $C$DW$387, DW_AT_name("pidHandle_Iq")
    3170                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3171                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3172                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3173              $C$DW$388       .dwtag  DW_TAG_member
    3174                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$39)
    3175                      .dwattr $C$DW$388, DW_AT_name("pid_Iq")
    3176                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_pid_Iq")
    3177                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3178                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$389       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$38)
    3181                      .dwattr $C$DW$389, DW_AT_name("pidHandle_spd")
    3182                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_pidHandle_spd")
    3183                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3184                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$390       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$39)
    3187                      .dwattr $C$DW$390, DW_AT_name("pid_spd")
    3188                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_pid_spd")
    3189                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3190                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   64

    3191              $C$DW$391       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
    3193                      .dwattr $C$DW$391, DW_AT_name("iparkHandle")
    3194                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_iparkHandle")
    3195                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3196                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$392       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$42)
    3199                      .dwattr $C$DW$392, DW_AT_name("ipark")
    3200                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ipark")
    3201                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3202                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3203              $C$DW$393       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$44)
    3205                      .dwattr $C$DW$393, DW_AT_name("svgenHandle")
    3206                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_svgenHandle")
    3207                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3208                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3209              $C$DW$394       .dwtag  DW_TAG_member
    3210                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$45)
    3211                      .dwattr $C$DW$394, DW_AT_name("svgen")
    3212                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_svgen")
    3213                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3214                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3215              $C$DW$395       .dwtag  DW_TAG_member
    3216                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$47)
    3217                      .dwattr $C$DW$395, DW_AT_name("trajHandle_Id")
    3218                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_trajHandle_Id")
    3219                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3220                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3221              $C$DW$396       .dwtag  DW_TAG_member
    3222                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$48)
    3223                      .dwattr $C$DW$396, DW_AT_name("traj_Id")
    3224                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_traj_Id")
    3225                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3226                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3227              $C$DW$397       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$47)
    3229                      .dwattr $C$DW$397, DW_AT_name("trajHandle_spd")
    3230                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_trajHandle_spd")
    3231                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3232                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3233              $C$DW$398       .dwtag  DW_TAG_member
    3234                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$48)
    3235                      .dwattr $C$DW$398, DW_AT_name("traj_spd")
    3236                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_traj_spd")
    3237                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3238                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$399       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$47)
    3241                      .dwattr $C$DW$399, DW_AT_name("trajHandle_spdMax")
    3242                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    3243                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3244                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$400       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   65

    3246                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$48)
    3247                      .dwattr $C$DW$400, DW_AT_name("traj_spdMax")
    3248                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_traj_spdMax")
    3249                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3250                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$401       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$49)
    3253                      .dwattr $C$DW$401, DW_AT_name("motorParams")
    3254                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_motorParams")
    3255                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3256                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3257              $C$DW$402       .dwtag  DW_TAG_member
    3258                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$52)
    3259                      .dwattr $C$DW$402, DW_AT_name("waitTimes")
    3260                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_waitTimes")
    3261                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3262                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3263              $C$DW$403       .dwtag  DW_TAG_member
    3264                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$51)
    3265                      .dwattr $C$DW$403, DW_AT_name("counter_state")
    3266                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_counter_state")
    3267                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3268                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$404       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3271                      .dwattr $C$DW$404, DW_AT_name("numIsrTicksPerCtrlTick")
    3272                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3273                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3274                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3275              $C$DW$405       .dwtag  DW_TAG_member
    3276                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$53)
    3277                      .dwattr $C$DW$405, DW_AT_name("numCtrlTicksPerCurrentTick")
    3278                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3279                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3280                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$406       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$53)
    3283                      .dwattr $C$DW$406, DW_AT_name("numCtrlTicksPerSpeedTick")
    3284                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3285                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3286                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$407       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$53)
    3289                      .dwattr $C$DW$407, DW_AT_name("numCtrlTicksPerTrajTick")
    3290                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3291                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3292                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3293              $C$DW$408       .dwtag  DW_TAG_member
    3294                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$51)
    3295                      .dwattr $C$DW$408, DW_AT_name("ctrlFreq_Hz")
    3296                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3297                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    3298                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3299              $C$DW$409       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   66

    3301                      .dwattr $C$DW$409, DW_AT_name("trajFreq_Hz")
    3302                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3303                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3304                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3305              $C$DW$410       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3307                      .dwattr $C$DW$410, DW_AT_name("trajPeriod_sec")
    3308                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3309                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3310                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3311              $C$DW$411       .dwtag  DW_TAG_member
    3312                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$54)
    3313                      .dwattr $C$DW$411, DW_AT_name("ctrlPeriod_sec")
    3314                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3315                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3316                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$412       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3319                      .dwattr $C$DW$412, DW_AT_name("maxVsMag_pu")
    3320                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3321                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3322                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$413       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3325                      .dwattr $C$DW$413, DW_AT_name("Iab_in")
    3326                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Iab_in")
    3327                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3328                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3329              $C$DW$414       .dwtag  DW_TAG_member
    3330                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3331                      .dwattr $C$DW$414, DW_AT_name("Iab_filt")
    3332                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Iab_filt")
    3333                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3334                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$415       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3337                      .dwattr $C$DW$415, DW_AT_name("Idq_in")
    3338                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Idq_in")
    3339                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3340                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3341              $C$DW$416       .dwtag  DW_TAG_member
    3342                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$55)
    3343                      .dwattr $C$DW$416, DW_AT_name("Vab_in")
    3344                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Vab_in")
    3345                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3346                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3347              $C$DW$417       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3349                      .dwattr $C$DW$417, DW_AT_name("spd_out")
    3350                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_spd_out")
    3351                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3352                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$418       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$55)
    3355                      .dwattr $C$DW$418, DW_AT_name("Vab_out")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   67

    3356                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Vab_out")
    3357                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3358                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3359              $C$DW$419       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
    3361                      .dwattr $C$DW$419, DW_AT_name("Vdq_out")
    3362                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Vdq_out")
    3363                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3364                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$420       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$54)
    3367                      .dwattr $C$DW$420, DW_AT_name("Rhf")
    3368                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Rhf")
    3369                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3370                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3371              $C$DW$421       .dwtag  DW_TAG_member
    3372                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$54)
    3373                      .dwattr $C$DW$421, DW_AT_name("Lhf")
    3374                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Lhf")
    3375                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3376                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3377              $C$DW$422       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$54)
    3379                      .dwattr $C$DW$422, DW_AT_name("RoverL")
    3380                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RoverL")
    3381                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3382                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3383              $C$DW$423       .dwtag  DW_TAG_member
    3384                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3385                      .dwattr $C$DW$423, DW_AT_name("Kp_Id")
    3386                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Kp_Id")
    3387                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3388                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3389              $C$DW$424       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3391                      .dwattr $C$DW$424, DW_AT_name("Kp_Iq")
    3392                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kp_Iq")
    3393                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3394                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$425       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3397                      .dwattr $C$DW$425, DW_AT_name("Kp_spd")
    3398                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kp_spd")
    3399                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3400                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$426       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3403                      .dwattr $C$DW$426, DW_AT_name("Ki_Id")
    3404                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Ki_Id")
    3405                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3406                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3407              $C$DW$427       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3409                      .dwattr $C$DW$427, DW_AT_name("Ki_Iq")
    3410                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ki_Iq")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   68

    3411                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3412                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3413              $C$DW$428       .dwtag  DW_TAG_member
    3414                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3415                      .dwattr $C$DW$428, DW_AT_name("Ki_spd")
    3416                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ki_spd")
    3417                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3418                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$429       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3421                      .dwattr $C$DW$429, DW_AT_name("Kd_Id")
    3422                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Kd_Id")
    3423                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3424                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3425              $C$DW$430       .dwtag  DW_TAG_member
    3426                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3427                      .dwattr $C$DW$430, DW_AT_name("Kd_Iq")
    3428                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Kd_Iq")
    3429                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3430                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$431       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3433                      .dwattr $C$DW$431, DW_AT_name("Kd_spd")
    3434                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Kd_spd")
    3435                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3436                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3437              $C$DW$432       .dwtag  DW_TAG_member
    3438                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3439                      .dwattr $C$DW$432, DW_AT_name("Ui_Id")
    3440                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Ui_Id")
    3441                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3442                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$433       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3445                      .dwattr $C$DW$433, DW_AT_name("Ui_Iq")
    3446                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Ui_Iq")
    3447                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3448                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3449              $C$DW$434       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3451                      .dwattr $C$DW$434, DW_AT_name("Ui_spd")
    3452                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Ui_spd")
    3453                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3454                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3455              $C$DW$435       .dwtag  DW_TAG_member
    3456                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$55)
    3457                      .dwattr $C$DW$435, DW_AT_name("Idq_ref")
    3458                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Idq_ref")
    3459                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3460                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3461              $C$DW$436       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
    3463                      .dwattr $C$DW$436, DW_AT_name("IdRated")
    3464                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_IdRated")
    3465                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   69

    3466                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3467              $C$DW$437       .dwtag  DW_TAG_member
    3468                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3469                      .dwattr $C$DW$437, DW_AT_name("spd_ref")
    3470                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_spd_ref")
    3471                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3472                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$438       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3475                      .dwattr $C$DW$438, DW_AT_name("spd_max")
    3476                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_spd_max")
    3477                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3478                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$439       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    3481                      .dwattr $C$DW$439, DW_AT_name("counter_current")
    3482                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_counter_current")
    3483                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3484                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3485              $C$DW$440       .dwtag  DW_TAG_member
    3486                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$53)
    3487                      .dwattr $C$DW$440, DW_AT_name("counter_isr")
    3488                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_counter_isr")
    3489                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3490                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3491              $C$DW$441       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$53)
    3493                      .dwattr $C$DW$441, DW_AT_name("counter_speed")
    3494                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_counter_speed")
    3495                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3496                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$442       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    3499                      .dwattr $C$DW$442, DW_AT_name("counter_traj")
    3500                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_counter_traj")
    3501                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3502                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$443       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3505                      .dwattr $C$DW$443, DW_AT_name("flag_enableCtrl")
    3506                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3507                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3508                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$444       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3511                      .dwattr $C$DW$444, DW_AT_name("flag_enableDcBusComp")
    3512                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3513                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3514                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3515              $C$DW$445       .dwtag  DW_TAG_member
    3516                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    3517                      .dwattr $C$DW$445, DW_AT_name("flag_enablePowerWarp")
    3518                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3519                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3520                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   70

    3521              $C$DW$446       .dwtag  DW_TAG_member
    3522                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3523                      .dwattr $C$DW$446, DW_AT_name("flag_enableOffset")
    3524                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_flag_enableOffset")
    3525                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3526                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3527              $C$DW$447       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    3529                      .dwattr $C$DW$447, DW_AT_name("flag_enableSpeedCtrl")
    3530                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3531                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3532                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$448       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    3535                      .dwattr $C$DW$448, DW_AT_name("flag_enableUserMotorParams")
    3536                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3537                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3538                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$449       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
    3541                      .dwattr $C$DW$449, DW_AT_name("Idq_offset_pu")
    3542                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3543                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3544                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$450       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$55)
    3547                      .dwattr $C$DW$450, DW_AT_name("Vdq_offset_pu")
    3548                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3549                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3550                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$451       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    3553                      .dwattr $C$DW$451, DW_AT_name("angle_pu")
    3554                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_angle_pu")
    3555                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3556                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3557              $C$DW$452       .dwtag  DW_TAG_member
    3558                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    3559                      .dwattr $C$DW$452, DW_AT_name("speed_ref_pu")
    3560                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_speed_ref_pu")
    3561                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3562                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3563              $C$DW$453       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    3565                      .dwattr $C$DW$453, DW_AT_name("speed_fb_pu")
    3566                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_speed_fb_pu")
    3567                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3568                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3569              $C$DW$454       .dwtag  DW_TAG_member
    3570                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    3571                      .dwattr $C$DW$454, DW_AT_name("speed_outMax_pu")
    3572                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3573                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3574                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$455       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   71

    3576                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3577                      .dwattr $C$DW$455, DW_AT_name("flag_enableCurrentCtrl")
    3578                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3579                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3580                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3581                      .dwendtag $C$DW$T$57
    3582              
    3583              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3584                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3585                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3586              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3587                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3588                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3589              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3590                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3591                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3592              $C$DW$456       .dwtag  DW_TAG_TI_far_type
    3593                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$87)
    3594              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3595                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$456)
    3596              
    3597              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3598                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3599                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3600              $C$DW$457       .dwtag  DW_TAG_member
    3601                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$21)
    3602                      .dwattr $C$DW$457, DW_AT_name("rsvd")
    3603                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd")
    3604                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3605                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3606              $C$DW$458       .dwtag  DW_TAG_member
    3607                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$59)
    3608                      .dwattr $C$DW$458, DW_AT_name("targetProc")
    3609                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_targetProc")
    3610                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3611                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3612              $C$DW$459       .dwtag  DW_TAG_member
    3613                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    3614                      .dwattr $C$DW$459, DW_AT_name("major")
    3615                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_major")
    3616                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3617                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3618              $C$DW$460       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
    3620                      .dwattr $C$DW$460, DW_AT_name("minor")
    3621                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_minor")
    3622                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3623                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3624                      .dwendtag $C$DW$T$60
    3625              
    3626              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3627                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3628                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3629              
    3630              $C$DW$T$19      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   72

    3631                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3632                      .dwattr $C$DW$T$19, DW_AT_declaration
    3633                      .dwendtag $C$DW$T$19
    3634              
    3635              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3636                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3637                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3638              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3639                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3640                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3641              
    3642              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3643                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3644                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3645              $C$DW$461       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    3647                      .dwattr $C$DW$461, DW_AT_name("sinTh")
    3648                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_sinTh")
    3649                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3650                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$462       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    3653                      .dwattr $C$DW$462, DW_AT_name("cosTh")
    3654                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_cosTh")
    3655                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3656                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3657                      .dwendtag $C$DW$T$61
    3658              
    3659              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3660                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3661                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3662              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3663                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3664                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3665              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3666                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3667                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3668              
    3669              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3670                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3671                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3672              $C$DW$463       .dwtag  DW_TAG_member
    3673                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$62)
    3674                      .dwattr $C$DW$463, DW_AT_name("value")
    3675                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_value")
    3676                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3677                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3678                      .dwendtag $C$DW$T$63
    3679              
    3680              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3681                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3682                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3683              
    3684              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3685                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   73

    3686                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3687              $C$DW$464       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$65)
    3689                      .dwattr $C$DW$464, DW_AT_name("type")
    3690                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_type")
    3691                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3692                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$465       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$53)
    3695                      .dwattr $C$DW$465, DW_AT_name("numPolePairs")
    3696                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numPolePairs")
    3697                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3698                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$466       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3701                      .dwattr $C$DW$466, DW_AT_name("Lr_H")
    3702                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Lr_H")
    3703                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3704                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$467       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3707                      .dwattr $C$DW$467, DW_AT_name("Ls_d_H")
    3708                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Ls_d_H")
    3709                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3710                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3711              $C$DW$468       .dwtag  DW_TAG_member
    3712                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3713                      .dwattr $C$DW$468, DW_AT_name("Ls_q_H")
    3714                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Ls_q_H")
    3715                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3716                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3717              $C$DW$469       .dwtag  DW_TAG_member
    3718                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3719                      .dwattr $C$DW$469, DW_AT_name("Rr_Ohm")
    3720                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Rr_Ohm")
    3721                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3722                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$470       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3725                      .dwattr $C$DW$470, DW_AT_name("Rs_Ohm")
    3726                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Rs_Ohm")
    3727                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3728                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$471       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3731                      .dwattr $C$DW$471, DW_AT_name("ratedFlux_VpHz")
    3732                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3733                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3734                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3735                      .dwendtag $C$DW$T$66
    3736              
    3737              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3738                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3739                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3740              
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   74

    3741              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3742                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3743                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3744              $C$DW$472       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3746                      .dwattr $C$DW$472, DW_AT_name("sinTh")
    3747                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_sinTh")
    3748                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3750              $C$DW$473       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3752                      .dwattr $C$DW$473, DW_AT_name("cosTh")
    3753                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_cosTh")
    3754                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3755                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3756                      .dwendtag $C$DW$T$67
    3757              
    3758              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3759                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3760                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3761              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3762                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3763                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3764              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3765                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3766                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3767              
    3768              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3769                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3770                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3771              $C$DW$474       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3773                      .dwattr $C$DW$474, DW_AT_name("Kp")
    3774                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_Kp")
    3775                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3776                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$475       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3779                      .dwattr $C$DW$475, DW_AT_name("Ki")
    3780                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_Ki")
    3781                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3782                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$476       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3785                      .dwattr $C$DW$476, DW_AT_name("Kd")
    3786                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_Kd")
    3787                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3788                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$477       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3791                      .dwattr $C$DW$477, DW_AT_name("Ui")
    3792                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_Ui")
    3793                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3794                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$478       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   75

    3796                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3797                      .dwattr $C$DW$478, DW_AT_name("refValue")
    3798                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_refValue")
    3799                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3800                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$479       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3803                      .dwattr $C$DW$479, DW_AT_name("fbackValue")
    3804                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_fbackValue")
    3805                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3806                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$480       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3809                      .dwattr $C$DW$480, DW_AT_name("outMin")
    3810                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_outMin")
    3811                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3812                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$481       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3815                      .dwattr $C$DW$481, DW_AT_name("outMax")
    3816                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_outMax")
    3817                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3818                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3819                      .dwendtag $C$DW$T$68
    3820              
    3821              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3822                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3823                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3824              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3825                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3826                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3827              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3828                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3829                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3830              
    3831              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3832                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3833                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3834              $C$DW$482       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3836                      .dwattr $C$DW$482, DW_AT_name("maxModulation")
    3837                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxModulation")
    3838                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3839                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3840                      .dwendtag $C$DW$T$69
    3841              
    3842              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3843                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3844                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3845              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3846                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3847                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3848              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3849                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3850                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   76

    3851              
    3852              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3853                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3854                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3855              $C$DW$483       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    3857                      .dwattr $C$DW$483, DW_AT_name("targetValue")
    3858                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_targetValue")
    3859                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3860                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$484       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    3863                      .dwattr $C$DW$484, DW_AT_name("intValue")
    3864                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_intValue")
    3865                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3866                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$485       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    3869                      .dwattr $C$DW$485, DW_AT_name("minValue")
    3870                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_minValue")
    3871                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3872                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$486       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    3875                      .dwattr $C$DW$486, DW_AT_name("maxValue")
    3876                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxValue")
    3877                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3878                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$487       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    3881                      .dwattr $C$DW$487, DW_AT_name("maxDelta")
    3882                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_maxDelta")
    3883                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3884                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3885                      .dwendtag $C$DW$T$70
    3886              
    3887              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3888                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3889                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3890              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3891                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3892                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3893              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3894                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3895                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3896              
    3897              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3898                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3899                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3900              $C$DW$488       .dwtag  DW_TAG_member
    3901                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    3902                      .dwattr $C$DW$488, DW_AT_name("iqFullScaleCurrent_A")
    3903                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3904                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3905                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   77

    3906              $C$DW$489       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    3908                      .dwattr $C$DW$489, DW_AT_name("iqFullScaleVoltage_V")
    3909                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3910                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3911                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$490       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    3914                      .dwattr $C$DW$490, DW_AT_name("iqFullScaleFreq_Hz")
    3915                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3916                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3917                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$491       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$53)
    3920                      .dwattr $C$DW$491, DW_AT_name("numIsrTicksPerCtrlTick")
    3921                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3922                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3923                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$492       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3926                      .dwattr $C$DW$492, DW_AT_name("numCtrlTicksPerCurrentTick")
    3927                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3928                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3929                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$493       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$53)
    3932                      .dwattr $C$DW$493, DW_AT_name("numCtrlTicksPerEstTick")
    3933                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3934                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3935                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$494       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    3938                      .dwattr $C$DW$494, DW_AT_name("numCtrlTicksPerSpeedTick")
    3939                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3940                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3941                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$495       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    3944                      .dwattr $C$DW$495, DW_AT_name("numCtrlTicksPerTrajTick")
    3945                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3946                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3947                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3948              $C$DW$496       .dwtag  DW_TAG_member
    3949                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    3950                      .dwattr $C$DW$496, DW_AT_name("numCurrentSensors")
    3951                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_numCurrentSensors")
    3952                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3953                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3954              $C$DW$497       .dwtag  DW_TAG_member
    3955                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
    3956                      .dwattr $C$DW$497, DW_AT_name("numVoltageSensors")
    3957                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_numVoltageSensors")
    3958                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3959                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$498       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   78

    3961                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3962                      .dwattr $C$DW$498, DW_AT_name("offsetPole_rps")
    3963                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_offsetPole_rps")
    3964                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3965                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$499       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3968                      .dwattr $C$DW$499, DW_AT_name("fluxPole_rps")
    3969                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_fluxPole_rps")
    3970                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3971                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3972              $C$DW$500       .dwtag  DW_TAG_member
    3973                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3974                      .dwattr $C$DW$500, DW_AT_name("zeroSpeedLimit")
    3975                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3976                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3977                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3978              $C$DW$501       .dwtag  DW_TAG_member
    3979                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3980                      .dwattr $C$DW$501, DW_AT_name("forceAngleFreq_Hz")
    3981                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3982                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3983                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3984              $C$DW$502       .dwtag  DW_TAG_member
    3985                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3986                      .dwattr $C$DW$502, DW_AT_name("maxAccel_Hzps")
    3987                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3988                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3989                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3990              $C$DW$503       .dwtag  DW_TAG_member
    3991                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3992                      .dwattr $C$DW$503, DW_AT_name("maxAccel_est_Hzps")
    3993                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3994                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3995                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3996              $C$DW$504       .dwtag  DW_TAG_member
    3997                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3998                      .dwattr $C$DW$504, DW_AT_name("directionPole_rps")
    3999                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_directionPole_rps")
    4000                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4001                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$505       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    4004                      .dwattr $C$DW$505, DW_AT_name("speedPole_rps")
    4005                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_speedPole_rps")
    4006                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4007                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4008              $C$DW$506       .dwtag  DW_TAG_member
    4009                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    4010                      .dwattr $C$DW$506, DW_AT_name("dcBusPole_rps")
    4011                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4012                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4013                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4014              $C$DW$507       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   79

    4016                      .dwattr $C$DW$507, DW_AT_name("fluxFraction")
    4017                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_fluxFraction")
    4018                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4019                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$508       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    4022                      .dwattr $C$DW$508, DW_AT_name("indEst_speedMaxFraction")
    4023                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4024                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4025                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4026              $C$DW$509       .dwtag  DW_TAG_member
    4027                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    4028                      .dwattr $C$DW$509, DW_AT_name("powerWarpGain")
    4029                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_powerWarpGain")
    4030                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4031                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4032              $C$DW$510       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$53)
    4034                      .dwattr $C$DW$510, DW_AT_name("systemFreq_MHz")
    4035                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4036                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4037                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$511       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    4040                      .dwattr $C$DW$511, DW_AT_name("pwmPeriod_usec")
    4041                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4042                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4043                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$512       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    4046                      .dwattr $C$DW$512, DW_AT_name("voltage_sf")
    4047                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_voltage_sf")
    4048                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4049                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$513       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    4052                      .dwattr $C$DW$513, DW_AT_name("current_sf")
    4053                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_current_sf")
    4054                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4055                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$514       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4058                      .dwattr $C$DW$514, DW_AT_name("voltageFilterPole_rps")
    4059                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4060                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4061                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$515       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    4064                      .dwattr $C$DW$515, DW_AT_name("maxVsMag_pu")
    4065                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4066                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4067                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$516       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    4070                      .dwattr $C$DW$516, DW_AT_name("estKappa")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   80

    4071                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_estKappa")
    4072                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4073                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$517       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$65)
    4076                      .dwattr $C$DW$517, DW_AT_name("motor_type")
    4077                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_type")
    4078                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4079                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$518       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$53)
    4082                      .dwattr $C$DW$518, DW_AT_name("motor_numPolePairs")
    4083                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4084                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4085                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$519       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    4088                      .dwattr $C$DW$519, DW_AT_name("motor_ratedFlux")
    4089                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4090                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4091                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$520       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4094                      .dwattr $C$DW$520, DW_AT_name("motor_Rr")
    4095                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_motor_Rr")
    4096                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4097                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$521       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4100                      .dwattr $C$DW$521, DW_AT_name("motor_Rs")
    4101                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_motor_Rs")
    4102                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4103                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$522       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4106                      .dwattr $C$DW$522, DW_AT_name("motor_Ls_d")
    4107                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_motor_Ls_d")
    4108                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4109                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$523       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4112                      .dwattr $C$DW$523, DW_AT_name("motor_Ls_q")
    4113                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_motor_Ls_q")
    4114                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4115                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$524       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4118                      .dwattr $C$DW$524, DW_AT_name("maxCurrent")
    4119                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_maxCurrent")
    4120                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4121                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$525       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4124                      .dwattr $C$DW$525, DW_AT_name("maxCurrent_resEst")
    4125                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_maxCurrent_resEst")
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   81

    4126                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4127                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$526       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4130                      .dwattr $C$DW$526, DW_AT_name("maxCurrent_indEst")
    4131                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4132                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4133                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$527       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4136                      .dwattr $C$DW$527, DW_AT_name("maxCurrentSlope")
    4137                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4138                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4139                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$528       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4142                      .dwattr $C$DW$528, DW_AT_name("maxCurrentSlope_powerWarp")
    4143                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4144                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4145                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$529       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4148                      .dwattr $C$DW$529, DW_AT_name("IdRated")
    4149                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_IdRated")
    4150                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4151                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$530       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$54)
    4154                      .dwattr $C$DW$530, DW_AT_name("IdRatedFraction_indEst")
    4155                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4156                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4157                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$531       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$54)
    4160                      .dwattr $C$DW$531, DW_AT_name("IdRatedFraction_ratedFlux")
    4161                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4162                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4163                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$532       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$54)
    4166                      .dwattr $C$DW$532, DW_AT_name("IdRated_delta")
    4167                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_IdRated_delta")
    4168                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4169                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$533       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$54)
    4172                      .dwattr $C$DW$533, DW_AT_name("fluxEstFreq_Hz")
    4173                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4174                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4175                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$534       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$52)
    4178                      .dwattr $C$DW$534, DW_AT_name("ctrlWaitTime")
    4179                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4180                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
TMS320C2000 Assembler PC v6.4.11 Mon Sep 05 19:08:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3300010                            PAGE   82

    4181                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$535       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$71)
    4184                      .dwattr $C$DW$535, DW_AT_name("estWaitTime")
    4185                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_estWaitTime")
    4186                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4187                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
