TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Wed Nov 23 09:28:12 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("WDOG_disable")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_WDOG_disable")

   10810                      .dwendtag $C$DW$T$332
   10811              
   10812              $C$DW$T$333     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
   10813                      .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$332)
   10814                      .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   10815              $C$DW$1848      .dwtag  DW_TAG_TI_far_type
   10816                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$333)
   10817              $C$DW$T$334     .dwtag  DW_TAG_const_type
   10818                      .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$1848)
   10819              
   10820              $C$DW$T$335     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  208

   10821                      .dwattr $C$DW$T$335, DW_AT_byte_size(0x01)
   10822              $C$DW$1849      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
   10823              $C$DW$1850      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
   10824              $C$DW$1851      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
   10825                      .dwendtag $C$DW$T$335
   10826              
   10827              $C$DW$T$336     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
   10828                      .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$335)
   10829                      .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
   10830              $C$DW$1852      .dwtag  DW_TAG_TI_far_type
   10831                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$336)
   10832              $C$DW$T$337     .dwtag  DW_TAG_const_type
   10833                      .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$1852)
   10834              
   10835              $C$DW$T$338     .dwtag  DW_TAG_enumeration_type
   10836                      .dwattr $C$DW$T$338, DW_AT_byte_size(0x01)
   10837              $C$DW$1853      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
   10838              $C$DW$1854      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
   10839              $C$DW$1855      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
   10840                      .dwendtag $C$DW$T$338
   10841              
   10842              $C$DW$T$339     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
   10843                      .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$338)
   10844                      .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   10845              $C$DW$1856      .dwtag  DW_TAG_TI_far_type
   10846                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$339)
   10847              $C$DW$T$340     .dwtag  DW_TAG_const_type
   10848                      .dwattr $C$DW$T$340, DW_AT_type(*$C$DW$1856)
   10849              
   10850              $C$DW$T$341     .dwtag  DW_TAG_enumeration_type
   10851                      .dwattr $C$DW$T$341, DW_AT_byte_size(0x01)
   10852              $C$DW$1857      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
   10853              $C$DW$1858      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
   10854              $C$DW$1859      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
   10855              $C$DW$1860      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
   10856              $C$DW$1861      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
   10857              $C$DW$1862      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
   10858              $C$DW$1863      .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
   10859                      .dwendtag $C$DW$T$341
   10860              
   10861              $C$DW$T$342     .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
   10862                      .dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$341)
   10863                      .dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
   10864              
   10865              $C$DW$T$343     .dwtag  DW_TAG_enumeration_type
   10866                      .dwattr $C$DW$T$343, DW_AT_byte_size(0x01)
   10867              $C$DW$1864      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   10868              $C$DW$1865      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   10869                      .dwendtag $C$DW$T$343
   10870              
   10871              $C$DW$T$344     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   10872                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$343)
   10873                      .dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
   10874              
   10875              $C$DW$T$30      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  209

   10876                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
   10877                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
   10878              $C$DW$1866      .dwtag  DW_TAG_member
   10879                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$24)
   10880                      .dwattr $C$DW$1866, DW_AT_name("ADCRESULT")
   10881                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_ADCRESULT")
   10882                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10883                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10884              $C$DW$1867      .dwtag  DW_TAG_member
   10885                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$25)
   10886                      .dwattr $C$DW$1867, DW_AT_name("resvd_1")
   10887                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_resvd_1")
   10888                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   10889                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10890              $C$DW$1868      .dwtag  DW_TAG_member
   10891                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$23)
   10892                      .dwattr $C$DW$1868, DW_AT_name("ADCCTL1")
   10893                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_ADCCTL1")
   10894                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   10895                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10896              $C$DW$1869      .dwtag  DW_TAG_member
   10897                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$23)
   10898                      .dwattr $C$DW$1869, DW_AT_name("ADCCTL2")
   10899                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_ADCCTL2")
   10900                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   10901                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10902              $C$DW$1870      .dwtag  DW_TAG_member
   10903                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$26)
   10904                      .dwattr $C$DW$1870, DW_AT_name("rsvd_2")
   10905                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_rsvd_2")
   10906                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   10907                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10908              $C$DW$1871      .dwtag  DW_TAG_member
   10909                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$23)
   10910                      .dwattr $C$DW$1871, DW_AT_name("ADCINTFLG")
   10911                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_ADCINTFLG")
   10912                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   10913                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10914              $C$DW$1872      .dwtag  DW_TAG_member
   10915                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$23)
   10916                      .dwattr $C$DW$1872, DW_AT_name("ADCINTFLGCLR")
   10917                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   10918                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   10919                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10920              $C$DW$1873      .dwtag  DW_TAG_member
   10921                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$23)
   10922                      .dwattr $C$DW$1873, DW_AT_name("ADCINTOVF")
   10923                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_ADCINTOVF")
   10924                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   10925                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10926              $C$DW$1874      .dwtag  DW_TAG_member
   10927                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$23)
   10928                      .dwattr $C$DW$1874, DW_AT_name("ADCINTOVFCLR")
   10929                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   10930                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  210

   10931                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10932              $C$DW$1875      .dwtag  DW_TAG_member
   10933                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$27)
   10934                      .dwattr $C$DW$1875, DW_AT_name("INTSELxNy")
   10935                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_INTSELxNy")
   10936                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   10937                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10938              $C$DW$1876      .dwtag  DW_TAG_member
   10939                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$28)
   10940                      .dwattr $C$DW$1876, DW_AT_name("rsvd_3")
   10941                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_rsvd_3")
   10942                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   10943                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10944              $C$DW$1877      .dwtag  DW_TAG_member
   10945                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$23)
   10946                      .dwattr $C$DW$1877, DW_AT_name("SOCPRICTRL")
   10947                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_SOCPRICTRL")
   10948                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   10949                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10950              $C$DW$1878      .dwtag  DW_TAG_member
   10951                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$23)
   10952                      .dwattr $C$DW$1878, DW_AT_name("rsvd_4")
   10953                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_rsvd_4")
   10954                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   10955                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10956              $C$DW$1879      .dwtag  DW_TAG_member
   10957                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$23)
   10958                      .dwattr $C$DW$1879, DW_AT_name("ADCSAMPLEMODE")
   10959                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   10960                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   10961                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10962              $C$DW$1880      .dwtag  DW_TAG_member
   10963                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$23)
   10964                      .dwattr $C$DW$1880, DW_AT_name("rsvd_5")
   10965                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_rsvd_5")
   10966                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   10967                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10968              $C$DW$1881      .dwtag  DW_TAG_member
   10969                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$23)
   10970                      .dwattr $C$DW$1881, DW_AT_name("ADCINTSOCSEL1")
   10971                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   10972                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   10973                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
   10974              $C$DW$1882      .dwtag  DW_TAG_member
   10975                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$23)
   10976                      .dwattr $C$DW$1882, DW_AT_name("ADCINTSOCSEL2")
   10977                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   10978                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   10979                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10980              $C$DW$1883      .dwtag  DW_TAG_member
   10981                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$26)
   10982                      .dwattr $C$DW$1883, DW_AT_name("rsvd_6")
   10983                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_rsvd_6")
   10984                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   10985                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  211

   10986              $C$DW$1884      .dwtag  DW_TAG_member
   10987                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$23)
   10988                      .dwattr $C$DW$1884, DW_AT_name("ADCSOCFLG1")
   10989                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   10990                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   10991                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10992              $C$DW$1885      .dwtag  DW_TAG_member
   10993                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$23)
   10994                      .dwattr $C$DW$1885, DW_AT_name("rsvd_7")
   10995                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_rsvd_7")
   10996                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   10997                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10998              $C$DW$1886      .dwtag  DW_TAG_member
   10999                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$23)
   11000                      .dwattr $C$DW$1886, DW_AT_name("ADCSOCFRC1")
   11001                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   11002                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   11003                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   11004              $C$DW$1887      .dwtag  DW_TAG_member
   11005                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$23)
   11006                      .dwattr $C$DW$1887, DW_AT_name("rsvd_8")
   11007                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_rsvd_8")
   11008                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   11009                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   11010              $C$DW$1888      .dwtag  DW_TAG_member
   11011                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$23)
   11012                      .dwattr $C$DW$1888, DW_AT_name("ADCSOCOVF1")
   11013                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   11014                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   11015                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   11016              $C$DW$1889      .dwtag  DW_TAG_member
   11017                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$23)
   11018                      .dwattr $C$DW$1889, DW_AT_name("rsvd_9")
   11019                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_rsvd_9")
   11020                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   11021                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   11022              $C$DW$1890      .dwtag  DW_TAG_member
   11023                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$23)
   11024                      .dwattr $C$DW$1890, DW_AT_name("ADCSOCOVFCLR1")
   11025                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   11026                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   11027                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   11028              $C$DW$1891      .dwtag  DW_TAG_member
   11029                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$23)
   11030                      .dwattr $C$DW$1891, DW_AT_name("rsvd_10")
   11031                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_rsvd_10")
   11032                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   11033                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   11034              $C$DW$1892      .dwtag  DW_TAG_member
   11035                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$24)
   11036                      .dwattr $C$DW$1892, DW_AT_name("ADCSOCxCTL")
   11037                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   11038                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   11039                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   11040              $C$DW$1893      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  212

   11041                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$24)
   11042                      .dwattr $C$DW$1893, DW_AT_name("rsvd_11")
   11043                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_rsvd_11")
   11044                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   11045                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   11046              $C$DW$1894      .dwtag  DW_TAG_member
   11047                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$23)
   11048                      .dwattr $C$DW$1894, DW_AT_name("ADCREFTRIM")
   11049                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_ADCREFTRIM")
   11050                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   11051                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   11052              $C$DW$1895      .dwtag  DW_TAG_member
   11053                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$23)
   11054                      .dwattr $C$DW$1895, DW_AT_name("ADCOFFTRIM")
   11055                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   11056                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   11057                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   11058              $C$DW$1896      .dwtag  DW_TAG_member
   11059                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$29)
   11060                      .dwattr $C$DW$1896, DW_AT_name("resvd_12")
   11061                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_resvd_12")
   11062                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   11063                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   11064              $C$DW$1897      .dwtag  DW_TAG_member
   11065                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$23)
   11066                      .dwattr $C$DW$1897, DW_AT_name("ADCREV")
   11067                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_ADCREV")
   11068                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   11069                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   11070                      .dwendtag $C$DW$T$30
   11071              
   11072              $C$DW$T$346     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   11073                      .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$30)
   11074                      .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
   11075              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
   11076                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$30)
   11077                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
   11078              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   11079                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
   11080                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
   11081              
   11082              $C$DW$T$32      .dwtag  DW_TAG_structure_type
   11083                      .dwattr $C$DW$T$32, DW_AT_name("_CLK_Obj_")
   11084                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x11)
   11085              $C$DW$1898      .dwtag  DW_TAG_member
   11086                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$23)
   11087                      .dwattr $C$DW$1898, DW_AT_name("XCLK")
   11088                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_XCLK")
   11089                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11090                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   11091              $C$DW$1899      .dwtag  DW_TAG_member
   11092                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$23)
   11093                      .dwattr $C$DW$1899, DW_AT_name("rsvd_1")
   11094                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_rsvd_1")
   11095                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  213

   11096                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   11097              $C$DW$1900      .dwtag  DW_TAG_member
   11098                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$23)
   11099                      .dwattr $C$DW$1900, DW_AT_name("CLKCTL")
   11100                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_CLKCTL")
   11101                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11102                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   11103              $C$DW$1901      .dwtag  DW_TAG_member
   11104                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$31)
   11105                      .dwattr $C$DW$1901, DW_AT_name("rsvd_2")
   11106                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_rsvd_2")
   11107                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11108                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   11109              $C$DW$1902      .dwtag  DW_TAG_member
   11110                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$23)
   11111                      .dwattr $C$DW$1902, DW_AT_name("LOSPCP")
   11112                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_LOSPCP")
   11113                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11114                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   11115              $C$DW$1903      .dwtag  DW_TAG_member
   11116                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$23)
   11117                      .dwattr $C$DW$1903, DW_AT_name("PCLKCR0")
   11118                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_PCLKCR0")
   11119                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11120                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   11121              $C$DW$1904      .dwtag  DW_TAG_member
   11122                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$23)
   11123                      .dwattr $C$DW$1904, DW_AT_name("PCLKCR1")
   11124                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_PCLKCR1")
   11125                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11126                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   11127              $C$DW$1905      .dwtag  DW_TAG_member
   11128                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$26)
   11129                      .dwattr $C$DW$1905, DW_AT_name("rsvd_3")
   11130                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_rsvd_3")
   11131                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11132                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   11133              $C$DW$1906      .dwtag  DW_TAG_member
   11134                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$23)
   11135                      .dwattr $C$DW$1906, DW_AT_name("PCLKCR3")
   11136                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_PCLKCR3")
   11137                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11138                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   11139                      .dwendtag $C$DW$T$32
   11140              
   11141              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
   11142                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$32)
   11143                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
   11144              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   11145                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
   11146                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
   11147              
   11148              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   11149                      .dwattr $C$DW$T$34, DW_AT_name("_CPU_Obj_")
   11150                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  214

   11151              $C$DW$1907      .dwtag  DW_TAG_member
   11152                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$33)
   11153                      .dwattr $C$DW$1907, DW_AT_name("tmp")
   11154                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_tmp")
   11155                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11156                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   11157                      .dwendtag $C$DW$T$34
   11158              
   11159              $C$DW$T$355     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   11160                      .dwattr $C$DW$T$355, DW_AT_type(*$C$DW$T$34)
   11161                      .dwattr $C$DW$T$355, DW_AT_language(DW_LANG_C)
   11162              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
   11163                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$34)
   11164                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
   11165              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   11166                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
   11167                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   11168              
   11169              $C$DW$T$37      .dwtag  DW_TAG_structure_type
   11170                      .dwattr $C$DW$T$37, DW_AT_name("_CTRL_Version_")
   11171                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
   11172              $C$DW$1908      .dwtag  DW_TAG_member
   11173                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$22)
   11174                      .dwattr $C$DW$1908, DW_AT_name("rsvd")
   11175                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_rsvd")
   11176                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11177                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   11178              $C$DW$1909      .dwtag  DW_TAG_member
   11179                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$36)
   11180                      .dwattr $C$DW$1909, DW_AT_name("targetProc")
   11181                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_targetProc")
   11182                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11183                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   11184              $C$DW$1910      .dwtag  DW_TAG_member
   11185                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$22)
   11186                      .dwattr $C$DW$1910, DW_AT_name("major")
   11187                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_major")
   11188                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11189                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   11190              $C$DW$1911      .dwtag  DW_TAG_member
   11191                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$22)
   11192                      .dwattr $C$DW$1911, DW_AT_name("minor")
   11193                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_minor")
   11194                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11195                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   11196                      .dwendtag $C$DW$T$37
   11197              
   11198              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
   11199                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$37)
   11200                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
   11201              
   11202              $C$DW$T$45      .dwtag  DW_TAG_structure_type
   11203                      .dwattr $C$DW$T$45, DW_AT_name("_DRV8301_Obj_")
   11204                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
   11205              $C$DW$1912      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  215

   11206                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$39)
   11207                      .dwattr $C$DW$1912, DW_AT_name("spiHandle")
   11208                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_spiHandle")
   11209                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11210                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   11211              $C$DW$1913      .dwtag  DW_TAG_member
   11212                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$41)
   11213                      .dwattr $C$DW$1913, DW_AT_name("gpioHandle")
   11214                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_gpioHandle")
   11215                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11216                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   11217              $C$DW$1914      .dwtag  DW_TAG_member
   11218                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$43)
   11219                      .dwattr $C$DW$1914, DW_AT_name("gpioNumber")
   11220                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_gpioNumber")
   11221                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11222                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   11223              $C$DW$1915      .dwtag  DW_TAG_member
   11224                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$44)
   11225                      .dwattr $C$DW$1915, DW_AT_name("RxTimeOut")
   11226                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_RxTimeOut")
   11227                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11228                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   11229              $C$DW$1916      .dwtag  DW_TAG_member
   11230                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$44)
   11231                      .dwattr $C$DW$1916, DW_AT_name("enableTimeOut")
   11232                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_enableTimeOut")
   11233                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11234                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   11235                      .dwendtag $C$DW$T$45
   11236              
   11237              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
   11238                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$45)
   11239                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   11240              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
   11241                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$45)
   11242                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
   11243              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
   11244                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
   11245                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
   11246              
   11247              $C$DW$T$56      .dwtag  DW_TAG_structure_type
   11248                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
   11249                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x05)
   11250              $C$DW$1917      .dwtag  DW_TAG_member
   11251                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$47)
   11252                      .dwattr $C$DW$1917, DW_AT_name("DRV8301_CURRENT")
   11253                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
   11254                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11255                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   11256              $C$DW$1918      .dwtag  DW_TAG_member
   11257                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$49)
   11258                      .dwattr $C$DW$1918, DW_AT_name("DRV8301_RESET")
   11259                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_DRV8301_RESET")
   11260                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  216

   11261                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   11262              $C$DW$1919      .dwtag  DW_TAG_member
   11263                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$51)
   11264                      .dwattr $C$DW$1919, DW_AT_name("PWM_MODE")
   11265                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_PWM_MODE")
   11266                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11267                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   11268              $C$DW$1920      .dwtag  DW_TAG_member
   11269                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$53)
   11270                      .dwattr $C$DW$1920, DW_AT_name("OC_MODE")
   11271                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_OC_MODE")
   11272                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11273                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   11274              $C$DW$1921      .dwtag  DW_TAG_member
   11275                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$55)
   11276                      .dwattr $C$DW$1921, DW_AT_name("OC_ADJ_SET")
   11277                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_OC_ADJ_SET")
   11278                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11279                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   11280                      .dwendtag $C$DW$T$56
   11281              
   11282              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
   11283                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$56)
   11284                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
   11285              
   11286              $C$DW$T$65      .dwtag  DW_TAG_structure_type
   11287                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
   11288                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
   11289              $C$DW$1922      .dwtag  DW_TAG_member
   11290                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$58)
   11291                      .dwattr $C$DW$1922, DW_AT_name("OCTW_SET")
   11292                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_OCTW_SET")
   11293                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11294                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   11295              $C$DW$1923      .dwtag  DW_TAG_member
   11296                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$60)
   11297                      .dwattr $C$DW$1923, DW_AT_name("GAIN")
   11298                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_GAIN")
   11299                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11300                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   11301              $C$DW$1924      .dwtag  DW_TAG_member
   11302                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$62)
   11303                      .dwattr $C$DW$1924, DW_AT_name("DC_CAL_CH1p2")
   11304                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
   11305                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11306                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
   11307              $C$DW$1925      .dwtag  DW_TAG_member
   11308                      .dwattr $C$DW$1925, DW_AT_type(*$C$DW$T$64)
   11309                      .dwattr $C$DW$1925, DW_AT_name("OC_TOFF")
   11310                      .dwattr $C$DW$1925, DW_AT_TI_symbol_name("_OC_TOFF")
   11311                      .dwattr $C$DW$1925, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11312                      .dwattr $C$DW$1925, DW_AT_accessibility(DW_ACCESS_public)
   11313                      .dwendtag $C$DW$T$65
   11314              
   11315              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  217

   11316                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$65)
   11317                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
   11318              
   11319              $C$DW$T$66      .dwtag  DW_TAG_structure_type
   11320                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
   11321                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0b)
   11322              $C$DW$1926      .dwtag  DW_TAG_member
   11323                      .dwattr $C$DW$1926, DW_AT_type(*$C$DW$T$44)
   11324                      .dwattr $C$DW$1926, DW_AT_name("FAULT")
   11325                      .dwattr $C$DW$1926, DW_AT_TI_symbol_name("_FAULT")
   11326                      .dwattr $C$DW$1926, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11327                      .dwattr $C$DW$1926, DW_AT_accessibility(DW_ACCESS_public)
   11328              $C$DW$1927      .dwtag  DW_TAG_member
   11329                      .dwattr $C$DW$1927, DW_AT_type(*$C$DW$T$44)
   11330                      .dwattr $C$DW$1927, DW_AT_name("GVDD_UV")
   11331                      .dwattr $C$DW$1927, DW_AT_TI_symbol_name("_GVDD_UV")
   11332                      .dwattr $C$DW$1927, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11333                      .dwattr $C$DW$1927, DW_AT_accessibility(DW_ACCESS_public)
   11334              $C$DW$1928      .dwtag  DW_TAG_member
   11335                      .dwattr $C$DW$1928, DW_AT_type(*$C$DW$T$44)
   11336                      .dwattr $C$DW$1928, DW_AT_name("PVDD_UV")
   11337                      .dwattr $C$DW$1928, DW_AT_TI_symbol_name("_PVDD_UV")
   11338                      .dwattr $C$DW$1928, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11339                      .dwattr $C$DW$1928, DW_AT_accessibility(DW_ACCESS_public)
   11340              $C$DW$1929      .dwtag  DW_TAG_member
   11341                      .dwattr $C$DW$1929, DW_AT_type(*$C$DW$T$44)
   11342                      .dwattr $C$DW$1929, DW_AT_name("OTSD")
   11343                      .dwattr $C$DW$1929, DW_AT_TI_symbol_name("_OTSD")
   11344                      .dwattr $C$DW$1929, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11345                      .dwattr $C$DW$1929, DW_AT_accessibility(DW_ACCESS_public)
   11346              $C$DW$1930      .dwtag  DW_TAG_member
   11347                      .dwattr $C$DW$1930, DW_AT_type(*$C$DW$T$44)
   11348                      .dwattr $C$DW$1930, DW_AT_name("OTW")
   11349                      .dwattr $C$DW$1930, DW_AT_TI_symbol_name("_OTW")
   11350                      .dwattr $C$DW$1930, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11351                      .dwattr $C$DW$1930, DW_AT_accessibility(DW_ACCESS_public)
   11352              $C$DW$1931      .dwtag  DW_TAG_member
   11353                      .dwattr $C$DW$1931, DW_AT_type(*$C$DW$T$44)
   11354                      .dwattr $C$DW$1931, DW_AT_name("FETHA_OC")
   11355                      .dwattr $C$DW$1931, DW_AT_TI_symbol_name("_FETHA_OC")
   11356                      .dwattr $C$DW$1931, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11357                      .dwattr $C$DW$1931, DW_AT_accessibility(DW_ACCESS_public)
   11358              $C$DW$1932      .dwtag  DW_TAG_member
   11359                      .dwattr $C$DW$1932, DW_AT_type(*$C$DW$T$44)
   11360                      .dwattr $C$DW$1932, DW_AT_name("FETLA_OC")
   11361                      .dwattr $C$DW$1932, DW_AT_TI_symbol_name("_FETLA_OC")
   11362                      .dwattr $C$DW$1932, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11363                      .dwattr $C$DW$1932, DW_AT_accessibility(DW_ACCESS_public)
   11364              $C$DW$1933      .dwtag  DW_TAG_member
   11365                      .dwattr $C$DW$1933, DW_AT_type(*$C$DW$T$44)
   11366                      .dwattr $C$DW$1933, DW_AT_name("FETHB_OC")
   11367                      .dwattr $C$DW$1933, DW_AT_TI_symbol_name("_FETHB_OC")
   11368                      .dwattr $C$DW$1933, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11369                      .dwattr $C$DW$1933, DW_AT_accessibility(DW_ACCESS_public)
   11370              $C$DW$1934      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  218

   11371                      .dwattr $C$DW$1934, DW_AT_type(*$C$DW$T$44)
   11372                      .dwattr $C$DW$1934, DW_AT_name("FETLB_OC")
   11373                      .dwattr $C$DW$1934, DW_AT_TI_symbol_name("_FETLB_OC")
   11374                      .dwattr $C$DW$1934, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11375                      .dwattr $C$DW$1934, DW_AT_accessibility(DW_ACCESS_public)
   11376              $C$DW$1935      .dwtag  DW_TAG_member
   11377                      .dwattr $C$DW$1935, DW_AT_type(*$C$DW$T$44)
   11378                      .dwattr $C$DW$1935, DW_AT_name("FETHC_OC")
   11379                      .dwattr $C$DW$1935, DW_AT_TI_symbol_name("_FETHC_OC")
   11380                      .dwattr $C$DW$1935, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11381                      .dwattr $C$DW$1935, DW_AT_accessibility(DW_ACCESS_public)
   11382              $C$DW$1936      .dwtag  DW_TAG_member
   11383                      .dwattr $C$DW$1936, DW_AT_type(*$C$DW$T$44)
   11384                      .dwattr $C$DW$1936, DW_AT_name("FETLC_OC")
   11385                      .dwattr $C$DW$1936, DW_AT_TI_symbol_name("_FETLC_OC")
   11386                      .dwattr $C$DW$1936, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11387                      .dwattr $C$DW$1936, DW_AT_accessibility(DW_ACCESS_public)
   11388                      .dwendtag $C$DW$T$66
   11389              
   11390              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
   11391                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$66)
   11392                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
   11393              
   11394              $C$DW$T$67      .dwtag  DW_TAG_structure_type
   11395                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
   11396                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
   11397              $C$DW$1937      .dwtag  DW_TAG_member
   11398                      .dwattr $C$DW$1937, DW_AT_type(*$C$DW$T$44)
   11399                      .dwattr $C$DW$1937, DW_AT_name("GVDD_OV")
   11400                      .dwattr $C$DW$1937, DW_AT_TI_symbol_name("_GVDD_OV")
   11401                      .dwattr $C$DW$1937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11402                      .dwattr $C$DW$1937, DW_AT_accessibility(DW_ACCESS_public)
   11403              $C$DW$1938      .dwtag  DW_TAG_member
   11404                      .dwattr $C$DW$1938, DW_AT_type(*$C$DW$T$22)
   11405                      .dwattr $C$DW$1938, DW_AT_name("DeviceID")
   11406                      .dwattr $C$DW$1938, DW_AT_TI_symbol_name("_DeviceID")
   11407                      .dwattr $C$DW$1938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11408                      .dwattr $C$DW$1938, DW_AT_accessibility(DW_ACCESS_public)
   11409                      .dwendtag $C$DW$T$67
   11410              
   11411              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
   11412                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$67)
   11413                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
   11414              
   11415              $C$DW$T$72      .dwtag  DW_TAG_structure_type
   11416                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Vars_t_")
   11417                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
   11418              $C$DW$1939      .dwtag  DW_TAG_member
   11419                      .dwattr $C$DW$1939, DW_AT_type(*$C$DW$T$68)
   11420                      .dwattr $C$DW$1939, DW_AT_name("Stat_Reg_1")
   11421                      .dwattr $C$DW$1939, DW_AT_TI_symbol_name("_Stat_Reg_1")
   11422                      .dwattr $C$DW$1939, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11423                      .dwattr $C$DW$1939, DW_AT_accessibility(DW_ACCESS_public)
   11424              $C$DW$1940      .dwtag  DW_TAG_member
   11425                      .dwattr $C$DW$1940, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  219

   11426                      .dwattr $C$DW$1940, DW_AT_name("Stat_Reg_2")
   11427                      .dwattr $C$DW$1940, DW_AT_TI_symbol_name("_Stat_Reg_2")
   11428                      .dwattr $C$DW$1940, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11429                      .dwattr $C$DW$1940, DW_AT_accessibility(DW_ACCESS_public)
   11430              $C$DW$1941      .dwtag  DW_TAG_member
   11431                      .dwattr $C$DW$1941, DW_AT_type(*$C$DW$T$70)
   11432                      .dwattr $C$DW$1941, DW_AT_name("Ctrl_Reg_1")
   11433                      .dwattr $C$DW$1941, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
   11434                      .dwattr $C$DW$1941, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11435                      .dwattr $C$DW$1941, DW_AT_accessibility(DW_ACCESS_public)
   11436              $C$DW$1942      .dwtag  DW_TAG_member
   11437                      .dwattr $C$DW$1942, DW_AT_type(*$C$DW$T$71)
   11438                      .dwattr $C$DW$1942, DW_AT_name("Ctrl_Reg_2")
   11439                      .dwattr $C$DW$1942, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
   11440                      .dwattr $C$DW$1942, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11441                      .dwattr $C$DW$1942, DW_AT_accessibility(DW_ACCESS_public)
   11442              $C$DW$1943      .dwtag  DW_TAG_member
   11443                      .dwattr $C$DW$1943, DW_AT_type(*$C$DW$T$44)
   11444                      .dwattr $C$DW$1943, DW_AT_name("SndCmd")
   11445                      .dwattr $C$DW$1943, DW_AT_TI_symbol_name("_SndCmd")
   11446                      .dwattr $C$DW$1943, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11447                      .dwattr $C$DW$1943, DW_AT_accessibility(DW_ACCESS_public)
   11448              $C$DW$1944      .dwtag  DW_TAG_member
   11449                      .dwattr $C$DW$1944, DW_AT_type(*$C$DW$T$44)
   11450                      .dwattr $C$DW$1944, DW_AT_name("RcvCmd")
   11451                      .dwattr $C$DW$1944, DW_AT_TI_symbol_name("_RcvCmd")
   11452                      .dwattr $C$DW$1944, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   11453                      .dwattr $C$DW$1944, DW_AT_accessibility(DW_ACCESS_public)
   11454                      .dwendtag $C$DW$T$72
   11455              
   11456              $C$DW$T$362     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
   11457                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$72)
   11458                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
   11459              $C$DW$T$363     .dwtag  DW_TAG_pointer_type
   11460                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
   11461                      .dwattr $C$DW$T$363, DW_AT_address_class(0x20)
   11462              
   11463              $C$DW$T$74      .dwtag  DW_TAG_structure_type
   11464                      .dwattr $C$DW$T$74, DW_AT_name("_FILTER_FO_")
   11465                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x0a)
   11466              $C$DW$1945      .dwtag  DW_TAG_member
   11467                      .dwattr $C$DW$1945, DW_AT_type(*$C$DW$T$73)
   11468                      .dwattr $C$DW$1945, DW_AT_name("a1")
   11469                      .dwattr $C$DW$1945, DW_AT_TI_symbol_name("_a1")
   11470                      .dwattr $C$DW$1945, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11471                      .dwattr $C$DW$1945, DW_AT_accessibility(DW_ACCESS_public)
   11472              $C$DW$1946      .dwtag  DW_TAG_member
   11473                      .dwattr $C$DW$1946, DW_AT_type(*$C$DW$T$73)
   11474                      .dwattr $C$DW$1946, DW_AT_name("b0")
   11475                      .dwattr $C$DW$1946, DW_AT_TI_symbol_name("_b0")
   11476                      .dwattr $C$DW$1946, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11477                      .dwattr $C$DW$1946, DW_AT_accessibility(DW_ACCESS_public)
   11478              $C$DW$1947      .dwtag  DW_TAG_member
   11479                      .dwattr $C$DW$1947, DW_AT_type(*$C$DW$T$73)
   11480                      .dwattr $C$DW$1947, DW_AT_name("b1")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  220

   11481                      .dwattr $C$DW$1947, DW_AT_TI_symbol_name("_b1")
   11482                      .dwattr $C$DW$1947, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11483                      .dwattr $C$DW$1947, DW_AT_accessibility(DW_ACCESS_public)
   11484              $C$DW$1948      .dwtag  DW_TAG_member
   11485                      .dwattr $C$DW$1948, DW_AT_type(*$C$DW$T$73)
   11486                      .dwattr $C$DW$1948, DW_AT_name("x1")
   11487                      .dwattr $C$DW$1948, DW_AT_TI_symbol_name("_x1")
   11488                      .dwattr $C$DW$1948, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11489                      .dwattr $C$DW$1948, DW_AT_accessibility(DW_ACCESS_public)
   11490              $C$DW$1949      .dwtag  DW_TAG_member
   11491                      .dwattr $C$DW$1949, DW_AT_type(*$C$DW$T$73)
   11492                      .dwattr $C$DW$1949, DW_AT_name("y1")
   11493                      .dwattr $C$DW$1949, DW_AT_TI_symbol_name("_y1")
   11494                      .dwattr $C$DW$1949, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11495                      .dwattr $C$DW$1949, DW_AT_accessibility(DW_ACCESS_public)
   11496                      .dwendtag $C$DW$T$74
   11497              
   11498              $C$DW$T$133     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
   11499                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$74)
   11500                      .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
   11501              
   11502              $C$DW$T$19      .dwtag  DW_TAG_structure_type
   11503                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
   11504                      .dwattr $C$DW$T$19, DW_AT_declaration
   11505                      .dwendtag $C$DW$T$19
   11506              
   11507              $C$DW$T$134     .dwtag  DW_TAG_pointer_type
   11508                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$19)
   11509                      .dwattr $C$DW$T$134, DW_AT_address_class(0x20)
   11510              $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
   11511                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
   11512                      .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
   11513              
   11514              $C$DW$T$75      .dwtag  DW_TAG_structure_type
   11515                      .dwattr $C$DW$T$75, DW_AT_name("_FLASH_Obj_")
   11516                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
   11517              $C$DW$1950      .dwtag  DW_TAG_member
   11518                      .dwattr $C$DW$1950, DW_AT_type(*$C$DW$T$23)
   11519                      .dwattr $C$DW$1950, DW_AT_name("FOPT")
   11520                      .dwattr $C$DW$1950, DW_AT_TI_symbol_name("_FOPT")
   11521                      .dwattr $C$DW$1950, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11522                      .dwattr $C$DW$1950, DW_AT_accessibility(DW_ACCESS_public)
   11523              $C$DW$1951      .dwtag  DW_TAG_member
   11524                      .dwattr $C$DW$1951, DW_AT_type(*$C$DW$T$23)
   11525                      .dwattr $C$DW$1951, DW_AT_name("rsvd_1")
   11526                      .dwattr $C$DW$1951, DW_AT_TI_symbol_name("_rsvd_1")
   11527                      .dwattr $C$DW$1951, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11528                      .dwattr $C$DW$1951, DW_AT_accessibility(DW_ACCESS_public)
   11529              $C$DW$1952      .dwtag  DW_TAG_member
   11530                      .dwattr $C$DW$1952, DW_AT_type(*$C$DW$T$23)
   11531                      .dwattr $C$DW$1952, DW_AT_name("FPWR")
   11532                      .dwattr $C$DW$1952, DW_AT_TI_symbol_name("_FPWR")
   11533                      .dwattr $C$DW$1952, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11534                      .dwattr $C$DW$1952, DW_AT_accessibility(DW_ACCESS_public)
   11535              $C$DW$1953      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  221

   11536                      .dwattr $C$DW$1953, DW_AT_type(*$C$DW$T$23)
   11537                      .dwattr $C$DW$1953, DW_AT_name("FSTATUS")
   11538                      .dwattr $C$DW$1953, DW_AT_TI_symbol_name("_FSTATUS")
   11539                      .dwattr $C$DW$1953, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11540                      .dwattr $C$DW$1953, DW_AT_accessibility(DW_ACCESS_public)
   11541              $C$DW$1954      .dwtag  DW_TAG_member
   11542                      .dwattr $C$DW$1954, DW_AT_type(*$C$DW$T$23)
   11543                      .dwattr $C$DW$1954, DW_AT_name("FSTDBYWAIT")
   11544                      .dwattr $C$DW$1954, DW_AT_TI_symbol_name("_FSTDBYWAIT")
   11545                      .dwattr $C$DW$1954, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11546                      .dwattr $C$DW$1954, DW_AT_accessibility(DW_ACCESS_public)
   11547              $C$DW$1955      .dwtag  DW_TAG_member
   11548                      .dwattr $C$DW$1955, DW_AT_type(*$C$DW$T$23)
   11549                      .dwattr $C$DW$1955, DW_AT_name("FACTIVEWAIT")
   11550                      .dwattr $C$DW$1955, DW_AT_TI_symbol_name("_FACTIVEWAIT")
   11551                      .dwattr $C$DW$1955, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11552                      .dwattr $C$DW$1955, DW_AT_accessibility(DW_ACCESS_public)
   11553              $C$DW$1956      .dwtag  DW_TAG_member
   11554                      .dwattr $C$DW$1956, DW_AT_type(*$C$DW$T$23)
   11555                      .dwattr $C$DW$1956, DW_AT_name("FBANKWAIT")
   11556                      .dwattr $C$DW$1956, DW_AT_TI_symbol_name("_FBANKWAIT")
   11557                      .dwattr $C$DW$1956, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11558                      .dwattr $C$DW$1956, DW_AT_accessibility(DW_ACCESS_public)
   11559              $C$DW$1957      .dwtag  DW_TAG_member
   11560                      .dwattr $C$DW$1957, DW_AT_type(*$C$DW$T$23)
   11561                      .dwattr $C$DW$1957, DW_AT_name("FOTPWAIT")
   11562                      .dwattr $C$DW$1957, DW_AT_TI_symbol_name("_FOTPWAIT")
   11563                      .dwattr $C$DW$1957, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11564                      .dwattr $C$DW$1957, DW_AT_accessibility(DW_ACCESS_public)
   11565                      .dwendtag $C$DW$T$75
   11566              
   11567              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
   11568                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$75)
   11569                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
   11570              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
   11571                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
   11572                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   11573              
   11574              $C$DW$T$80      .dwtag  DW_TAG_structure_type
   11575                      .dwattr $C$DW$T$80, DW_AT_name("_GPIO_Obj_")
   11576                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x6a)
   11577              $C$DW$1958      .dwtag  DW_TAG_member
   11578                      .dwattr $C$DW$1958, DW_AT_type(*$C$DW$T$77)
   11579                      .dwattr $C$DW$1958, DW_AT_name("GPACTRL")
   11580                      .dwattr $C$DW$1958, DW_AT_TI_symbol_name("_GPACTRL")
   11581                      .dwattr $C$DW$1958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11582                      .dwattr $C$DW$1958, DW_AT_accessibility(DW_ACCESS_public)
   11583              $C$DW$1959      .dwtag  DW_TAG_member
   11584                      .dwattr $C$DW$1959, DW_AT_type(*$C$DW$T$77)
   11585                      .dwattr $C$DW$1959, DW_AT_name("GPAQSEL1")
   11586                      .dwattr $C$DW$1959, DW_AT_TI_symbol_name("_GPAQSEL1")
   11587                      .dwattr $C$DW$1959, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11588                      .dwattr $C$DW$1959, DW_AT_accessibility(DW_ACCESS_public)
   11589              $C$DW$1960      .dwtag  DW_TAG_member
   11590                      .dwattr $C$DW$1960, DW_AT_type(*$C$DW$T$77)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  222

   11591                      .dwattr $C$DW$1960, DW_AT_name("GPAQSEL2")
   11592                      .dwattr $C$DW$1960, DW_AT_TI_symbol_name("_GPAQSEL2")
   11593                      .dwattr $C$DW$1960, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11594                      .dwattr $C$DW$1960, DW_AT_accessibility(DW_ACCESS_public)
   11595              $C$DW$1961      .dwtag  DW_TAG_member
   11596                      .dwattr $C$DW$1961, DW_AT_type(*$C$DW$T$77)
   11597                      .dwattr $C$DW$1961, DW_AT_name("GPAMUX1")
   11598                      .dwattr $C$DW$1961, DW_AT_TI_symbol_name("_GPAMUX1")
   11599                      .dwattr $C$DW$1961, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11600                      .dwattr $C$DW$1961, DW_AT_accessibility(DW_ACCESS_public)
   11601              $C$DW$1962      .dwtag  DW_TAG_member
   11602                      .dwattr $C$DW$1962, DW_AT_type(*$C$DW$T$77)
   11603                      .dwattr $C$DW$1962, DW_AT_name("GPAMUX2")
   11604                      .dwattr $C$DW$1962, DW_AT_TI_symbol_name("_GPAMUX2")
   11605                      .dwattr $C$DW$1962, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11606                      .dwattr $C$DW$1962, DW_AT_accessibility(DW_ACCESS_public)
   11607              $C$DW$1963      .dwtag  DW_TAG_member
   11608                      .dwattr $C$DW$1963, DW_AT_type(*$C$DW$T$77)
   11609                      .dwattr $C$DW$1963, DW_AT_name("GPADIR")
   11610                      .dwattr $C$DW$1963, DW_AT_TI_symbol_name("_GPADIR")
   11611                      .dwattr $C$DW$1963, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11612                      .dwattr $C$DW$1963, DW_AT_accessibility(DW_ACCESS_public)
   11613              $C$DW$1964      .dwtag  DW_TAG_member
   11614                      .dwattr $C$DW$1964, DW_AT_type(*$C$DW$T$77)
   11615                      .dwattr $C$DW$1964, DW_AT_name("GPAPUD")
   11616                      .dwattr $C$DW$1964, DW_AT_TI_symbol_name("_GPAPUD")
   11617                      .dwattr $C$DW$1964, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11618                      .dwattr $C$DW$1964, DW_AT_accessibility(DW_ACCESS_public)
   11619              $C$DW$1965      .dwtag  DW_TAG_member
   11620                      .dwattr $C$DW$1965, DW_AT_type(*$C$DW$T$26)
   11621                      .dwattr $C$DW$1965, DW_AT_name("rsvd_1")
   11622                      .dwattr $C$DW$1965, DW_AT_TI_symbol_name("_rsvd_1")
   11623                      .dwattr $C$DW$1965, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11624                      .dwattr $C$DW$1965, DW_AT_accessibility(DW_ACCESS_public)
   11625              $C$DW$1966      .dwtag  DW_TAG_member
   11626                      .dwattr $C$DW$1966, DW_AT_type(*$C$DW$T$77)
   11627                      .dwattr $C$DW$1966, DW_AT_name("GPBCTRL")
   11628                      .dwattr $C$DW$1966, DW_AT_TI_symbol_name("_GPBCTRL")
   11629                      .dwattr $C$DW$1966, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   11630                      .dwattr $C$DW$1966, DW_AT_accessibility(DW_ACCESS_public)
   11631              $C$DW$1967      .dwtag  DW_TAG_member
   11632                      .dwattr $C$DW$1967, DW_AT_type(*$C$DW$T$77)
   11633                      .dwattr $C$DW$1967, DW_AT_name("GPBQSEL1")
   11634                      .dwattr $C$DW$1967, DW_AT_TI_symbol_name("_GPBQSEL1")
   11635                      .dwattr $C$DW$1967, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11636                      .dwattr $C$DW$1967, DW_AT_accessibility(DW_ACCESS_public)
   11637              $C$DW$1968      .dwtag  DW_TAG_member
   11638                      .dwattr $C$DW$1968, DW_AT_type(*$C$DW$T$26)
   11639                      .dwattr $C$DW$1968, DW_AT_name("rsvd_2")
   11640                      .dwattr $C$DW$1968, DW_AT_TI_symbol_name("_rsvd_2")
   11641                      .dwattr $C$DW$1968, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11642                      .dwattr $C$DW$1968, DW_AT_accessibility(DW_ACCESS_public)
   11643              $C$DW$1969      .dwtag  DW_TAG_member
   11644                      .dwattr $C$DW$1969, DW_AT_type(*$C$DW$T$77)
   11645                      .dwattr $C$DW$1969, DW_AT_name("GPBMUX1")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  223

   11646                      .dwattr $C$DW$1969, DW_AT_TI_symbol_name("_GPBMUX1")
   11647                      .dwattr $C$DW$1969, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11648                      .dwattr $C$DW$1969, DW_AT_accessibility(DW_ACCESS_public)
   11649              $C$DW$1970      .dwtag  DW_TAG_member
   11650                      .dwattr $C$DW$1970, DW_AT_type(*$C$DW$T$26)
   11651                      .dwattr $C$DW$1970, DW_AT_name("rsvd_3")
   11652                      .dwattr $C$DW$1970, DW_AT_TI_symbol_name("_rsvd_3")
   11653                      .dwattr $C$DW$1970, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11654                      .dwattr $C$DW$1970, DW_AT_accessibility(DW_ACCESS_public)
   11655              $C$DW$1971      .dwtag  DW_TAG_member
   11656                      .dwattr $C$DW$1971, DW_AT_type(*$C$DW$T$77)
   11657                      .dwattr $C$DW$1971, DW_AT_name("GPBDIR")
   11658                      .dwattr $C$DW$1971, DW_AT_TI_symbol_name("_GPBDIR")
   11659                      .dwattr $C$DW$1971, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11660                      .dwattr $C$DW$1971, DW_AT_accessibility(DW_ACCESS_public)
   11661              $C$DW$1972      .dwtag  DW_TAG_member
   11662                      .dwattr $C$DW$1972, DW_AT_type(*$C$DW$T$77)
   11663                      .dwattr $C$DW$1972, DW_AT_name("GPBPUD")
   11664                      .dwattr $C$DW$1972, DW_AT_TI_symbol_name("_GPBPUD")
   11665                      .dwattr $C$DW$1972, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11666                      .dwattr $C$DW$1972, DW_AT_accessibility(DW_ACCESS_public)
   11667              $C$DW$1973      .dwtag  DW_TAG_member
   11668                      .dwattr $C$DW$1973, DW_AT_type(*$C$DW$T$78)
   11669                      .dwattr $C$DW$1973, DW_AT_name("rsvd_4")
   11670                      .dwattr $C$DW$1973, DW_AT_TI_symbol_name("_rsvd_4")
   11671                      .dwattr $C$DW$1973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
   11672                      .dwattr $C$DW$1973, DW_AT_accessibility(DW_ACCESS_public)
   11673              $C$DW$1974      .dwtag  DW_TAG_member
   11674                      .dwattr $C$DW$1974, DW_AT_type(*$C$DW$T$77)
   11675                      .dwattr $C$DW$1974, DW_AT_name("AIOMUX1")
   11676                      .dwattr $C$DW$1974, DW_AT_TI_symbol_name("_AIOMUX1")
   11677                      .dwattr $C$DW$1974, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
   11678                      .dwattr $C$DW$1974, DW_AT_accessibility(DW_ACCESS_public)
   11679              $C$DW$1975      .dwtag  DW_TAG_member
   11680                      .dwattr $C$DW$1975, DW_AT_type(*$C$DW$T$26)
   11681                      .dwattr $C$DW$1975, DW_AT_name("rsvd_5")
   11682                      .dwattr $C$DW$1975, DW_AT_TI_symbol_name("_rsvd_5")
   11683                      .dwattr $C$DW$1975, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
   11684                      .dwattr $C$DW$1975, DW_AT_accessibility(DW_ACCESS_public)
   11685              $C$DW$1976      .dwtag  DW_TAG_member
   11686                      .dwattr $C$DW$1976, DW_AT_type(*$C$DW$T$77)
   11687                      .dwattr $C$DW$1976, DW_AT_name("AIODIR")
   11688                      .dwattr $C$DW$1976, DW_AT_TI_symbol_name("_AIODIR")
   11689                      .dwattr $C$DW$1976, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   11690                      .dwattr $C$DW$1976, DW_AT_accessibility(DW_ACCESS_public)
   11691              $C$DW$1977      .dwtag  DW_TAG_member
   11692                      .dwattr $C$DW$1977, DW_AT_type(*$C$DW$T$79)
   11693                      .dwattr $C$DW$1977, DW_AT_name("rsvd_6")
   11694                      .dwattr $C$DW$1977, DW_AT_TI_symbol_name("_rsvd_6")
   11695                      .dwattr $C$DW$1977, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
   11696                      .dwattr $C$DW$1977, DW_AT_accessibility(DW_ACCESS_public)
   11697              $C$DW$1978      .dwtag  DW_TAG_member
   11698                      .dwattr $C$DW$1978, DW_AT_type(*$C$DW$T$77)
   11699                      .dwattr $C$DW$1978, DW_AT_name("GPADAT")
   11700                      .dwattr $C$DW$1978, DW_AT_TI_symbol_name("_GPADAT")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  224

   11701                      .dwattr $C$DW$1978, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
   11702                      .dwattr $C$DW$1978, DW_AT_accessibility(DW_ACCESS_public)
   11703              $C$DW$1979      .dwtag  DW_TAG_member
   11704                      .dwattr $C$DW$1979, DW_AT_type(*$C$DW$T$77)
   11705                      .dwattr $C$DW$1979, DW_AT_name("GPASET")
   11706                      .dwattr $C$DW$1979, DW_AT_TI_symbol_name("_GPASET")
   11707                      .dwattr $C$DW$1979, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
   11708                      .dwattr $C$DW$1979, DW_AT_accessibility(DW_ACCESS_public)
   11709              $C$DW$1980      .dwtag  DW_TAG_member
   11710                      .dwattr $C$DW$1980, DW_AT_type(*$C$DW$T$77)
   11711                      .dwattr $C$DW$1980, DW_AT_name("GPACLEAR")
   11712                      .dwattr $C$DW$1980, DW_AT_TI_symbol_name("_GPACLEAR")
   11713                      .dwattr $C$DW$1980, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
   11714                      .dwattr $C$DW$1980, DW_AT_accessibility(DW_ACCESS_public)
   11715              $C$DW$1981      .dwtag  DW_TAG_member
   11716                      .dwattr $C$DW$1981, DW_AT_type(*$C$DW$T$77)
   11717                      .dwattr $C$DW$1981, DW_AT_name("GPATOGGLE")
   11718                      .dwattr $C$DW$1981, DW_AT_TI_symbol_name("_GPATOGGLE")
   11719                      .dwattr $C$DW$1981, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
   11720                      .dwattr $C$DW$1981, DW_AT_accessibility(DW_ACCESS_public)
   11721              $C$DW$1982      .dwtag  DW_TAG_member
   11722                      .dwattr $C$DW$1982, DW_AT_type(*$C$DW$T$77)
   11723                      .dwattr $C$DW$1982, DW_AT_name("GPBDAT")
   11724                      .dwattr $C$DW$1982, DW_AT_TI_symbol_name("_GPBDAT")
   11725                      .dwattr $C$DW$1982, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
   11726                      .dwattr $C$DW$1982, DW_AT_accessibility(DW_ACCESS_public)
   11727              $C$DW$1983      .dwtag  DW_TAG_member
   11728                      .dwattr $C$DW$1983, DW_AT_type(*$C$DW$T$77)
   11729                      .dwattr $C$DW$1983, DW_AT_name("GPBSET")
   11730                      .dwattr $C$DW$1983, DW_AT_TI_symbol_name("_GPBSET")
   11731                      .dwattr $C$DW$1983, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
   11732                      .dwattr $C$DW$1983, DW_AT_accessibility(DW_ACCESS_public)
   11733              $C$DW$1984      .dwtag  DW_TAG_member
   11734                      .dwattr $C$DW$1984, DW_AT_type(*$C$DW$T$77)
   11735                      .dwattr $C$DW$1984, DW_AT_name("GPBCLEAR")
   11736                      .dwattr $C$DW$1984, DW_AT_TI_symbol_name("_GPBCLEAR")
   11737                      .dwattr $C$DW$1984, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   11738                      .dwattr $C$DW$1984, DW_AT_accessibility(DW_ACCESS_public)
   11739              $C$DW$1985      .dwtag  DW_TAG_member
   11740                      .dwattr $C$DW$1985, DW_AT_type(*$C$DW$T$77)
   11741                      .dwattr $C$DW$1985, DW_AT_name("GPBTOGGLE")
   11742                      .dwattr $C$DW$1985, DW_AT_TI_symbol_name("_GPBTOGGLE")
   11743                      .dwattr $C$DW$1985, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
   11744                      .dwattr $C$DW$1985, DW_AT_accessibility(DW_ACCESS_public)
   11745              $C$DW$1986      .dwtag  DW_TAG_member
   11746                      .dwattr $C$DW$1986, DW_AT_type(*$C$DW$T$31)
   11747                      .dwattr $C$DW$1986, DW_AT_name("rsvd_7")
   11748                      .dwattr $C$DW$1986, DW_AT_TI_symbol_name("_rsvd_7")
   11749                      .dwattr $C$DW$1986, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
   11750                      .dwattr $C$DW$1986, DW_AT_accessibility(DW_ACCESS_public)
   11751              $C$DW$1987      .dwtag  DW_TAG_member
   11752                      .dwattr $C$DW$1987, DW_AT_type(*$C$DW$T$77)
   11753                      .dwattr $C$DW$1987, DW_AT_name("AIODAT")
   11754                      .dwattr $C$DW$1987, DW_AT_TI_symbol_name("_AIODAT")
   11755                      .dwattr $C$DW$1987, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  225

   11756                      .dwattr $C$DW$1987, DW_AT_accessibility(DW_ACCESS_public)
   11757              $C$DW$1988      .dwtag  DW_TAG_member
   11758                      .dwattr $C$DW$1988, DW_AT_type(*$C$DW$T$77)
   11759                      .dwattr $C$DW$1988, DW_AT_name("AIOSET")
   11760                      .dwattr $C$DW$1988, DW_AT_TI_symbol_name("_AIOSET")
   11761                      .dwattr $C$DW$1988, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   11762                      .dwattr $C$DW$1988, DW_AT_accessibility(DW_ACCESS_public)
   11763              $C$DW$1989      .dwtag  DW_TAG_member
   11764                      .dwattr $C$DW$1989, DW_AT_type(*$C$DW$T$77)
   11765                      .dwattr $C$DW$1989, DW_AT_name("AIOCLEAR")
   11766                      .dwattr $C$DW$1989, DW_AT_TI_symbol_name("_AIOCLEAR")
   11767                      .dwattr $C$DW$1989, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   11768                      .dwattr $C$DW$1989, DW_AT_accessibility(DW_ACCESS_public)
   11769              $C$DW$1990      .dwtag  DW_TAG_member
   11770                      .dwattr $C$DW$1990, DW_AT_type(*$C$DW$T$77)
   11771                      .dwattr $C$DW$1990, DW_AT_name("AIOTOGGLE")
   11772                      .dwattr $C$DW$1990, DW_AT_TI_symbol_name("_AIOTOGGLE")
   11773                      .dwattr $C$DW$1990, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   11774                      .dwattr $C$DW$1990, DW_AT_accessibility(DW_ACCESS_public)
   11775              $C$DW$1991      .dwtag  DW_TAG_member
   11776                      .dwattr $C$DW$1991, DW_AT_type(*$C$DW$T$28)
   11777                      .dwattr $C$DW$1991, DW_AT_name("GPIOXINTnSEL")
   11778                      .dwattr $C$DW$1991, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
   11779                      .dwattr $C$DW$1991, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   11780                      .dwattr $C$DW$1991, DW_AT_accessibility(DW_ACCESS_public)
   11781              $C$DW$1992      .dwtag  DW_TAG_member
   11782                      .dwattr $C$DW$1992, DW_AT_type(*$C$DW$T$27)
   11783                      .dwattr $C$DW$1992, DW_AT_name("rsvd_8")
   11784                      .dwattr $C$DW$1992, DW_AT_TI_symbol_name("_rsvd_8")
   11785                      .dwattr $C$DW$1992, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
   11786                      .dwattr $C$DW$1992, DW_AT_accessibility(DW_ACCESS_public)
   11787              $C$DW$1993      .dwtag  DW_TAG_member
   11788                      .dwattr $C$DW$1993, DW_AT_type(*$C$DW$T$77)
   11789                      .dwattr $C$DW$1993, DW_AT_name("GPIOLPMSEL")
   11790                      .dwattr $C$DW$1993, DW_AT_TI_symbol_name("_GPIOLPMSEL")
   11791                      .dwattr $C$DW$1993, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
   11792                      .dwattr $C$DW$1993, DW_AT_accessibility(DW_ACCESS_public)
   11793                      .dwendtag $C$DW$T$80
   11794              
   11795              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
   11796                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$80)
   11797                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
   11798              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
   11799                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
   11800                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
   11801              
   11802              $C$DW$T$82      .dwtag  DW_TAG_structure_type
   11803                      .dwattr $C$DW$T$82, DW_AT_name("_HAL_AdcData_t_")
   11804                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x10)
   11805              $C$DW$1994      .dwtag  DW_TAG_member
   11806                      .dwattr $C$DW$1994, DW_AT_type(*$C$DW$T$81)
   11807                      .dwattr $C$DW$1994, DW_AT_name("I")
   11808                      .dwattr $C$DW$1994, DW_AT_TI_symbol_name("_I")
   11809                      .dwattr $C$DW$1994, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11810                      .dwattr $C$DW$1994, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  226

   11811              $C$DW$1995      .dwtag  DW_TAG_member
   11812                      .dwattr $C$DW$1995, DW_AT_type(*$C$DW$T$81)
   11813                      .dwattr $C$DW$1995, DW_AT_name("V")
   11814                      .dwattr $C$DW$1995, DW_AT_TI_symbol_name("_V")
   11815                      .dwattr $C$DW$1995, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11816                      .dwattr $C$DW$1995, DW_AT_accessibility(DW_ACCESS_public)
   11817              $C$DW$1996      .dwtag  DW_TAG_member
   11818                      .dwattr $C$DW$1996, DW_AT_type(*$C$DW$T$73)
   11819                      .dwattr $C$DW$1996, DW_AT_name("dcBus")
   11820                      .dwattr $C$DW$1996, DW_AT_TI_symbol_name("_dcBus")
   11821                      .dwattr $C$DW$1996, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11822                      .dwattr $C$DW$1996, DW_AT_accessibility(DW_ACCESS_public)
   11823              $C$DW$1997      .dwtag  DW_TAG_member
   11824                      .dwattr $C$DW$1997, DW_AT_type(*$C$DW$T$12)
   11825                      .dwattr $C$DW$1997, DW_AT_name("throttle")
   11826                      .dwattr $C$DW$1997, DW_AT_TI_symbol_name("_throttle")
   11827                      .dwattr $C$DW$1997, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11828                      .dwattr $C$DW$1997, DW_AT_accessibility(DW_ACCESS_public)
   11829                      .dwendtag $C$DW$T$82
   11830              
   11831              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_AdcData_t")
   11832                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$82)
   11833                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   11834              $C$DW$T$373     .dwtag  DW_TAG_pointer_type
   11835                      .dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$121)
   11836                      .dwattr $C$DW$T$373, DW_AT_address_class(0x20)
   11837              $C$DW$1998      .dwtag  DW_TAG_TI_far_type
   11838                      .dwattr $C$DW$1998, DW_AT_type(*$C$DW$T$373)
   11839              $C$DW$T$374     .dwtag  DW_TAG_const_type
   11840                      .dwattr $C$DW$T$374, DW_AT_type(*$C$DW$1998)
   11841              
   11842              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   11843                      .dwattr $C$DW$T$91, DW_AT_name("_HAL_MOTOR_Vars_t_")
   11844                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x68)
   11845              $C$DW$1999      .dwtag  DW_TAG_member
   11846                      .dwattr $C$DW$1999, DW_AT_type(*$C$DW$T$44)
   11847                      .dwattr $C$DW$1999, DW_AT_name("Flag_enableSys")
   11848                      .dwattr $C$DW$1999, DW_AT_TI_symbol_name("_Flag_enableSys")
   11849                      .dwattr $C$DW$1999, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   11850                      .dwattr $C$DW$1999, DW_AT_accessibility(DW_ACCESS_public)
   11851              $C$DW$2000      .dwtag  DW_TAG_member
   11852                      .dwattr $C$DW$2000, DW_AT_type(*$C$DW$T$44)
   11853                      .dwattr $C$DW$2000, DW_AT_name("Flag_Run_Identify")
   11854                      .dwattr $C$DW$2000, DW_AT_TI_symbol_name("_Flag_Run_Identify")
   11855                      .dwattr $C$DW$2000, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   11856                      .dwattr $C$DW$2000, DW_AT_accessibility(DW_ACCESS_public)
   11857              $C$DW$2001      .dwtag  DW_TAG_member
   11858                      .dwattr $C$DW$2001, DW_AT_type(*$C$DW$T$44)
   11859                      .dwattr $C$DW$2001, DW_AT_name("Flag_MotorIdentified")
   11860                      .dwattr $C$DW$2001, DW_AT_TI_symbol_name("_Flag_MotorIdentified")
   11861                      .dwattr $C$DW$2001, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   11862                      .dwattr $C$DW$2001, DW_AT_accessibility(DW_ACCESS_public)
   11863              $C$DW$2002      .dwtag  DW_TAG_member
   11864                      .dwattr $C$DW$2002, DW_AT_type(*$C$DW$T$44)
   11865                      .dwattr $C$DW$2002, DW_AT_name("Flag_enableForceAngle")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  227

   11866                      .dwattr $C$DW$2002, DW_AT_TI_symbol_name("_Flag_enableForceAngle")
   11867                      .dwattr $C$DW$2002, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   11868                      .dwattr $C$DW$2002, DW_AT_accessibility(DW_ACCESS_public)
   11869              $C$DW$2003      .dwtag  DW_TAG_member
   11870                      .dwattr $C$DW$2003, DW_AT_type(*$C$DW$T$44)
   11871                      .dwattr $C$DW$2003, DW_AT_name("Flag_enableFieldWeakening")
   11872                      .dwattr $C$DW$2003, DW_AT_TI_symbol_name("_Flag_enableFieldWeakening")
   11873                      .dwattr $C$DW$2003, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   11874                      .dwattr $C$DW$2003, DW_AT_accessibility(DW_ACCESS_public)
   11875              $C$DW$2004      .dwtag  DW_TAG_member
   11876                      .dwattr $C$DW$2004, DW_AT_type(*$C$DW$T$44)
   11877                      .dwattr $C$DW$2004, DW_AT_name("Flag_enableRsRecalc")
   11878                      .dwattr $C$DW$2004, DW_AT_TI_symbol_name("_Flag_enableRsRecalc")
   11879                      .dwattr $C$DW$2004, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   11880                      .dwattr $C$DW$2004, DW_AT_accessibility(DW_ACCESS_public)
   11881              $C$DW$2005      .dwtag  DW_TAG_member
   11882                      .dwattr $C$DW$2005, DW_AT_type(*$C$DW$T$44)
   11883                      .dwattr $C$DW$2005, DW_AT_name("Flag_enableUserParams")
   11884                      .dwattr $C$DW$2005, DW_AT_TI_symbol_name("_Flag_enableUserParams")
   11885                      .dwattr $C$DW$2005, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   11886                      .dwattr $C$DW$2005, DW_AT_accessibility(DW_ACCESS_public)
   11887              $C$DW$2006      .dwtag  DW_TAG_member
   11888                      .dwattr $C$DW$2006, DW_AT_type(*$C$DW$T$44)
   11889                      .dwattr $C$DW$2006, DW_AT_name("Flag_enableOffsetcalc")
   11890                      .dwattr $C$DW$2006, DW_AT_TI_symbol_name("_Flag_enableOffsetcalc")
   11891                      .dwattr $C$DW$2006, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   11892                      .dwattr $C$DW$2006, DW_AT_accessibility(DW_ACCESS_public)
   11893              $C$DW$2007      .dwtag  DW_TAG_member
   11894                      .dwattr $C$DW$2007, DW_AT_type(*$C$DW$T$44)
   11895                      .dwattr $C$DW$2007, DW_AT_name("Flag_enablePowerWarp")
   11896                      .dwattr $C$DW$2007, DW_AT_TI_symbol_name("_Flag_enablePowerWarp")
   11897                      .dwattr $C$DW$2007, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   11898                      .dwattr $C$DW$2007, DW_AT_accessibility(DW_ACCESS_public)
   11899              $C$DW$2008      .dwtag  DW_TAG_member
   11900                      .dwattr $C$DW$2008, DW_AT_type(*$C$DW$T$44)
   11901                      .dwattr $C$DW$2008, DW_AT_name("Flag_enableSpeedCtrl")
   11902                      .dwattr $C$DW$2008, DW_AT_TI_symbol_name("_Flag_enableSpeedCtrl")
   11903                      .dwattr $C$DW$2008, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   11904                      .dwattr $C$DW$2008, DW_AT_accessibility(DW_ACCESS_public)
   11905              $C$DW$2009      .dwtag  DW_TAG_member
   11906                      .dwattr $C$DW$2009, DW_AT_type(*$C$DW$T$44)
   11907                      .dwattr $C$DW$2009, DW_AT_name("startup")
   11908                      .dwattr $C$DW$2009, DW_AT_TI_symbol_name("_startup")
   11909                      .dwattr $C$DW$2009, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   11910                      .dwattr $C$DW$2009, DW_AT_accessibility(DW_ACCESS_public)
   11911              $C$DW$2010      .dwtag  DW_TAG_member
   11912                      .dwattr $C$DW$2010, DW_AT_type(*$C$DW$T$84)
   11913                      .dwattr $C$DW$2010, DW_AT_name("CtrlState")
   11914                      .dwattr $C$DW$2010, DW_AT_TI_symbol_name("_CtrlState")
   11915                      .dwattr $C$DW$2010, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   11916                      .dwattr $C$DW$2010, DW_AT_accessibility(DW_ACCESS_public)
   11917              $C$DW$2011      .dwtag  DW_TAG_member
   11918                      .dwattr $C$DW$2011, DW_AT_type(*$C$DW$T$86)
   11919                      .dwattr $C$DW$2011, DW_AT_name("EstState")
   11920                      .dwattr $C$DW$2011, DW_AT_TI_symbol_name("_EstState")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  228

   11921                      .dwattr $C$DW$2011, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   11922                      .dwattr $C$DW$2011, DW_AT_accessibility(DW_ACCESS_public)
   11923              $C$DW$2012      .dwtag  DW_TAG_member
   11924                      .dwattr $C$DW$2012, DW_AT_type(*$C$DW$T$88)
   11925                      .dwattr $C$DW$2012, DW_AT_name("UserErrorCode")
   11926                      .dwattr $C$DW$2012, DW_AT_TI_symbol_name("_UserErrorCode")
   11927                      .dwattr $C$DW$2012, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   11928                      .dwattr $C$DW$2012, DW_AT_accessibility(DW_ACCESS_public)
   11929              $C$DW$2013      .dwtag  DW_TAG_member
   11930                      .dwattr $C$DW$2013, DW_AT_type(*$C$DW$T$89)
   11931                      .dwattr $C$DW$2013, DW_AT_name("CtrlVersion")
   11932                      .dwattr $C$DW$2013, DW_AT_TI_symbol_name("_CtrlVersion")
   11933                      .dwattr $C$DW$2013, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   11934                      .dwattr $C$DW$2013, DW_AT_accessibility(DW_ACCESS_public)
   11935              $C$DW$2014      .dwtag  DW_TAG_member
   11936                      .dwattr $C$DW$2014, DW_AT_type(*$C$DW$T$73)
   11937                      .dwattr $C$DW$2014, DW_AT_name("IdRef_A")
   11938                      .dwattr $C$DW$2014, DW_AT_TI_symbol_name("_IdRef_A")
   11939                      .dwattr $C$DW$2014, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
   11940                      .dwattr $C$DW$2014, DW_AT_accessibility(DW_ACCESS_public)
   11941              $C$DW$2015      .dwtag  DW_TAG_member
   11942                      .dwattr $C$DW$2015, DW_AT_type(*$C$DW$T$73)
   11943                      .dwattr $C$DW$2015, DW_AT_name("IqRef_A")
   11944                      .dwattr $C$DW$2015, DW_AT_TI_symbol_name("_IqRef_A")
   11945                      .dwattr $C$DW$2015, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   11946                      .dwattr $C$DW$2015, DW_AT_accessibility(DW_ACCESS_public)
   11947              $C$DW$2016      .dwtag  DW_TAG_member
   11948                      .dwattr $C$DW$2016, DW_AT_type(*$C$DW$T$73)
   11949                      .dwattr $C$DW$2016, DW_AT_name("SpeedRef_pu")
   11950                      .dwattr $C$DW$2016, DW_AT_TI_symbol_name("_SpeedRef_pu")
   11951                      .dwattr $C$DW$2016, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   11952                      .dwattr $C$DW$2016, DW_AT_accessibility(DW_ACCESS_public)
   11953              $C$DW$2017      .dwtag  DW_TAG_member
   11954                      .dwattr $C$DW$2017, DW_AT_type(*$C$DW$T$73)
   11955                      .dwattr $C$DW$2017, DW_AT_name("SpeedRef_krpm")
   11956                      .dwattr $C$DW$2017, DW_AT_TI_symbol_name("_SpeedRef_krpm")
   11957                      .dwattr $C$DW$2017, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   11958                      .dwattr $C$DW$2017, DW_AT_accessibility(DW_ACCESS_public)
   11959              $C$DW$2018      .dwtag  DW_TAG_member
   11960                      .dwattr $C$DW$2018, DW_AT_type(*$C$DW$T$73)
   11961                      .dwattr $C$DW$2018, DW_AT_name("SpeedTraj_krpm")
   11962                      .dwattr $C$DW$2018, DW_AT_TI_symbol_name("_SpeedTraj_krpm")
   11963                      .dwattr $C$DW$2018, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
   11964                      .dwattr $C$DW$2018, DW_AT_accessibility(DW_ACCESS_public)
   11965              $C$DW$2019      .dwtag  DW_TAG_member
   11966                      .dwattr $C$DW$2019, DW_AT_type(*$C$DW$T$73)
   11967                      .dwattr $C$DW$2019, DW_AT_name("MaxAccel_krpmps")
   11968                      .dwattr $C$DW$2019, DW_AT_TI_symbol_name("_MaxAccel_krpmps")
   11969                      .dwattr $C$DW$2019, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
   11970                      .dwattr $C$DW$2019, DW_AT_accessibility(DW_ACCESS_public)
   11971              $C$DW$2020      .dwtag  DW_TAG_member
   11972                      .dwattr $C$DW$2020, DW_AT_type(*$C$DW$T$73)
   11973                      .dwattr $C$DW$2020, DW_AT_name("Speed_krpm")
   11974                      .dwattr $C$DW$2020, DW_AT_TI_symbol_name("_Speed_krpm")
   11975                      .dwattr $C$DW$2020, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 09:28:14 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3998810                            PAGE  229

   11976                      .dwattr $C$DW$2020, DW_AT_accessibility(DW_ACCESS_public)
   11977              $C$DW$2021      .dwtag  DW_TAG_member
   11978                      .dwattr $C$DW$2021, DW_AT_type(*$C$DW$T$73)
   11979                      .dwattr $C$DW$2021, DW_AT_name("OverModulation")
   11980                      .dwattr $C$DW$2021, DW_AT_TI_symbol_name("_OverModulation")
   11981                      .dwattr $C$DW$2021, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
   11982                      .dwattr $C$DW$2021, DW_AT_accessibility(DW_ACCESS_public)
   11983              $C$DW$2022      .dwtag  DW_TAG_member
   11984                      .dwattr $C$DW$2022, DW_AT_type(*$C$DW$T$73)
   11985                      .dwattr $C$DW$2022, DW_AT_name("RsOnLineCurrent_A")
   11986                      .dwattr $C$DW$2022, DW_AT_TI_symbol_name("_RsOnLineCurrent_A")
   11987                      .dwattr $C$DW$2022, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
   11988                      .dwattr $C$DW$2022, DW_AT_accessibility(DW_ACCESS_public)
   11989              $C$DW$2023      .dwtag  DW_TAG_member
   11990                      .dwattr $C$DW$2023, DW_AT_type(*$C$DW$T$73)
   11991                      .dwattr $C$DW$2023, DW_AT_name("SvgenMaxModulation_ticks")
   11992                      .dwattr $C$DW$2023, DW_AT_TI_symbol_name("_SvgenMaxModulation_ticks")
   11993                      .dwattr $C$DW$2023, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   11994                      .dwattr $C$DW$2023, DW_AT_accessibility(DW_ACCESS_public)
   11995              $C$DW$2024      .dwtag  DW_TAG_member
   11996                      .dwattr $C$DW$2024, DW_AT_type(*$C$DW$T$73)
   11997                      .dwattr $C$DW$2024, DW_AT_name("Flux_Wb")
   11998                      .dwattr $C$DW$2024, DW_AT_TI_symbol_name("_Flux_Wb")
   11999                      .dwattr $C$DW$2024, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
   12000                      .dwattr $C$DW$2024, DW_AT_accessibility(DW_ACCESS_public)
   12001              $C$DW$2025      .dwtag  DW_TAG_member
   12002                      .dwattr $C$DW$2025, DW_AT_type(*$C$DW$T$73)
   12003                      .dwattr $C$DW$2025, DW_AT_name("Torque_Nm")
   12004                      .dwattr $C$DW$2025, DW_AT_TI_symbol_name("_Torque_Nm")
   12005                      .dwattr $C$DW$2025, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   12006                      .dwattr $C$DW$2025, DW_AT_accessibility(DW_ACCESS_public)
   12007              $C$DW$2026      .dwtag  DW_TAG_member
   12008                      .dwattr $C$DW$2026, DW_AT_type(*$C$DW$T$90)
   12009                      .dwattr $C$DW$2026, DW_AT_name("MagnCurr_A")
   12010                      .dwattr $C$DW$2026, DW_AT_TI_symbol_name("_MagnCurr_A")
   12011                      .dwattr $C$DW$2026, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
   12012                      .dwattr $C$DW$2026, DW_AT_accessibility(DW_ACCESS_public)
   12013              $C$DW$2027      .dwtag  DW_TAG_member
   12014                      .dwattr $C$DW$2027, DW_AT_type(*$C$DW$T$90)
   12015                      .dwattr $C$DW$2027, DW_AT_name("Rr_Ohm")
   12016                      .dwattr $C$DW$2027, DW_AT_TI_symbol_name("_Rr_Ohm")
   12017                      .dwattr $C$DW$2027, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   12018                      .dwattr $C$DW$2027, DW_AT_accessibility(DW_ACCESS_public)
