TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Wed Nov 23 10:34:30 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3662              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    3663              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    3664              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    3665              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    3666              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    3667              $C$DW$539       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    3668              $C$DW$540       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3669              $C$DW$541       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3670              $C$DW$542       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3671              $C$DW$543       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3672              $C$DW$544       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3673                      .dwendtag $C$DW$T$214
    3674              
    3675              $C$DW$T$215     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3676                      .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$214)
    3677                      .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    3678              
    3679              $C$DW$T$217     .dwtag  DW_TAG_enumeration_type
    3680                      .dwattr $C$DW$T$217, DW_AT_byte_size(0x01)
    3681              $C$DW$545       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3682              $C$DW$546       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3683              $C$DW$547       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3684              $C$DW$548       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3685              $C$DW$549       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3686              $C$DW$550       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3687              $C$DW$551       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3688              $C$DW$552       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3689              $C$DW$553       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   75

    3690              $C$DW$554       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3691              $C$DW$555       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3692              $C$DW$556       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3693                      .dwendtag $C$DW$T$217
    3694              
    3695              $C$DW$T$218     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3696                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
    3697                      .dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
    3698              
    3699              $C$DW$T$220     .dwtag  DW_TAG_enumeration_type
    3700                      .dwattr $C$DW$T$220, DW_AT_byte_size(0x01)
    3701              $C$DW$557       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3702              $C$DW$558       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3703              $C$DW$559       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3704                      .dwendtag $C$DW$T$220
    3705              
    3706              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3707                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
    3708                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    3709              
    3710              $C$DW$T$223     .dwtag  DW_TAG_enumeration_type
    3711                      .dwattr $C$DW$T$223, DW_AT_byte_size(0x01)
    3712              $C$DW$560       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3713              $C$DW$561       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3714                      .dwendtag $C$DW$T$223
    3715              
    3716              $C$DW$T$224     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3717                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$T$223)
    3718                      .dwattr $C$DW$T$224, DW_AT_language(DW_LANG_C)
    3719              
    3720              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3721                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3722                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3723              $C$DW$562       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$25)
    3725                      .dwattr $C$DW$562, DW_AT_name("ADCRESULT")
    3726                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ADCRESULT")
    3727                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3728                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3729              $C$DW$563       .dwtag  DW_TAG_member
    3730                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$26)
    3731                      .dwattr $C$DW$563, DW_AT_name("resvd_1")
    3732                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_resvd_1")
    3733                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3734                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3735              $C$DW$564       .dwtag  DW_TAG_member
    3736                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$24)
    3737                      .dwattr $C$DW$564, DW_AT_name("ADCCTL1")
    3738                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_ADCCTL1")
    3739                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3740                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3741              $C$DW$565       .dwtag  DW_TAG_member
    3742                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$24)
    3743                      .dwattr $C$DW$565, DW_AT_name("ADCCTL2")
    3744                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_ADCCTL2")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   76

    3745                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3746                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3747              $C$DW$566       .dwtag  DW_TAG_member
    3748                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$27)
    3749                      .dwattr $C$DW$566, DW_AT_name("rsvd_2")
    3750                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_rsvd_2")
    3751                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    3752                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3753              $C$DW$567       .dwtag  DW_TAG_member
    3754                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$24)
    3755                      .dwattr $C$DW$567, DW_AT_name("ADCINTFLG")
    3756                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_ADCINTFLG")
    3757                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    3758                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3759              $C$DW$568       .dwtag  DW_TAG_member
    3760                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$24)
    3761                      .dwattr $C$DW$568, DW_AT_name("ADCINTFLGCLR")
    3762                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    3763                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    3764                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$569       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$24)
    3767                      .dwattr $C$DW$569, DW_AT_name("ADCINTOVF")
    3768                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_ADCINTOVF")
    3769                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    3770                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$570       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$24)
    3773                      .dwattr $C$DW$570, DW_AT_name("ADCINTOVFCLR")
    3774                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    3775                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    3776                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3777              $C$DW$571       .dwtag  DW_TAG_member
    3778                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$28)
    3779                      .dwattr $C$DW$571, DW_AT_name("INTSELxNy")
    3780                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_INTSELxNy")
    3781                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    3782                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3783              $C$DW$572       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$29)
    3785                      .dwattr $C$DW$572, DW_AT_name("rsvd_3")
    3786                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_rsvd_3")
    3787                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    3788                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3789              $C$DW$573       .dwtag  DW_TAG_member
    3790                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$24)
    3791                      .dwattr $C$DW$573, DW_AT_name("SOCPRICTRL")
    3792                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_SOCPRICTRL")
    3793                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    3794                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3795              $C$DW$574       .dwtag  DW_TAG_member
    3796                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$24)
    3797                      .dwattr $C$DW$574, DW_AT_name("rsvd_4")
    3798                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_rsvd_4")
    3799                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   77

    3800                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3801              $C$DW$575       .dwtag  DW_TAG_member
    3802                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$24)
    3803                      .dwattr $C$DW$575, DW_AT_name("ADCSAMPLEMODE")
    3804                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    3805                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    3806                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3807              $C$DW$576       .dwtag  DW_TAG_member
    3808                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$24)
    3809                      .dwattr $C$DW$576, DW_AT_name("rsvd_5")
    3810                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_rsvd_5")
    3811                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    3812                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$577       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$24)
    3815                      .dwattr $C$DW$577, DW_AT_name("ADCINTSOCSEL1")
    3816                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    3817                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    3818                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3819              $C$DW$578       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$24)
    3821                      .dwattr $C$DW$578, DW_AT_name("ADCINTSOCSEL2")
    3822                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    3823                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    3824                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3825              $C$DW$579       .dwtag  DW_TAG_member
    3826                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$27)
    3827                      .dwattr $C$DW$579, DW_AT_name("rsvd_6")
    3828                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_rsvd_6")
    3829                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    3830                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3831              $C$DW$580       .dwtag  DW_TAG_member
    3832                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$24)
    3833                      .dwattr $C$DW$580, DW_AT_name("ADCSOCFLG1")
    3834                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    3835                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    3836                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3837              $C$DW$581       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$24)
    3839                      .dwattr $C$DW$581, DW_AT_name("rsvd_7")
    3840                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_rsvd_7")
    3841                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    3842                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$582       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$24)
    3845                      .dwattr $C$DW$582, DW_AT_name("ADCSOCFRC1")
    3846                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    3847                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    3848                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3849              $C$DW$583       .dwtag  DW_TAG_member
    3850                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$24)
    3851                      .dwattr $C$DW$583, DW_AT_name("rsvd_8")
    3852                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_rsvd_8")
    3853                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    3854                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   78

    3855              $C$DW$584       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$24)
    3857                      .dwattr $C$DW$584, DW_AT_name("ADCSOCOVF1")
    3858                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    3859                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    3860                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3861              $C$DW$585       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$24)
    3863                      .dwattr $C$DW$585, DW_AT_name("rsvd_9")
    3864                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_rsvd_9")
    3865                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    3866                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3867              $C$DW$586       .dwtag  DW_TAG_member
    3868                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$24)
    3869                      .dwattr $C$DW$586, DW_AT_name("ADCSOCOVFCLR1")
    3870                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    3871                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    3872                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3873              $C$DW$587       .dwtag  DW_TAG_member
    3874                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$24)
    3875                      .dwattr $C$DW$587, DW_AT_name("rsvd_10")
    3876                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_rsvd_10")
    3877                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    3878                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3879              $C$DW$588       .dwtag  DW_TAG_member
    3880                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$25)
    3881                      .dwattr $C$DW$588, DW_AT_name("ADCSOCxCTL")
    3882                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    3883                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    3884                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3885              $C$DW$589       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$25)
    3887                      .dwattr $C$DW$589, DW_AT_name("rsvd_11")
    3888                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_rsvd_11")
    3889                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    3890                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$590       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$24)
    3893                      .dwattr $C$DW$590, DW_AT_name("ADCREFTRIM")
    3894                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_ADCREFTRIM")
    3895                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    3896                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$591       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$24)
    3899                      .dwattr $C$DW$591, DW_AT_name("ADCOFFTRIM")
    3900                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    3901                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    3902                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3903              $C$DW$592       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$30)
    3905                      .dwattr $C$DW$592, DW_AT_name("resvd_12")
    3906                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_resvd_12")
    3907                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    3908                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3909              $C$DW$593       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   79

    3910                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$24)
    3911                      .dwattr $C$DW$593, DW_AT_name("ADCREV")
    3912                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_ADCREV")
    3913                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    3914                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3915                      .dwendtag $C$DW$T$31
    3916              
    3917              $C$DW$T$226     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    3918                      .dwattr $C$DW$T$226, DW_AT_type(*$C$DW$T$31)
    3919                      .dwattr $C$DW$T$226, DW_AT_language(DW_LANG_C)
    3920              $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3921                      .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$31)
    3922                      .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3923              $C$DW$T$118     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    3924                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    3925                      .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    3926              
    3927              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3928                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    3929                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    3930              $C$DW$594       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$32)
    3932                      .dwattr $C$DW$594, DW_AT_name("alpha_sf")
    3933                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_alpha_sf")
    3934                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3935                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$595       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$32)
    3938                      .dwattr $C$DW$595, DW_AT_name("beta_sf")
    3939                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_beta_sf")
    3940                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3941                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$596       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$33)
    3944                      .dwattr $C$DW$596, DW_AT_name("numSensors")
    3945                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_numSensors")
    3946                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3947                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3948                      .dwendtag $C$DW$T$34
    3949              
    3950              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3951                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3952                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3953              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3954                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$34)
    3955                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3956              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3957                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3958                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3959              
    3960              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3961                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    3962                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    3963              $C$DW$597       .dwtag  DW_TAG_member
    3964                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   80

    3965                      .dwattr $C$DW$597, DW_AT_name("XCLK")
    3966                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_XCLK")
    3967                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3968                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3969              $C$DW$598       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$24)
    3971                      .dwattr $C$DW$598, DW_AT_name("rsvd_1")
    3972                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_rsvd_1")
    3973                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3974                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$599       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$24)
    3977                      .dwattr $C$DW$599, DW_AT_name("CLKCTL")
    3978                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_CLKCTL")
    3979                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3980                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$600       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$35)
    3983                      .dwattr $C$DW$600, DW_AT_name("rsvd_2")
    3984                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_rsvd_2")
    3985                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3986                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$601       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$24)
    3989                      .dwattr $C$DW$601, DW_AT_name("LOSPCP")
    3990                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_LOSPCP")
    3991                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3992                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3993              $C$DW$602       .dwtag  DW_TAG_member
    3994                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$24)
    3995                      .dwattr $C$DW$602, DW_AT_name("PCLKCR0")
    3996                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_PCLKCR0")
    3997                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3998                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3999              $C$DW$603       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$24)
    4001                      .dwattr $C$DW$603, DW_AT_name("PCLKCR1")
    4002                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_PCLKCR1")
    4003                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4004                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$604       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$27)
    4007                      .dwattr $C$DW$604, DW_AT_name("rsvd_3")
    4008                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_rsvd_3")
    4009                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4010                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$605       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
    4013                      .dwattr $C$DW$605, DW_AT_name("PCLKCR3")
    4014                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_PCLKCR3")
    4015                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4016                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4017                      .dwendtag $C$DW$T$36
    4018              
    4019              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   81

    4020                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$36)
    4021                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    4022              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4023                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4024                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4025              
    4026              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4027                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4028                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4029              $C$DW$606       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$33)
    4031                      .dwattr $C$DW$606, DW_AT_name("tmp")
    4032                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_tmp")
    4033                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4034                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4035                      .dwendtag $C$DW$T$37
    4036              
    4037              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4038                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$37)
    4039                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4040              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4041                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    4042                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4043              
    4044              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    4045                      .dwattr $C$DW$T$71, DW_AT_name("_CTRL_Obj_")
    4046                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x108)
    4047              $C$DW$607       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$38)
    4049                      .dwattr $C$DW$607, DW_AT_name("version")
    4050                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_version")
    4051                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4052                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$608       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$40)
    4055                      .dwattr $C$DW$608, DW_AT_name("state")
    4056                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_state")
    4057                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4058                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$609       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$40)
    4061                      .dwattr $C$DW$609, DW_AT_name("prevState")
    4062                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_prevState")
    4063                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4064                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$610       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$42)
    4067                      .dwattr $C$DW$610, DW_AT_name("errorCode")
    4068                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_errorCode")
    4069                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4070                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$611       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$44)
    4073                      .dwattr $C$DW$611, DW_AT_name("clarkeHandle_I")
    4074                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_clarkeHandle_I")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   82

    4075                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4076                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$612       .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$45)
    4079                      .dwattr $C$DW$612, DW_AT_name("clarke_I")
    4080                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_clarke_I")
    4081                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4082                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$613       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$44)
    4085                      .dwattr $C$DW$613, DW_AT_name("clarkeHandle_V")
    4086                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4087                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4088                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$614       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$45)
    4091                      .dwattr $C$DW$614, DW_AT_name("clarke_V")
    4092                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_clarke_V")
    4093                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4094                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$615       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$47)
    4097                      .dwattr $C$DW$615, DW_AT_name("estHandle")
    4098                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_estHandle")
    4099                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4100                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$616       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$49)
    4103                      .dwattr $C$DW$616, DW_AT_name("parkHandle")
    4104                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_parkHandle")
    4105                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4106                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$617       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$50)
    4109                      .dwattr $C$DW$617, DW_AT_name("park")
    4110                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_park")
    4111                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4112                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$618       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$52)
    4115                      .dwattr $C$DW$618, DW_AT_name("pidHandle_Id")
    4116                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_pidHandle_Id")
    4117                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4118                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$619       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$53)
    4121                      .dwattr $C$DW$619, DW_AT_name("pid_Id")
    4122                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_pid_Id")
    4123                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4124                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$620       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$52)
    4127                      .dwattr $C$DW$620, DW_AT_name("pidHandle_Iq")
    4128                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4129                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   83

    4130                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$621       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$53)
    4133                      .dwattr $C$DW$621, DW_AT_name("pid_Iq")
    4134                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_pid_Iq")
    4135                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4136                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$622       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$52)
    4139                      .dwattr $C$DW$622, DW_AT_name("pidHandle_spd")
    4140                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_pidHandle_spd")
    4141                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4142                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4143              $C$DW$623       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$53)
    4145                      .dwattr $C$DW$623, DW_AT_name("pid_spd")
    4146                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_pid_spd")
    4147                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4148                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4149              $C$DW$624       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$55)
    4151                      .dwattr $C$DW$624, DW_AT_name("iparkHandle")
    4152                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_iparkHandle")
    4153                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4154                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4155              $C$DW$625       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$56)
    4157                      .dwattr $C$DW$625, DW_AT_name("ipark")
    4158                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ipark")
    4159                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4160                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$626       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$58)
    4163                      .dwattr $C$DW$626, DW_AT_name("svgenHandle")
    4164                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_svgenHandle")
    4165                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4166                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$627       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$59)
    4169                      .dwattr $C$DW$627, DW_AT_name("svgen")
    4170                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_svgen")
    4171                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4172                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$628       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$61)
    4175                      .dwattr $C$DW$628, DW_AT_name("trajHandle_Id")
    4176                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_trajHandle_Id")
    4177                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4178                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4179              $C$DW$629       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$62)
    4181                      .dwattr $C$DW$629, DW_AT_name("traj_Id")
    4182                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_traj_Id")
    4183                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4184                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   84

    4185              $C$DW$630       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$61)
    4187                      .dwattr $C$DW$630, DW_AT_name("trajHandle_spd")
    4188                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_trajHandle_spd")
    4189                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4190                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4191              $C$DW$631       .dwtag  DW_TAG_member
    4192                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$62)
    4193                      .dwattr $C$DW$631, DW_AT_name("traj_spd")
    4194                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_traj_spd")
    4195                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4196                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4197              $C$DW$632       .dwtag  DW_TAG_member
    4198                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$61)
    4199                      .dwattr $C$DW$632, DW_AT_name("trajHandle_spdMax")
    4200                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4201                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4202                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4203              $C$DW$633       .dwtag  DW_TAG_member
    4204                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$62)
    4205                      .dwattr $C$DW$633, DW_AT_name("traj_spdMax")
    4206                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_traj_spdMax")
    4207                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4208                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4209              $C$DW$634       .dwtag  DW_TAG_member
    4210                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$63)
    4211                      .dwattr $C$DW$634, DW_AT_name("motorParams")
    4212                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_motorParams")
    4213                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4214                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$635       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$66)
    4217                      .dwattr $C$DW$635, DW_AT_name("waitTimes")
    4218                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_waitTimes")
    4219                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4220                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4221              $C$DW$636       .dwtag  DW_TAG_member
    4222                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$65)
    4223                      .dwattr $C$DW$636, DW_AT_name("counter_state")
    4224                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_counter_state")
    4225                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4226                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4227              $C$DW$637       .dwtag  DW_TAG_member
    4228                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$67)
    4229                      .dwattr $C$DW$637, DW_AT_name("numIsrTicksPerCtrlTick")
    4230                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4231                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4232                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4233              $C$DW$638       .dwtag  DW_TAG_member
    4234                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$67)
    4235                      .dwattr $C$DW$638, DW_AT_name("numCtrlTicksPerCurrentTick")
    4236                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4237                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4238                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4239              $C$DW$639       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   85

    4240                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$67)
    4241                      .dwattr $C$DW$639, DW_AT_name("numCtrlTicksPerSpeedTick")
    4242                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4243                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4244                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$640       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$67)
    4247                      .dwattr $C$DW$640, DW_AT_name("numCtrlTicksPerTrajTick")
    4248                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4249                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4250                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$641       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$65)
    4253                      .dwattr $C$DW$641, DW_AT_name("ctrlFreq_Hz")
    4254                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4255                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4256                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$642       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$65)
    4259                      .dwattr $C$DW$642, DW_AT_name("trajFreq_Hz")
    4260                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4261                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4262                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$643       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$32)
    4265                      .dwattr $C$DW$643, DW_AT_name("trajPeriod_sec")
    4266                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4267                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4268                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$644       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$68)
    4271                      .dwattr $C$DW$644, DW_AT_name("ctrlPeriod_sec")
    4272                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4273                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4274                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$645       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$32)
    4277                      .dwattr $C$DW$645, DW_AT_name("maxVsMag_pu")
    4278                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4279                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4280                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$646       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$69)
    4283                      .dwattr $C$DW$646, DW_AT_name("Iab_in")
    4284                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_Iab_in")
    4285                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4286                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$647       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$69)
    4289                      .dwattr $C$DW$647, DW_AT_name("Iab_filt")
    4290                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_Iab_filt")
    4291                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4292                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4293              $C$DW$648       .dwtag  DW_TAG_member
    4294                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$69)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   86

    4295                      .dwattr $C$DW$648, DW_AT_name("Idq_in")
    4296                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_Idq_in")
    4297                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4298                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4299              $C$DW$649       .dwtag  DW_TAG_member
    4300                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$69)
    4301                      .dwattr $C$DW$649, DW_AT_name("Vab_in")
    4302                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_Vab_in")
    4303                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4304                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4305              $C$DW$650       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$32)
    4307                      .dwattr $C$DW$650, DW_AT_name("spd_out")
    4308                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_spd_out")
    4309                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4310                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4311              $C$DW$651       .dwtag  DW_TAG_member
    4312                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$69)
    4313                      .dwattr $C$DW$651, DW_AT_name("Vab_out")
    4314                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_Vab_out")
    4315                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4316                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4317              $C$DW$652       .dwtag  DW_TAG_member
    4318                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$69)
    4319                      .dwattr $C$DW$652, DW_AT_name("Vdq_out")
    4320                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_Vdq_out")
    4321                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4322                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4323              $C$DW$653       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$68)
    4325                      .dwattr $C$DW$653, DW_AT_name("Rhf")
    4326                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_Rhf")
    4327                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4328                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$654       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$68)
    4331                      .dwattr $C$DW$654, DW_AT_name("Lhf")
    4332                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_Lhf")
    4333                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4334                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$655       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$68)
    4337                      .dwattr $C$DW$655, DW_AT_name("RoverL")
    4338                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_RoverL")
    4339                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4340                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$656       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$32)
    4343                      .dwattr $C$DW$656, DW_AT_name("Kp_Id")
    4344                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_Kp_Id")
    4345                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4346                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$657       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$32)
    4349                      .dwattr $C$DW$657, DW_AT_name("Kp_Iq")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   87

    4350                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_Kp_Iq")
    4351                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4352                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$658       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$32)
    4355                      .dwattr $C$DW$658, DW_AT_name("Kp_spd")
    4356                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_Kp_spd")
    4357                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4358                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$659       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$32)
    4361                      .dwattr $C$DW$659, DW_AT_name("Ki_Id")
    4362                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_Ki_Id")
    4363                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4364                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$660       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$32)
    4367                      .dwattr $C$DW$660, DW_AT_name("Ki_Iq")
    4368                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_Ki_Iq")
    4369                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4370                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$661       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$32)
    4373                      .dwattr $C$DW$661, DW_AT_name("Ki_spd")
    4374                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_Ki_spd")
    4375                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4376                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$662       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$32)
    4379                      .dwattr $C$DW$662, DW_AT_name("Kd_Id")
    4380                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_Kd_Id")
    4381                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4382                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$663       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$32)
    4385                      .dwattr $C$DW$663, DW_AT_name("Kd_Iq")
    4386                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_Kd_Iq")
    4387                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4388                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$664       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$32)
    4391                      .dwattr $C$DW$664, DW_AT_name("Kd_spd")
    4392                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_Kd_spd")
    4393                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4394                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4395              $C$DW$665       .dwtag  DW_TAG_member
    4396                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    4397                      .dwattr $C$DW$665, DW_AT_name("Ui_Id")
    4398                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_Ui_Id")
    4399                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4400                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4401              $C$DW$666       .dwtag  DW_TAG_member
    4402                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$32)
    4403                      .dwattr $C$DW$666, DW_AT_name("Ui_Iq")
    4404                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_Ui_Iq")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   88

    4405                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4406                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4407              $C$DW$667       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$32)
    4409                      .dwattr $C$DW$667, DW_AT_name("Ui_spd")
    4410                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_Ui_spd")
    4411                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4412                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$668       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$69)
    4415                      .dwattr $C$DW$668, DW_AT_name("Idq_ref")
    4416                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_Idq_ref")
    4417                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4418                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4419              $C$DW$669       .dwtag  DW_TAG_member
    4420                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$32)
    4421                      .dwattr $C$DW$669, DW_AT_name("IdRated")
    4422                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_IdRated")
    4423                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4424                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4425              $C$DW$670       .dwtag  DW_TAG_member
    4426                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$32)
    4427                      .dwattr $C$DW$670, DW_AT_name("spd_ref")
    4428                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_spd_ref")
    4429                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4430                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$671       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$32)
    4433                      .dwattr $C$DW$671, DW_AT_name("spd_max")
    4434                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_spd_max")
    4435                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4436                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4437              $C$DW$672       .dwtag  DW_TAG_member
    4438                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$67)
    4439                      .dwattr $C$DW$672, DW_AT_name("counter_current")
    4440                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_counter_current")
    4441                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4442                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4443              $C$DW$673       .dwtag  DW_TAG_member
    4444                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$67)
    4445                      .dwattr $C$DW$673, DW_AT_name("counter_isr")
    4446                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_counter_isr")
    4447                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4448                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4449              $C$DW$674       .dwtag  DW_TAG_member
    4450                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$67)
    4451                      .dwattr $C$DW$674, DW_AT_name("counter_speed")
    4452                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_counter_speed")
    4453                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4454                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4455              $C$DW$675       .dwtag  DW_TAG_member
    4456                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$67)
    4457                      .dwattr $C$DW$675, DW_AT_name("counter_traj")
    4458                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_counter_traj")
    4459                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   89

    4460                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4461              $C$DW$676       .dwtag  DW_TAG_member
    4462                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$70)
    4463                      .dwattr $C$DW$676, DW_AT_name("flag_enableCtrl")
    4464                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4465                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4466                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4467              $C$DW$677       .dwtag  DW_TAG_member
    4468                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$70)
    4469                      .dwattr $C$DW$677, DW_AT_name("flag_enableDcBusComp")
    4470                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4471                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4472                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$678       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$70)
    4475                      .dwattr $C$DW$678, DW_AT_name("flag_enablePowerWarp")
    4476                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4477                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4478                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$679       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$70)
    4481                      .dwattr $C$DW$679, DW_AT_name("flag_enableOffset")
    4482                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_flag_enableOffset")
    4483                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4484                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4485              $C$DW$680       .dwtag  DW_TAG_member
    4486                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$70)
    4487                      .dwattr $C$DW$680, DW_AT_name("flag_enableSpeedCtrl")
    4488                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4489                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4490                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4491              $C$DW$681       .dwtag  DW_TAG_member
    4492                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$70)
    4493                      .dwattr $C$DW$681, DW_AT_name("flag_enableUserMotorParams")
    4494                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4495                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4496                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$682       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$69)
    4499                      .dwattr $C$DW$682, DW_AT_name("Idq_offset_pu")
    4500                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4501                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4502                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4503              $C$DW$683       .dwtag  DW_TAG_member
    4504                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$69)
    4505                      .dwattr $C$DW$683, DW_AT_name("Vdq_offset_pu")
    4506                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4507                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4508                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4509              $C$DW$684       .dwtag  DW_TAG_member
    4510                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$32)
    4511                      .dwattr $C$DW$684, DW_AT_name("angle_pu")
    4512                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_angle_pu")
    4513                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4514                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   90

    4515              $C$DW$685       .dwtag  DW_TAG_member
    4516                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$32)
    4517                      .dwattr $C$DW$685, DW_AT_name("speed_ref_pu")
    4518                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_speed_ref_pu")
    4519                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4520                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4521              $C$DW$686       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$32)
    4523                      .dwattr $C$DW$686, DW_AT_name("speed_fb_pu")
    4524                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_speed_fb_pu")
    4525                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4526                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4527              $C$DW$687       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$32)
    4529                      .dwattr $C$DW$687, DW_AT_name("speed_outMax_pu")
    4530                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4531                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4532                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4533              $C$DW$688       .dwtag  DW_TAG_member
    4534                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$70)
    4535                      .dwattr $C$DW$688, DW_AT_name("flag_enableCurrentCtrl")
    4536                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4537                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4538                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4539                      .dwendtag $C$DW$T$71
    4540              
    4541              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4542                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$71)
    4543                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4544              $C$DW$T$228     .dwtag  DW_TAG_pointer_type
    4545                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    4546                      .dwattr $C$DW$T$228, DW_AT_address_class(0x20)
    4547              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    4548                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$71)
    4549                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    4550              $C$DW$T$201     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4551                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$200)
    4552                      .dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
    4553              $C$DW$689       .dwtag  DW_TAG_TI_far_type
    4554                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$201)
    4555              $C$DW$T$229     .dwtag  DW_TAG_const_type
    4556                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$689)
    4557              
    4558              $C$DW$T$74      .dwtag  DW_TAG_structure_type
    4559                      .dwattr $C$DW$T$74, DW_AT_name("_CTRL_Version_")
    4560                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x04)
    4561              $C$DW$690       .dwtag  DW_TAG_member
    4562                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    4563                      .dwattr $C$DW$690, DW_AT_name("rsvd")
    4564                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_rsvd")
    4565                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4566                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4567              $C$DW$691       .dwtag  DW_TAG_member
    4568                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$73)
    4569                      .dwattr $C$DW$691, DW_AT_name("targetProc")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   91

    4570                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_targetProc")
    4571                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4572                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$692       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    4575                      .dwattr $C$DW$692, DW_AT_name("major")
    4576                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_major")
    4577                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4578                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4579              $C$DW$693       .dwtag  DW_TAG_member
    4580                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    4581                      .dwattr $C$DW$693, DW_AT_name("minor")
    4582                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_minor")
    4583                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4584                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4585                      .dwendtag $C$DW$T$74
    4586              
    4587              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4588                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$74)
    4589                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4590              $C$DW$T$237     .dwtag  DW_TAG_pointer_type
    4591                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$38)
    4592                      .dwattr $C$DW$T$237, DW_AT_address_class(0x20)
    4593              
    4594              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    4595                      .dwattr $C$DW$T$81, DW_AT_name("_DRV8301_Obj_")
    4596                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x08)
    4597              $C$DW$694       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$76)
    4599                      .dwattr $C$DW$694, DW_AT_name("spiHandle")
    4600                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_spiHandle")
    4601                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4602                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4603              $C$DW$695       .dwtag  DW_TAG_member
    4604                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$78)
    4605                      .dwattr $C$DW$695, DW_AT_name("gpioHandle")
    4606                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_gpioHandle")
    4607                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4608                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4609              $C$DW$696       .dwtag  DW_TAG_member
    4610                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$80)
    4611                      .dwattr $C$DW$696, DW_AT_name("gpioNumber")
    4612                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_gpioNumber")
    4613                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4614                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$697       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$70)
    4617                      .dwattr $C$DW$697, DW_AT_name("RxTimeOut")
    4618                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_RxTimeOut")
    4619                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4620                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4621              $C$DW$698       .dwtag  DW_TAG_member
    4622                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$70)
    4623                      .dwattr $C$DW$698, DW_AT_name("enableTimeOut")
    4624                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_enableTimeOut")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   92

    4625                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4626                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4627                      .dwendtag $C$DW$T$81
    4628              
    4629              $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    4630                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$81)
    4631                      .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    4632              $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    4633                      .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$81)
    4634                      .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    4635              $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    4636                      .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    4637                      .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4638              
    4639              $C$DW$T$92      .dwtag  DW_TAG_structure_type
    4640                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4641                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x05)
    4642              $C$DW$699       .dwtag  DW_TAG_member
    4643                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$83)
    4644                      .dwattr $C$DW$699, DW_AT_name("DRV8301_CURRENT")
    4645                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    4646                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4647                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4648              $C$DW$700       .dwtag  DW_TAG_member
    4649                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$85)
    4650                      .dwattr $C$DW$700, DW_AT_name("DRV8301_RESET")
    4651                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_DRV8301_RESET")
    4652                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4653                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$701       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$87)
    4656                      .dwattr $C$DW$701, DW_AT_name("PWM_MODE")
    4657                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_PWM_MODE")
    4658                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4659                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4660              $C$DW$702       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$89)
    4662                      .dwattr $C$DW$702, DW_AT_name("OC_MODE")
    4663                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_OC_MODE")
    4664                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4665                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4666              $C$DW$703       .dwtag  DW_TAG_member
    4667                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$91)
    4668                      .dwattr $C$DW$703, DW_AT_name("OC_ADJ_SET")
    4669                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    4670                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4671                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4672                      .dwendtag $C$DW$T$92
    4673              
    4674              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    4675                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$92)
    4676                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    4677              
    4678              $C$DW$T$101     .dwtag  DW_TAG_structure_type
    4679                      .dwattr $C$DW$T$101, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   93

    4680                      .dwattr $C$DW$T$101, DW_AT_byte_size(0x04)
    4681              $C$DW$704       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$94)
    4683                      .dwattr $C$DW$704, DW_AT_name("OCTW_SET")
    4684                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_OCTW_SET")
    4685                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4686                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4687              $C$DW$705       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$96)
    4689                      .dwattr $C$DW$705, DW_AT_name("GAIN")
    4690                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_GAIN")
    4691                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4692                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$706       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$98)
    4695                      .dwattr $C$DW$706, DW_AT_name("DC_CAL_CH1p2")
    4696                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    4697                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4698                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4699              $C$DW$707       .dwtag  DW_TAG_member
    4700                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$100)
    4701                      .dwattr $C$DW$707, DW_AT_name("OC_TOFF")
    4702                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_OC_TOFF")
    4703                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4704                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4705                      .dwendtag $C$DW$T$101
    4706              
    4707              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    4708                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$101)
    4709                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    4710              
    4711              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    4712                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    4713                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x0b)
    4714              $C$DW$708       .dwtag  DW_TAG_member
    4715                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$70)
    4716                      .dwattr $C$DW$708, DW_AT_name("FAULT")
    4717                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_FAULT")
    4718                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4719                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4720              $C$DW$709       .dwtag  DW_TAG_member
    4721                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$70)
    4722                      .dwattr $C$DW$709, DW_AT_name("GVDD_UV")
    4723                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_GVDD_UV")
    4724                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4725                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4726              $C$DW$710       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$70)
    4728                      .dwattr $C$DW$710, DW_AT_name("PVDD_UV")
    4729                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_PVDD_UV")
    4730                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4731                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4732              $C$DW$711       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$70)
    4734                      .dwattr $C$DW$711, DW_AT_name("OTSD")
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   94

    4735                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_OTSD")
    4736                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4737                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4738              $C$DW$712       .dwtag  DW_TAG_member
    4739                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$70)
    4740                      .dwattr $C$DW$712, DW_AT_name("OTW")
    4741                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_OTW")
    4742                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4743                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4744              $C$DW$713       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$70)
    4746                      .dwattr $C$DW$713, DW_AT_name("FETHA_OC")
    4747                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_FETHA_OC")
    4748                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4749                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4750              $C$DW$714       .dwtag  DW_TAG_member
    4751                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$70)
    4752                      .dwattr $C$DW$714, DW_AT_name("FETLA_OC")
    4753                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_FETLA_OC")
    4754                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4755                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4756              $C$DW$715       .dwtag  DW_TAG_member
    4757                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$70)
    4758                      .dwattr $C$DW$715, DW_AT_name("FETHB_OC")
    4759                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_FETHB_OC")
    4760                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4761                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4762              $C$DW$716       .dwtag  DW_TAG_member
    4763                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$70)
    4764                      .dwattr $C$DW$716, DW_AT_name("FETLB_OC")
    4765                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_FETLB_OC")
    4766                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4767                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4768              $C$DW$717       .dwtag  DW_TAG_member
    4769                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$70)
    4770                      .dwattr $C$DW$717, DW_AT_name("FETHC_OC")
    4771                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_FETHC_OC")
    4772                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4773                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4774              $C$DW$718       .dwtag  DW_TAG_member
    4775                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$70)
    4776                      .dwattr $C$DW$718, DW_AT_name("FETLC_OC")
    4777                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_FETLC_OC")
    4778                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4779                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4780                      .dwendtag $C$DW$T$102
    4781              
    4782              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    4783                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$102)
    4784                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    4785              
    4786              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    4787                      .dwattr $C$DW$T$103, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    4788                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x02)
    4789              $C$DW$719       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   95

    4790                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$70)
    4791                      .dwattr $C$DW$719, DW_AT_name("GVDD_OV")
    4792                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_GVDD_OV")
    4793                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4794                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4795              $C$DW$720       .dwtag  DW_TAG_member
    4796                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    4797                      .dwattr $C$DW$720, DW_AT_name("DeviceID")
    4798                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_DeviceID")
    4799                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4800                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4801                      .dwendtag $C$DW$T$103
    4802              
    4803              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    4804                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$103)
    4805                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4806              
    4807              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    4808                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    4809                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x18)
    4810              $C$DW$721       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$104)
    4812                      .dwattr $C$DW$721, DW_AT_name("Stat_Reg_1")
    4813                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_Stat_Reg_1")
    4814                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4815                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4816              $C$DW$722       .dwtag  DW_TAG_member
    4817                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$105)
    4818                      .dwattr $C$DW$722, DW_AT_name("Stat_Reg_2")
    4819                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_Stat_Reg_2")
    4820                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4821                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4822              $C$DW$723       .dwtag  DW_TAG_member
    4823                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$106)
    4824                      .dwattr $C$DW$723, DW_AT_name("Ctrl_Reg_1")
    4825                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    4826                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4827                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4828              $C$DW$724       .dwtag  DW_TAG_member
    4829                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$107)
    4830                      .dwattr $C$DW$724, DW_AT_name("Ctrl_Reg_2")
    4831                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    4832                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4833                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4834              $C$DW$725       .dwtag  DW_TAG_member
    4835                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$70)
    4836                      .dwattr $C$DW$725, DW_AT_name("SndCmd")
    4837                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_SndCmd")
    4838                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4839                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4840              $C$DW$726       .dwtag  DW_TAG_member
    4841                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$70)
    4842                      .dwattr $C$DW$726, DW_AT_name("RcvCmd")
    4843                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_RcvCmd")
    4844                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
TMS320C2000 Assembler PC v6.4.11 Wed Nov 23 10:34:31 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3793210                            PAGE   96

    4845                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4846                      .dwendtag $C$DW$T$108
    4847              
    4848              $C$DW$T$240     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    4849                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$108)
    4850                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    4851              $C$DW$T$241     .dwtag  DW_TAG_pointer_type
    4852                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$T$240)
    4853                      .dwattr $C$DW$T$241, DW_AT_address_class(0x20)
    4854              
    4855              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4856                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    4857                      .dwattr $C$DW$T$19, DW_AT_declaration
    4858                      .dwendtag $C$DW$T$19
    4859              
    4860              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4861                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$19)
    4862                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4863              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
