TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Mon Jul 11 12:58:34 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3373              $C$DW$511       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    3374              $C$DW$512       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    3375              $C$DW$513       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    3376              $C$DW$514       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    3377              $C$DW$515       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    3378              $C$DW$516       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    3379              $C$DW$517       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3380              $C$DW$518       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3381              $C$DW$519       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3382              $C$DW$520       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3383              $C$DW$521       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3384                      .dwendtag $C$DW$T$233
    3385              
    3386              $C$DW$T$234     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3387                      .dwattr $C$DW$T$234, DW_AT_type(*$C$DW$T$233)
    3388                      .dwattr $C$DW$T$234, DW_AT_language(DW_LANG_C)
    3389              
    3390              $C$DW$T$236     .dwtag  DW_TAG_enumeration_type
    3391                      .dwattr $C$DW$T$236, DW_AT_byte_size(0x01)
    3392              $C$DW$522       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3393              $C$DW$523       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3394              $C$DW$524       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3395              $C$DW$525       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3396              $C$DW$526       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3397              $C$DW$527       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3398              $C$DW$528       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3399              $C$DW$529       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3400              $C$DW$530       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3401              $C$DW$531       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3402              $C$DW$532       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3403              $C$DW$533       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3404                      .dwendtag $C$DW$T$236
    3405              
    3406              $C$DW$T$237     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3407                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    3408                      .dwattr $C$DW$T$237, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   69

    3409              
    3410              $C$DW$T$239     .dwtag  DW_TAG_enumeration_type
    3411                      .dwattr $C$DW$T$239, DW_AT_byte_size(0x01)
    3412              $C$DW$534       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3413              $C$DW$535       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3414              $C$DW$536       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3415                      .dwendtag $C$DW$T$239
    3416              
    3417              $C$DW$T$240     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3418                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$239)
    3419                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    3420              
    3421              $C$DW$T$242     .dwtag  DW_TAG_enumeration_type
    3422                      .dwattr $C$DW$T$242, DW_AT_byte_size(0x01)
    3423              $C$DW$537       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3424              $C$DW$538       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3425                      .dwendtag $C$DW$T$242
    3426              
    3427              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3428                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    3429                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    3430              
    3431              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3432                      .dwattr $C$DW$T$23, DW_AT_name("I2CEMDR_BITS")
    3433                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3434              $C$DW$539       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
    3436                      .dwattr $C$DW$539, DW_AT_name("BCM")
    3437                      .dwattr $C$DW$539, DW_AT_TI_symbol_name("_BCM")
    3438                      .dwattr $C$DW$539, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3439                      .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3440                      .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$540       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
    3443                      .dwattr $C$DW$540, DW_AT_name("rsvd1")
    3444                      .dwattr $C$DW$540, DW_AT_TI_symbol_name("_rsvd1")
    3445                      .dwattr $C$DW$540, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    3446                      .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3447                      .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    3448                      .dwendtag $C$DW$T$23
    3449              
    3450              
    3451              $C$DW$T$24      .dwtag  DW_TAG_union_type
    3452                      .dwattr $C$DW$T$24, DW_AT_name("I2CEMDR_REG")
    3453                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3454              $C$DW$541       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
    3456                      .dwattr $C$DW$541, DW_AT_name("all")
    3457                      .dwattr $C$DW$541, DW_AT_TI_symbol_name("_all")
    3458                      .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3459                      .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    3460              $C$DW$542       .dwtag  DW_TAG_member
    3461                      .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$23)
    3462                      .dwattr $C$DW$542, DW_AT_name("bit")
    3463                      .dwattr $C$DW$542, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   70

    3464                      .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3465                      .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    3466                      .dwendtag $C$DW$T$24
    3467              
    3468              
    3469              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3470                      .dwattr $C$DW$T$25, DW_AT_name("I2CFFRX_BITS")
    3471                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3472              $C$DW$543       .dwtag  DW_TAG_member
    3473                      .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
    3474                      .dwattr $C$DW$543, DW_AT_name("RXFFIL")
    3475                      .dwattr $C$DW$543, DW_AT_TI_symbol_name("_RXFFIL")
    3476                      .dwattr $C$DW$543, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    3477                      .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3478                      .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    3479              $C$DW$544       .dwtag  DW_TAG_member
    3480                      .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
    3481                      .dwattr $C$DW$544, DW_AT_name("RXFFIENA")
    3482                      .dwattr $C$DW$544, DW_AT_TI_symbol_name("_RXFFIENA")
    3483                      .dwattr $C$DW$544, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3484                      .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3485                      .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$545       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
    3488                      .dwattr $C$DW$545, DW_AT_name("RXFFINTCLR")
    3489                      .dwattr $C$DW$545, DW_AT_TI_symbol_name("_RXFFINTCLR")
    3490                      .dwattr $C$DW$545, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3491                      .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3492                      .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    3493              $C$DW$546       .dwtag  DW_TAG_member
    3494                      .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
    3495                      .dwattr $C$DW$546, DW_AT_name("RXFFINT")
    3496                      .dwattr $C$DW$546, DW_AT_TI_symbol_name("_RXFFINT")
    3497                      .dwattr $C$DW$546, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3498                      .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                      .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    3500              $C$DW$547       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
    3502                      .dwattr $C$DW$547, DW_AT_name("RXFFST")
    3503                      .dwattr $C$DW$547, DW_AT_TI_symbol_name("_RXFFST")
    3504                      .dwattr $C$DW$547, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    3505                      .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3506                      .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$548       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
    3509                      .dwattr $C$DW$548, DW_AT_name("RXFFRST")
    3510                      .dwattr $C$DW$548, DW_AT_TI_symbol_name("_RXFFRST")
    3511                      .dwattr $C$DW$548, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3512                      .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3513                      .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    3514              $C$DW$549       .dwtag  DW_TAG_member
    3515                      .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    3516                      .dwattr $C$DW$549, DW_AT_name("rsvd1")
    3517                      .dwattr $C$DW$549, DW_AT_TI_symbol_name("_rsvd1")
    3518                      .dwattr $C$DW$549, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   71

    3519                      .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3520                      .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    3521                      .dwendtag $C$DW$T$25
    3522              
    3523              
    3524              $C$DW$T$26      .dwtag  DW_TAG_union_type
    3525                      .dwattr $C$DW$T$26, DW_AT_name("I2CFFRX_REG")
    3526                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3527              $C$DW$550       .dwtag  DW_TAG_member
    3528                      .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    3529                      .dwattr $C$DW$550, DW_AT_name("all")
    3530                      .dwattr $C$DW$550, DW_AT_TI_symbol_name("_all")
    3531                      .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3532                      .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    3533              $C$DW$551       .dwtag  DW_TAG_member
    3534                      .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$25)
    3535                      .dwattr $C$DW$551, DW_AT_name("bit")
    3536                      .dwattr $C$DW$551, DW_AT_TI_symbol_name("_bit")
    3537                      .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3538                      .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    3539                      .dwendtag $C$DW$T$26
    3540              
    3541              
    3542              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3543                      .dwattr $C$DW$T$27, DW_AT_name("I2CFFTX_BITS")
    3544                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3545              $C$DW$552       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    3547                      .dwattr $C$DW$552, DW_AT_name("TXFFIL")
    3548                      .dwattr $C$DW$552, DW_AT_TI_symbol_name("_TXFFIL")
    3549                      .dwattr $C$DW$552, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    3550                      .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3551                      .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$553       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    3554                      .dwattr $C$DW$553, DW_AT_name("TXFFIENA")
    3555                      .dwattr $C$DW$553, DW_AT_TI_symbol_name("_TXFFIENA")
    3556                      .dwattr $C$DW$553, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3557                      .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3558                      .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    3559              $C$DW$554       .dwtag  DW_TAG_member
    3560                      .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
    3561                      .dwattr $C$DW$554, DW_AT_name("TXFFINTCLR")
    3562                      .dwattr $C$DW$554, DW_AT_TI_symbol_name("_TXFFINTCLR")
    3563                      .dwattr $C$DW$554, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3564                      .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3565                      .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$555       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
    3568                      .dwattr $C$DW$555, DW_AT_name("TXFFINT")
    3569                      .dwattr $C$DW$555, DW_AT_TI_symbol_name("_TXFFINT")
    3570                      .dwattr $C$DW$555, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3571                      .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3572                      .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$556       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   72

    3574                      .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
    3575                      .dwattr $C$DW$556, DW_AT_name("TXFFST")
    3576                      .dwattr $C$DW$556, DW_AT_TI_symbol_name("_TXFFST")
    3577                      .dwattr $C$DW$556, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    3578                      .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3579                      .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$557       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
    3582                      .dwattr $C$DW$557, DW_AT_name("TXFFRST")
    3583                      .dwattr $C$DW$557, DW_AT_TI_symbol_name("_TXFFRST")
    3584                      .dwattr $C$DW$557, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3585                      .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3586                      .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    3587              $C$DW$558       .dwtag  DW_TAG_member
    3588                      .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
    3589                      .dwattr $C$DW$558, DW_AT_name("I2CFFEN")
    3590                      .dwattr $C$DW$558, DW_AT_TI_symbol_name("_I2CFFEN")
    3591                      .dwattr $C$DW$558, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3592                      .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3593                      .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
    3594              $C$DW$559       .dwtag  DW_TAG_member
    3595                      .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
    3596                      .dwattr $C$DW$559, DW_AT_name("rsvd1")
    3597                      .dwattr $C$DW$559, DW_AT_TI_symbol_name("_rsvd1")
    3598                      .dwattr $C$DW$559, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3599                      .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3600                      .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    3601                      .dwendtag $C$DW$T$27
    3602              
    3603              
    3604              $C$DW$T$28      .dwtag  DW_TAG_union_type
    3605                      .dwattr $C$DW$T$28, DW_AT_name("I2CFFTX_REG")
    3606                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3607              $C$DW$560       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
    3609                      .dwattr $C$DW$560, DW_AT_name("all")
    3610                      .dwattr $C$DW$560, DW_AT_TI_symbol_name("_all")
    3611                      .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3612                      .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    3613              $C$DW$561       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$27)
    3615                      .dwattr $C$DW$561, DW_AT_name("bit")
    3616                      .dwattr $C$DW$561, DW_AT_TI_symbol_name("_bit")
    3617                      .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3618                      .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    3619                      .dwendtag $C$DW$T$28
    3620              
    3621              
    3622              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3623                      .dwattr $C$DW$T$29, DW_AT_name("I2CIER_BITS")
    3624                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3625              $C$DW$562       .dwtag  DW_TAG_member
    3626                      .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
    3627                      .dwattr $C$DW$562, DW_AT_name("ARBL")
    3628                      .dwattr $C$DW$562, DW_AT_TI_symbol_name("_ARBL")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   73

    3629                      .dwattr $C$DW$562, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3630                      .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3631                      .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    3632              $C$DW$563       .dwtag  DW_TAG_member
    3633                      .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
    3634                      .dwattr $C$DW$563, DW_AT_name("NACK")
    3635                      .dwattr $C$DW$563, DW_AT_TI_symbol_name("_NACK")
    3636                      .dwattr $C$DW$563, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3637                      .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3638                      .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    3639              $C$DW$564       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
    3641                      .dwattr $C$DW$564, DW_AT_name("ARDY")
    3642                      .dwattr $C$DW$564, DW_AT_TI_symbol_name("_ARDY")
    3643                      .dwattr $C$DW$564, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3644                      .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                      .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    3646              $C$DW$565       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$22)
    3648                      .dwattr $C$DW$565, DW_AT_name("RRDY")
    3649                      .dwattr $C$DW$565, DW_AT_TI_symbol_name("_RRDY")
    3650                      .dwattr $C$DW$565, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3651                      .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3652                      .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    3653              $C$DW$566       .dwtag  DW_TAG_member
    3654                      .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
    3655                      .dwattr $C$DW$566, DW_AT_name("XRDY")
    3656                      .dwattr $C$DW$566, DW_AT_TI_symbol_name("_XRDY")
    3657                      .dwattr $C$DW$566, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3658                      .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3659                      .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    3660              $C$DW$567       .dwtag  DW_TAG_member
    3661                      .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$22)
    3662                      .dwattr $C$DW$567, DW_AT_name("SCD")
    3663                      .dwattr $C$DW$567, DW_AT_TI_symbol_name("_SCD")
    3664                      .dwattr $C$DW$567, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3665                      .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3666                      .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$568       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$22)
    3669                      .dwattr $C$DW$568, DW_AT_name("AAS")
    3670                      .dwattr $C$DW$568, DW_AT_TI_symbol_name("_AAS")
    3671                      .dwattr $C$DW$568, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3672                      .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3673                      .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$569       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$22)
    3676                      .dwattr $C$DW$569, DW_AT_name("rsvd")
    3677                      .dwattr $C$DW$569, DW_AT_TI_symbol_name("_rsvd")
    3678                      .dwattr $C$DW$569, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    3679                      .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3680                      .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
    3681                      .dwendtag $C$DW$T$29
    3682              
    3683              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   74

    3684              $C$DW$T$30      .dwtag  DW_TAG_union_type
    3685                      .dwattr $C$DW$T$30, DW_AT_name("I2CIER_REG")
    3686                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3687              $C$DW$570       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
    3689                      .dwattr $C$DW$570, DW_AT_name("all")
    3690                      .dwattr $C$DW$570, DW_AT_TI_symbol_name("_all")
    3691                      .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3692                      .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$571       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$29)
    3695                      .dwattr $C$DW$571, DW_AT_name("bit")
    3696                      .dwattr $C$DW$571, DW_AT_TI_symbol_name("_bit")
    3697                      .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3698                      .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    3699                      .dwendtag $C$DW$T$30
    3700              
    3701              
    3702              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3703                      .dwattr $C$DW$T$31, DW_AT_name("I2CISRC_BITS")
    3704                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3705              $C$DW$572       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
    3707                      .dwattr $C$DW$572, DW_AT_name("INTCODE")
    3708                      .dwattr $C$DW$572, DW_AT_TI_symbol_name("_INTCODE")
    3709                      .dwattr $C$DW$572, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    3710                      .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711                      .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$573       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$22)
    3714                      .dwattr $C$DW$573, DW_AT_name("rsvd1")
    3715                      .dwattr $C$DW$573, DW_AT_TI_symbol_name("_rsvd1")
    3716                      .dwattr $C$DW$573, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3717                      .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3718                      .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    3719                      .dwendtag $C$DW$T$31
    3720              
    3721              
    3722              $C$DW$T$32      .dwtag  DW_TAG_union_type
    3723                      .dwattr $C$DW$T$32, DW_AT_name("I2CISRC_REG")
    3724                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    3725              $C$DW$574       .dwtag  DW_TAG_member
    3726                      .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
    3727                      .dwattr $C$DW$574, DW_AT_name("all")
    3728                      .dwattr $C$DW$574, DW_AT_TI_symbol_name("_all")
    3729                      .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3730                      .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    3731              $C$DW$575       .dwtag  DW_TAG_member
    3732                      .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$31)
    3733                      .dwattr $C$DW$575, DW_AT_name("bit")
    3734                      .dwattr $C$DW$575, DW_AT_TI_symbol_name("_bit")
    3735                      .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3736                      .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    3737                      .dwendtag $C$DW$T$32
    3738              
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   75

    3739              
    3740              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3741                      .dwattr $C$DW$T$33, DW_AT_name("I2CMDR_BITS")
    3742                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3743              $C$DW$576       .dwtag  DW_TAG_member
    3744                      .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
    3745                      .dwattr $C$DW$576, DW_AT_name("BC")
    3746                      .dwattr $C$DW$576, DW_AT_TI_symbol_name("_BC")
    3747                      .dwattr $C$DW$576, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    3748                      .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                      .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    3750              $C$DW$577       .dwtag  DW_TAG_member
    3751                      .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
    3752                      .dwattr $C$DW$577, DW_AT_name("FDF")
    3753                      .dwattr $C$DW$577, DW_AT_TI_symbol_name("_FDF")
    3754                      .dwattr $C$DW$577, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3755                      .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                      .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    3757              $C$DW$578       .dwtag  DW_TAG_member
    3758                      .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
    3759                      .dwattr $C$DW$578, DW_AT_name("STB")
    3760                      .dwattr $C$DW$578, DW_AT_TI_symbol_name("_STB")
    3761                      .dwattr $C$DW$578, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3762                      .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3763                      .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    3764              $C$DW$579       .dwtag  DW_TAG_member
    3765                      .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
    3766                      .dwattr $C$DW$579, DW_AT_name("IRS")
    3767                      .dwattr $C$DW$579, DW_AT_TI_symbol_name("_IRS")
    3768                      .dwattr $C$DW$579, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3769                      .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3770                      .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    3771              $C$DW$580       .dwtag  DW_TAG_member
    3772                      .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
    3773                      .dwattr $C$DW$580, DW_AT_name("DLB")
    3774                      .dwattr $C$DW$580, DW_AT_TI_symbol_name("_DLB")
    3775                      .dwattr $C$DW$580, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3776                      .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3777                      .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$581       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
    3780                      .dwattr $C$DW$581, DW_AT_name("RM")
    3781                      .dwattr $C$DW$581, DW_AT_TI_symbol_name("_RM")
    3782                      .dwattr $C$DW$581, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3783                      .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3784                      .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    3785              $C$DW$582       .dwtag  DW_TAG_member
    3786                      .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
    3787                      .dwattr $C$DW$582, DW_AT_name("XA")
    3788                      .dwattr $C$DW$582, DW_AT_TI_symbol_name("_XA")
    3789                      .dwattr $C$DW$582, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3790                      .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3791                      .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    3792              $C$DW$583       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   76

    3794                      .dwattr $C$DW$583, DW_AT_name("TRX")
    3795                      .dwattr $C$DW$583, DW_AT_TI_symbol_name("_TRX")
    3796                      .dwattr $C$DW$583, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3797                      .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3798                      .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    3799              $C$DW$584       .dwtag  DW_TAG_member
    3800                      .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$22)
    3801                      .dwattr $C$DW$584, DW_AT_name("MST")
    3802                      .dwattr $C$DW$584, DW_AT_TI_symbol_name("_MST")
    3803                      .dwattr $C$DW$584, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3804                      .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3805                      .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$585       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$22)
    3808                      .dwattr $C$DW$585, DW_AT_name("STP")
    3809                      .dwattr $C$DW$585, DW_AT_TI_symbol_name("_STP")
    3810                      .dwattr $C$DW$585, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3811                      .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                      .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$586       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$22)
    3815                      .dwattr $C$DW$586, DW_AT_name("rsvd1")
    3816                      .dwattr $C$DW$586, DW_AT_TI_symbol_name("_rsvd1")
    3817                      .dwattr $C$DW$586, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3818                      .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3819                      .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$587       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$22)
    3822                      .dwattr $C$DW$587, DW_AT_name("STT")
    3823                      .dwattr $C$DW$587, DW_AT_TI_symbol_name("_STT")
    3824                      .dwattr $C$DW$587, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3825                      .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3826                      .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$588       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$22)
    3829                      .dwattr $C$DW$588, DW_AT_name("FREE")
    3830                      .dwattr $C$DW$588, DW_AT_TI_symbol_name("_FREE")
    3831                      .dwattr $C$DW$588, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3832                      .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3833                      .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$589       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$589, DW_AT_type(*$C$DW$T$22)
    3836                      .dwattr $C$DW$589, DW_AT_name("NACKMOD")
    3837                      .dwattr $C$DW$589, DW_AT_TI_symbol_name("_NACKMOD")
    3838                      .dwattr $C$DW$589, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3839                      .dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3840                      .dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
    3841                      .dwendtag $C$DW$T$33
    3842              
    3843              
    3844              $C$DW$T$34      .dwtag  DW_TAG_union_type
    3845                      .dwattr $C$DW$T$34, DW_AT_name("I2CMDR_REG")
    3846                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3847              $C$DW$590       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$590, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   77

    3849                      .dwattr $C$DW$590, DW_AT_name("all")
    3850                      .dwattr $C$DW$590, DW_AT_TI_symbol_name("_all")
    3851                      .dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3852                      .dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
    3853              $C$DW$591       .dwtag  DW_TAG_member
    3854                      .dwattr $C$DW$591, DW_AT_type(*$C$DW$T$33)
    3855                      .dwattr $C$DW$591, DW_AT_name("bit")
    3856                      .dwattr $C$DW$591, DW_AT_TI_symbol_name("_bit")
    3857                      .dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3858                      .dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
    3859                      .dwendtag $C$DW$T$34
    3860              
    3861              
    3862              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3863                      .dwattr $C$DW$T$35, DW_AT_name("I2CPSC_BITS")
    3864                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    3865              $C$DW$592       .dwtag  DW_TAG_member
    3866                      .dwattr $C$DW$592, DW_AT_type(*$C$DW$T$22)
    3867                      .dwattr $C$DW$592, DW_AT_name("IPSC")
    3868                      .dwattr $C$DW$592, DW_AT_TI_symbol_name("_IPSC")
    3869                      .dwattr $C$DW$592, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3870                      .dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3871                      .dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
    3872              $C$DW$593       .dwtag  DW_TAG_member
    3873                      .dwattr $C$DW$593, DW_AT_type(*$C$DW$T$22)
    3874                      .dwattr $C$DW$593, DW_AT_name("rsvd1")
    3875                      .dwattr $C$DW$593, DW_AT_TI_symbol_name("_rsvd1")
    3876                      .dwattr $C$DW$593, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3877                      .dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3878                      .dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
    3879                      .dwendtag $C$DW$T$35
    3880              
    3881              
    3882              $C$DW$T$36      .dwtag  DW_TAG_union_type
    3883                      .dwattr $C$DW$T$36, DW_AT_name("I2CPSC_REG")
    3884                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    3885              $C$DW$594       .dwtag  DW_TAG_member
    3886                      .dwattr $C$DW$594, DW_AT_type(*$C$DW$T$22)
    3887                      .dwattr $C$DW$594, DW_AT_name("all")
    3888                      .dwattr $C$DW$594, DW_AT_TI_symbol_name("_all")
    3889                      .dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3890                      .dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
    3891              $C$DW$595       .dwtag  DW_TAG_member
    3892                      .dwattr $C$DW$595, DW_AT_type(*$C$DW$T$35)
    3893                      .dwattr $C$DW$595, DW_AT_name("bit")
    3894                      .dwattr $C$DW$595, DW_AT_TI_symbol_name("_bit")
    3895                      .dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3896                      .dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
    3897                      .dwendtag $C$DW$T$36
    3898              
    3899              
    3900              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3901                      .dwattr $C$DW$T$37, DW_AT_name("I2CSTR_BITS")
    3902                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3903              $C$DW$596       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   78

    3904                      .dwattr $C$DW$596, DW_AT_type(*$C$DW$T$22)
    3905                      .dwattr $C$DW$596, DW_AT_name("ARBL")
    3906                      .dwattr $C$DW$596, DW_AT_TI_symbol_name("_ARBL")
    3907                      .dwattr $C$DW$596, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3908                      .dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3909                      .dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
    3910              $C$DW$597       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$597, DW_AT_type(*$C$DW$T$22)
    3912                      .dwattr $C$DW$597, DW_AT_name("NACK")
    3913                      .dwattr $C$DW$597, DW_AT_TI_symbol_name("_NACK")
    3914                      .dwattr $C$DW$597, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3915                      .dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3916                      .dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
    3917              $C$DW$598       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$598, DW_AT_type(*$C$DW$T$22)
    3919                      .dwattr $C$DW$598, DW_AT_name("ARDY")
    3920                      .dwattr $C$DW$598, DW_AT_TI_symbol_name("_ARDY")
    3921                      .dwattr $C$DW$598, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3922                      .dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3923                      .dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$599       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$22)
    3926                      .dwattr $C$DW$599, DW_AT_name("RRDY")
    3927                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_RRDY")
    3928                      .dwattr $C$DW$599, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3929                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3930                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$600       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$22)
    3933                      .dwattr $C$DW$600, DW_AT_name("XRDY")
    3934                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_XRDY")
    3935                      .dwattr $C$DW$600, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3936                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3937                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    3938              $C$DW$601       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$22)
    3940                      .dwattr $C$DW$601, DW_AT_name("SCD")
    3941                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_SCD")
    3942                      .dwattr $C$DW$601, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3943                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3944                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    3945              $C$DW$602       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$22)
    3947                      .dwattr $C$DW$602, DW_AT_name("rsvd1")
    3948                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_rsvd1")
    3949                      .dwattr $C$DW$602, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3950                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3951                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    3952              $C$DW$603       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$22)
    3954                      .dwattr $C$DW$603, DW_AT_name("AD0")
    3955                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_AD0")
    3956                      .dwattr $C$DW$603, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3957                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3958                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   79

    3959              $C$DW$604       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$22)
    3961                      .dwattr $C$DW$604, DW_AT_name("AAS")
    3962                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_AAS")
    3963                      .dwattr $C$DW$604, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3964                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3965                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    3966              $C$DW$605       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$22)
    3968                      .dwattr $C$DW$605, DW_AT_name("XSMT")
    3969                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_XSMT")
    3970                      .dwattr $C$DW$605, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3971                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3972                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$606       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$22)
    3975                      .dwattr $C$DW$606, DW_AT_name("RSFULL")
    3976                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_RSFULL")
    3977                      .dwattr $C$DW$606, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3978                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3979                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$607       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$22)
    3982                      .dwattr $C$DW$607, DW_AT_name("BB")
    3983                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_BB")
    3984                      .dwattr $C$DW$607, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3985                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3986                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    3987              $C$DW$608       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$22)
    3989                      .dwattr $C$DW$608, DW_AT_name("NACKSNT")
    3990                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_NACKSNT")
    3991                      .dwattr $C$DW$608, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3992                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3993                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$609       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$22)
    3996                      .dwattr $C$DW$609, DW_AT_name("SDIR")
    3997                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_SDIR")
    3998                      .dwattr $C$DW$609, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3999                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4000                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$610       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$22)
    4003                      .dwattr $C$DW$610, DW_AT_name("rsvd2")
    4004                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_rsvd2")
    4005                      .dwattr $C$DW$610, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4006                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4007                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4008                      .dwendtag $C$DW$T$37
    4009              
    4010              
    4011              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4012                      .dwattr $C$DW$T$38, DW_AT_name("I2CSTR_REG")
    4013                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   80

    4014              $C$DW$611       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$22)
    4016                      .dwattr $C$DW$611, DW_AT_name("all")
    4017                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_all")
    4018                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$612       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$37)
    4022                      .dwattr $C$DW$612, DW_AT_name("bit")
    4023                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_bit")
    4024                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4025                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4026                      .dwendtag $C$DW$T$38
    4027              
    4028              
    4029              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4030                      .dwattr $C$DW$T$46, DW_AT_name("_ADC_Obj_")
    4031                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x6650)
    4032              $C$DW$613       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$40)
    4034                      .dwattr $C$DW$613, DW_AT_name("ADCRESULT")
    4035                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_ADCRESULT")
    4036                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4037                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$614       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$41)
    4040                      .dwattr $C$DW$614, DW_AT_name("resvd_1")
    4041                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_resvd_1")
    4042                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4043                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$615       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$39)
    4046                      .dwattr $C$DW$615, DW_AT_name("ADCCTL1")
    4047                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCCTL1")
    4048                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4049                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$616       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$39)
    4052                      .dwattr $C$DW$616, DW_AT_name("ADCCTL2")
    4053                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_ADCCTL2")
    4054                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4055                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$617       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$42)
    4058                      .dwattr $C$DW$617, DW_AT_name("rsvd_2")
    4059                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_rsvd_2")
    4060                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4061                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$618       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$39)
    4064                      .dwattr $C$DW$618, DW_AT_name("ADCINTFLG")
    4065                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_ADCINTFLG")
    4066                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4067                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$619       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   81

    4069                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$39)
    4070                      .dwattr $C$DW$619, DW_AT_name("ADCINTFLGCLR")
    4071                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4072                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4073                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$620       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$39)
    4076                      .dwattr $C$DW$620, DW_AT_name("ADCINTOVF")
    4077                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_ADCINTOVF")
    4078                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4079                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$621       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$39)
    4082                      .dwattr $C$DW$621, DW_AT_name("ADCINTOVFCLR")
    4083                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4084                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4085                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$622       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$43)
    4088                      .dwattr $C$DW$622, DW_AT_name("INTSELxNy")
    4089                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_INTSELxNy")
    4090                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4091                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$623       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$44)
    4094                      .dwattr $C$DW$623, DW_AT_name("rsvd_3")
    4095                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_rsvd_3")
    4096                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4097                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$624       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$39)
    4100                      .dwattr $C$DW$624, DW_AT_name("SOCPRICTRL")
    4101                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4102                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4103                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$625       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$39)
    4106                      .dwattr $C$DW$625, DW_AT_name("rsvd_4")
    4107                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_rsvd_4")
    4108                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4109                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$626       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$39)
    4112                      .dwattr $C$DW$626, DW_AT_name("ADCSAMPLEMODE")
    4113                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4114                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4115                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$627       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$39)
    4118                      .dwattr $C$DW$627, DW_AT_name("rsvd_5")
    4119                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_rsvd_5")
    4120                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4121                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$628       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   82

    4124                      .dwattr $C$DW$628, DW_AT_name("ADCINTSOCSEL1")
    4125                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4126                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4127                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$629       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$39)
    4130                      .dwattr $C$DW$629, DW_AT_name("ADCINTSOCSEL2")
    4131                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4132                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4133                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$630       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$42)
    4136                      .dwattr $C$DW$630, DW_AT_name("rsvd_6")
    4137                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_rsvd_6")
    4138                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4139                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$631       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$39)
    4142                      .dwattr $C$DW$631, DW_AT_name("ADCSOCFLG1")
    4143                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4144                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4145                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$632       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$39)
    4148                      .dwattr $C$DW$632, DW_AT_name("rsvd_7")
    4149                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_rsvd_7")
    4150                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4151                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$633       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$39)
    4154                      .dwattr $C$DW$633, DW_AT_name("ADCSOCFRC1")
    4155                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4156                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4157                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4158              $C$DW$634       .dwtag  DW_TAG_member
    4159                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$39)
    4160                      .dwattr $C$DW$634, DW_AT_name("rsvd_8")
    4161                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_rsvd_8")
    4162                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4163                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4164              $C$DW$635       .dwtag  DW_TAG_member
    4165                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$39)
    4166                      .dwattr $C$DW$635, DW_AT_name("ADCSOCOVF1")
    4167                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4168                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4169                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4170              $C$DW$636       .dwtag  DW_TAG_member
    4171                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$39)
    4172                      .dwattr $C$DW$636, DW_AT_name("rsvd_9")
    4173                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_rsvd_9")
    4174                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4175                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4176              $C$DW$637       .dwtag  DW_TAG_member
    4177                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$39)
    4178                      .dwattr $C$DW$637, DW_AT_name("ADCSOCOVFCLR1")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   83

    4179                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4180                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4181                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4182              $C$DW$638       .dwtag  DW_TAG_member
    4183                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$39)
    4184                      .dwattr $C$DW$638, DW_AT_name("rsvd_10")
    4185                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_rsvd_10")
    4186                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4187                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4188              $C$DW$639       .dwtag  DW_TAG_member
    4189                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$40)
    4190                      .dwattr $C$DW$639, DW_AT_name("ADCSOCxCTL")
    4191                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4192                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4193                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$640       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$40)
    4196                      .dwattr $C$DW$640, DW_AT_name("rsvd_11")
    4197                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_rsvd_11")
    4198                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4199                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4200              $C$DW$641       .dwtag  DW_TAG_member
    4201                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$39)
    4202                      .dwattr $C$DW$641, DW_AT_name("ADCREFTRIM")
    4203                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4204                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4205                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4206              $C$DW$642       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$39)
    4208                      .dwattr $C$DW$642, DW_AT_name("ADCOFFTRIM")
    4209                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4210                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4211                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$643       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$45)
    4214                      .dwattr $C$DW$643, DW_AT_name("resvd_12")
    4215                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_resvd_12")
    4216                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4217                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$644       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$39)
    4220                      .dwattr $C$DW$644, DW_AT_name("ADCREV")
    4221                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_ADCREV")
    4222                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4223                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4224                      .dwendtag $C$DW$T$46
    4225              
    4226              $C$DW$T$245     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4227                      .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$T$46)
    4228                      .dwattr $C$DW$T$245, DW_AT_language(DW_LANG_C)
    4229              $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    4230                      .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$46)
    4231                      .dwattr $C$DW$T$133, DW_AT_address_class(0x20)
    4232              $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4233                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$133)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   84

    4234                      .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4235              
    4236              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4237                      .dwattr $C$DW$T$49, DW_AT_name("_CLARKE_Obj_")
    4238                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x06)
    4239              $C$DW$645       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$47)
    4241                      .dwattr $C$DW$645, DW_AT_name("alpha_sf")
    4242                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_alpha_sf")
    4243                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4244                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$646       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$47)
    4247                      .dwattr $C$DW$646, DW_AT_name("beta_sf")
    4248                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_beta_sf")
    4249                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4250                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$647       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$48)
    4253                      .dwattr $C$DW$647, DW_AT_name("numSensors")
    4254                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_numSensors")
    4255                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4256                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4257                      .dwendtag $C$DW$T$49
    4258              
    4259              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4260                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$49)
    4261                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4262              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    4263                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$49)
    4264                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    4265              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4266                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    4267                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4268              
    4269              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4270                      .dwattr $C$DW$T$51, DW_AT_name("_CLK_Obj_")
    4271                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x11)
    4272              $C$DW$648       .dwtag  DW_TAG_member
    4273                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$39)
    4274                      .dwattr $C$DW$648, DW_AT_name("XCLK")
    4275                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_XCLK")
    4276                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4277                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4278              $C$DW$649       .dwtag  DW_TAG_member
    4279                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$39)
    4280                      .dwattr $C$DW$649, DW_AT_name("rsvd_1")
    4281                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_rsvd_1")
    4282                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4283                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4284              $C$DW$650       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$39)
    4286                      .dwattr $C$DW$650, DW_AT_name("CLKCTL")
    4287                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_CLKCTL")
    4288                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   85

    4289                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$651       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$50)
    4292                      .dwattr $C$DW$651, DW_AT_name("rsvd_2")
    4293                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_rsvd_2")
    4294                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4295                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4296              $C$DW$652       .dwtag  DW_TAG_member
    4297                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$39)
    4298                      .dwattr $C$DW$652, DW_AT_name("LOSPCP")
    4299                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_LOSPCP")
    4300                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4301                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4302              $C$DW$653       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$39)
    4304                      .dwattr $C$DW$653, DW_AT_name("PCLKCR0")
    4305                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_PCLKCR0")
    4306                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4307                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4308              $C$DW$654       .dwtag  DW_TAG_member
    4309                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$39)
    4310                      .dwattr $C$DW$654, DW_AT_name("PCLKCR1")
    4311                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_PCLKCR1")
    4312                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4313                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4314              $C$DW$655       .dwtag  DW_TAG_member
    4315                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$42)
    4316                      .dwattr $C$DW$655, DW_AT_name("rsvd_3")
    4317                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_rsvd_3")
    4318                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4319                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4320              $C$DW$656       .dwtag  DW_TAG_member
    4321                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$39)
    4322                      .dwattr $C$DW$656, DW_AT_name("PCLKCR3")
    4323                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_PCLKCR3")
    4324                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4325                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4326                      .dwendtag $C$DW$T$51
    4327              
    4328              $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    4329                      .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$51)
    4330                      .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    4331              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4332                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    4333                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    4334              
    4335              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4336                      .dwattr $C$DW$T$52, DW_AT_name("_CPU_Obj_")
    4337                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4338              $C$DW$657       .dwtag  DW_TAG_member
    4339                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$48)
    4340                      .dwattr $C$DW$657, DW_AT_name("tmp")
    4341                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_tmp")
    4342                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4343                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   86

    4344                      .dwendtag $C$DW$T$52
    4345              
    4346              $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    4347                      .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$52)
    4348                      .dwattr $C$DW$T$137, DW_AT_address_class(0x20)
    4349              $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4350                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    4351                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    4352              
    4353              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    4354                      .dwattr $C$DW$T$86, DW_AT_name("_CTRL_Obj_")
    4355                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x108)
    4356              $C$DW$658       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$53)
    4358                      .dwattr $C$DW$658, DW_AT_name("version")
    4359                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_version")
    4360                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4361                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$659       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$55)
    4364                      .dwattr $C$DW$659, DW_AT_name("state")
    4365                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_state")
    4366                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4367                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$660       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$55)
    4370                      .dwattr $C$DW$660, DW_AT_name("prevState")
    4371                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_prevState")
    4372                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4373                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$661       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$57)
    4376                      .dwattr $C$DW$661, DW_AT_name("errorCode")
    4377                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_errorCode")
    4378                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4379                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$662       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$59)
    4382                      .dwattr $C$DW$662, DW_AT_name("clarkeHandle_I")
    4383                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4384                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4385                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$663       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$60)
    4388                      .dwattr $C$DW$663, DW_AT_name("clarke_I")
    4389                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_clarke_I")
    4390                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4391                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$664       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$59)
    4394                      .dwattr $C$DW$664, DW_AT_name("clarkeHandle_V")
    4395                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4396                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4397                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4398              $C$DW$665       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   87

    4399                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$60)
    4400                      .dwattr $C$DW$665, DW_AT_name("clarke_V")
    4401                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_clarke_V")
    4402                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4403                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$666       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$62)
    4406                      .dwattr $C$DW$666, DW_AT_name("estHandle")
    4407                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_estHandle")
    4408                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4409                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$667       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$64)
    4412                      .dwattr $C$DW$667, DW_AT_name("parkHandle")
    4413                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_parkHandle")
    4414                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4415                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$668       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$65)
    4418                      .dwattr $C$DW$668, DW_AT_name("park")
    4419                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_park")
    4420                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4421                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$669       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$67)
    4424                      .dwattr $C$DW$669, DW_AT_name("pidHandle_Id")
    4425                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pidHandle_Id")
    4426                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4427                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$670       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$68)
    4430                      .dwattr $C$DW$670, DW_AT_name("pid_Id")
    4431                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pid_Id")
    4432                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4433                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$671       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$67)
    4436                      .dwattr $C$DW$671, DW_AT_name("pidHandle_Iq")
    4437                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4438                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4439                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$672       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$68)
    4442                      .dwattr $C$DW$672, DW_AT_name("pid_Iq")
    4443                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_pid_Iq")
    4444                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4445                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$673       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$67)
    4448                      .dwattr $C$DW$673, DW_AT_name("pidHandle_spd")
    4449                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_pidHandle_spd")
    4450                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4451                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$674       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   88

    4454                      .dwattr $C$DW$674, DW_AT_name("pid_spd")
    4455                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_pid_spd")
    4456                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4457                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$675       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$70)
    4460                      .dwattr $C$DW$675, DW_AT_name("iparkHandle")
    4461                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_iparkHandle")
    4462                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4463                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$676       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$71)
    4466                      .dwattr $C$DW$676, DW_AT_name("ipark")
    4467                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ipark")
    4468                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4469                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$677       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$73)
    4472                      .dwattr $C$DW$677, DW_AT_name("svgenHandle")
    4473                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_svgenHandle")
    4474                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4475                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$678       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$74)
    4478                      .dwattr $C$DW$678, DW_AT_name("svgen")
    4479                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_svgen")
    4480                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4481                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$679       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$76)
    4484                      .dwattr $C$DW$679, DW_AT_name("trajHandle_Id")
    4485                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_trajHandle_Id")
    4486                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4487                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$680       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$77)
    4490                      .dwattr $C$DW$680, DW_AT_name("traj_Id")
    4491                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_traj_Id")
    4492                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4493                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4494              $C$DW$681       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$76)
    4496                      .dwattr $C$DW$681, DW_AT_name("trajHandle_spd")
    4497                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_trajHandle_spd")
    4498                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4499                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$682       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$77)
    4502                      .dwattr $C$DW$682, DW_AT_name("traj_spd")
    4503                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_traj_spd")
    4504                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4505                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$683       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$76)
    4508                      .dwattr $C$DW$683, DW_AT_name("trajHandle_spdMax")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   89

    4509                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4510                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4511                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$684       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$77)
    4514                      .dwattr $C$DW$684, DW_AT_name("traj_spdMax")
    4515                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_traj_spdMax")
    4516                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4517                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$685       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$78)
    4520                      .dwattr $C$DW$685, DW_AT_name("motorParams")
    4521                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_motorParams")
    4522                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4523                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$686       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$81)
    4526                      .dwattr $C$DW$686, DW_AT_name("waitTimes")
    4527                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_waitTimes")
    4528                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4529                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$687       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$80)
    4532                      .dwattr $C$DW$687, DW_AT_name("counter_state")
    4533                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_counter_state")
    4534                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4535                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$688       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$82)
    4538                      .dwattr $C$DW$688, DW_AT_name("numIsrTicksPerCtrlTick")
    4539                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4540                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4541                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$689       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$82)
    4544                      .dwattr $C$DW$689, DW_AT_name("numCtrlTicksPerCurrentTick")
    4545                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4546                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4547                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$690       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$82)
    4550                      .dwattr $C$DW$690, DW_AT_name("numCtrlTicksPerSpeedTick")
    4551                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4552                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4553                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$691       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$82)
    4556                      .dwattr $C$DW$691, DW_AT_name("numCtrlTicksPerTrajTick")
    4557                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4558                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4559                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$692       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$80)
    4562                      .dwattr $C$DW$692, DW_AT_name("ctrlFreq_Hz")
    4563                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
TMS320C2000 Assembler PC v6.4.10 Mon Jul 11 12:58:34 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\2398010                            PAGE   90

    4564                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4565                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$693       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$80)
    4568                      .dwattr $C$DW$693, DW_AT_name("trajFreq_Hz")
    4569                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4570                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4571                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$694       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$47)
    4574                      .dwattr $C$DW$694, DW_AT_name("trajPeriod_sec")
    4575                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4576                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4577                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$695       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$83)
    4580                      .dwattr $C$DW$695, DW_AT_name("ctrlPeriod_sec")
    4581                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4582                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4583                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$696       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$47)
    4586                      .dwattr $C$DW$696, DW_AT_name("maxVsMag_pu")
    4587                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4588                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
