TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:10:28 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3229610                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.10 *
       3              ;* Date/Time created: Thu Jun 09 16:10:28 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/32b/cpu_u
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.10 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.10\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3229610                            PAGE    3

     111                      .dwattr $C$DW$1, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/32b
     112                      .dwattr $C$DW$1, DW_AT_TI_end_line(0x37)
     113                      .dwattr $C$DW$1, DW_AT_TI_end_column(0x01)
     114                      .dwendentry
     115                      .dwendtag $C$DW$1
     116              
     117 00000016               .sect   ".text"
     118                      .clink
     119                      .global _CPU_USAGE_init
     120              
     121              $C$DW$9 .dwtag  DW_TAG_subprogram, DW_AT_name("CPU_USAGE_init")
     122                      .dwattr $C$DW$9, DW_AT_low_pc(_CPU_USAGE_init)
     123                      .dwattr $C$DW$9, DW_AT_high_pc(0x00)
     124                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_CPU_USAGE_init")
     125                      .dwattr $C$DW$9, DW_AT_external
     126                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$24)
     127                      .dwattr $C$DW$9, DW_AT_TI_begin_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/3
     128                      .dwattr $C$DW$9, DW_AT_TI_begin_line(0x15)
     129                      .dwattr $C$DW$9, DW_AT_TI_begin_column(0x12)
     130                      .dwattr $C$DW$9, DW_AT_TI_max_frame_size(-2)
     131                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 22,
     132              
     133                      .dwfde $C$DW$CIE, _CPU_USAGE_init
     134              $C$DW$10        .dwtag  DW_TAG_formal_parameter, DW_AT_name("pMemory")
     135                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_pMemory")
     136                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$3)
     137                      .dwattr $C$DW$10, DW_AT_location[DW_OP_reg12]
     138              $C$DW$11        .dwtag  DW_TAG_formal_parameter, DW_AT_name("numBytes")
     139                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_numBytes")
     140                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$27)
     141                      .dwattr $C$DW$11, DW_AT_location[DW_OP_reg0]
     142              
     143              ;***************************************************************
     144              ;* FNAME: _CPU_USAGE_init               FR SIZE:   0           *
     145              ;*                                                             *
     146              ;* FUNCTION ENVIRONMENT                                        *
     147              ;*                                                             *
     148              ;* FUNCTION PROPERTIES                                         *
     149              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     150              ;***************************************************************
     151              
     152              _CPU_USAGE_init:
     153              ;* AR6   assigned to _numBytes
     154              $C$DW$12        .dwtag  DW_TAG_variable, DW_AT_name("numBytes")
     155                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_numBytes")
     156                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$27)
     157                      .dwattr $C$DW$12, DW_AT_location[DW_OP_reg16]
     158                      .dwcfi  cfa_offset, -2
     159                      .dwcfi  save_reg_to_mem, 26, 0
     160 00000016 1EA6          MOVL      XAR6,ACC              ; [CPU_] |22| 
     161                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/32b/cpu_usage.c",line 26,
     162 00000017 0216          MOVB      ACC,#22               ; [CPU_] |26| 
     163 00000018 0FA6          CMPL      ACC,XAR6              ; [CPU_] |26| 
     164 00000019 56C9          BF        $C$L1,LOS             ; [CPU_] |26| 
         0000001a 0003 
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:10:28 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3229610                            PAGE    4

     165                      ; branchcc occurs ; [] |26| 
     166 0000001b D400          MOVB      XAR4,#0               ; [CPU_] |26| 
     167              $C$L1:    
     168              $C$DW$13        .dwtag  DW_TAG_TI_branch
     169                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     170                      .dwattr $C$DW$13, DW_AT_TI_return
     171 0000001c 0006          LRETR     ; [CPU_] 
     172                      ; return occurs ; [] 
     173                      .dwattr $C$DW$9, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_16/sw/modules/cpu_usage/src/32b
     174                      .dwattr $C$DW$9, DW_AT_TI_end_line(0x20)
     175                      .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     176                      .dwendentry
     177                      .dwendtag $C$DW$9
     178              
     179              
     180              ;***************************************************************
     181              ;* TYPE INFORMATION                                            *
     182              ;***************************************************************
     183              
     184              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     185                      .dwattr $C$DW$T$21, DW_AT_name("_CPU_USAGE_Obj_")
     186                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x16)
     187              $C$DW$14        .dwtag  DW_TAG_member
     188                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     189                      .dwattr $C$DW$14, DW_AT_name("timerPeriod_cnts")
     190                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_timerPeriod_cnts")
     191                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     192                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     193              $C$DW$15        .dwtag  DW_TAG_member
     194                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     195                      .dwattr $C$DW$15, DW_AT_name("cnt_z0")
     196                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_cnt_z0")
     197                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     198                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     199              $C$DW$16        .dwtag  DW_TAG_member
     200                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     201                      .dwattr $C$DW$16, DW_AT_name("cnt_z1")
     202                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_cnt_z1")
     203                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     204                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     205              $C$DW$17        .dwtag  DW_TAG_member
     206                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     207                      .dwattr $C$DW$17, DW_AT_name("deltaCnt")
     208                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_deltaCnt")
     209                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     210                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     211              $C$DW$18        .dwtag  DW_TAG_member
     212                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     213                      .dwattr $C$DW$18, DW_AT_name("deltaCntAcc")
     214                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_deltaCntAcc")
     215                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     216                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     217              $C$DW$19        .dwtag  DW_TAG_member
     218                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     219                      .dwattr $C$DW$19, DW_AT_name("deltaCntAccNum")
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:10:28 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3229610                            PAGE    5

     220                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_deltaCntAccNum")
     221                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     222                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     223              $C$DW$20        .dwtag  DW_TAG_member
     224                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     225                      .dwattr $C$DW$20, DW_AT_name("deltaCntAccNumMax")
     226                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
     227                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     228                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     229              $C$DW$21        .dwtag  DW_TAG_member
     230                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     231                      .dwattr $C$DW$21, DW_AT_name("minDeltaCntObserved")
     232                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_minDeltaCntObserved")
     233                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     234                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     235              $C$DW$22        .dwtag  DW_TAG_member
     236                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     237                      .dwattr $C$DW$22, DW_AT_name("avgDeltaCntObserved")
     238                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
     239                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     240                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     241              $C$DW$23        .dwtag  DW_TAG_member
     242                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     243                      .dwattr $C$DW$23, DW_AT_name("maxDeltaCntObserved")
     244                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
     245                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     246                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     247              $C$DW$24        .dwtag  DW_TAG_member
     248                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     249                      .dwattr $C$DW$24, DW_AT_name("flag_resetStats")
     250                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_flag_resetStats")
     251                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     252                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     253                      .dwendtag $C$DW$T$21
     254              
     255              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
     256                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     257                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     258              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     259                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
     260                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     261              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
     262                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     263                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
     264              $C$DW$25        .dwtag  DW_TAG_TI_far_type
     265                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$24)
     266              $C$DW$T$25      .dwtag  DW_TAG_const_type
     267                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$25)
     268              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     269                      .dwattr $C$DW$T$2, DW_AT_name("void")
     270              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     271                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     272                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     273              $C$DW$T$4       .dwtag  DW_TAG_base_type
     274                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C2000 Assembler PC v6.4.10 Thu Jun 09 16:10:28 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3229610                            PAGE    6

     275                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     276                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     277              $C$DW$T$5       .dwtag  DW_TAG_base_type
     278                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     279                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     280                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     281              $C$DW$T$6       .dwtag  DW_TAG_base_type
     282                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     283                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     284                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     285              $C$DW$T$7       .dwtag  DW_TAG_base_type
     286                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     287                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     288                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     289              $C$DW$T$8       .dwtag  DW_TAG_base_type
     290                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     291                      .dwattr $C$DW$T$8, DW_AT_name("short")
     292                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     293              $C$DW$T$9       .dwtag  DW_TAG_base_type
     294                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     295                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     296                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     297              $C$DW$T$10      .dwtag  DW_TAG_base_type
     298                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     299                      .dwattr $C$DW$T$10, DW_AT_name("int")
     300                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     301              $C$DW$T$11      .dwtag  DW_TAG_base_type
     302                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     303                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
