TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Nov 21 21:48:12 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7432              $C$DW$874       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    7433              $C$DW$875       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    7434                      .dwendtag $C$DW$T$198
    7435              
    7436              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    7437                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$198)
    7438                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    7439              
    7440              $C$DW$T$201     .dwtag  DW_TAG_enumeration_type
    7441                      .dwattr $C$DW$T$201, DW_AT_byte_size(0x01)
    7442              $C$DW$876       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_DcEvt"), DW_AT_const_value(0x00)
    7443              $C$DW$877       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZero"), DW_AT_const_value(
    7444              $C$DW$878       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualPeriod"), DW_AT_const_valu
    7445              $C$DW$879       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualZeroOrPeriod"), DW_AT_cons
    7446              $C$DW$880       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpAIncr"), DW_AT_const_va
    7447              $C$DW$881       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpADecr"), DW_AT_const_va
    7448              $C$DW$882       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBIncr"), DW_AT_const_va
    7449              $C$DW$883       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_SocPulseSrc_CounterEqualCmpBDecr"), DW_AT_const_va
    7450                      .dwendtag $C$DW$T$201
    7451              
    7452              $C$DW$T$202     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_SocPulseSrc_e")
    7453                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$201)
    7454                      .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    7455              $C$DW$884       .dwtag  DW_TAG_TI_far_type
    7456                      .dwattr $C$DW$884, DW_AT_type(*$C$DW$T$202)
    7457              $C$DW$T$203     .dwtag  DW_TAG_const_type
    7458                      .dwattr $C$DW$T$203, DW_AT_type(*$C$DW$884)
    7459              
    7460              $C$DW$T$204     .dwtag  DW_TAG_enumeration_type
    7461                      .dwattr $C$DW$T$204, DW_AT_byte_size(0x01)
    7462              $C$DW$885       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    7463              $C$DW$886       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    7464              $C$DW$887       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    7465              $C$DW$888       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  151

    7466              $C$DW$889       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    7467              $C$DW$890       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    7468              $C$DW$891       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    7469              $C$DW$892       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    7470              $C$DW$893       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    7471              $C$DW$894       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    7472              $C$DW$895       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    7473              $C$DW$896       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    7474                      .dwendtag $C$DW$T$204
    7475              
    7476              $C$DW$T$205     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    7477                      .dwattr $C$DW$T$205, DW_AT_type(*$C$DW$T$204)
    7478                      .dwattr $C$DW$T$205, DW_AT_language(DW_LANG_C)
    7479              
    7480              $C$DW$T$207     .dwtag  DW_TAG_enumeration_type
    7481                      .dwattr $C$DW$T$207, DW_AT_byte_size(0x01)
    7482              $C$DW$897       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    7483              $C$DW$898       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    7484              $C$DW$899       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    7485              $C$DW$900       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    7486                      .dwendtag $C$DW$T$207
    7487              
    7488              $C$DW$T$208     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    7489                      .dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$207)
    7490                      .dwattr $C$DW$T$208, DW_AT_language(DW_LANG_C)
    7491              
    7492              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7493                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    7494                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    7495              $C$DW$901       .dwtag  DW_TAG_member
    7496                      .dwattr $C$DW$901, DW_AT_type(*$C$DW$T$25)
    7497                      .dwattr $C$DW$901, DW_AT_name("ADCRESULT")
    7498                      .dwattr $C$DW$901, DW_AT_TI_symbol_name("_ADCRESULT")
    7499                      .dwattr $C$DW$901, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7500                      .dwattr $C$DW$901, DW_AT_accessibility(DW_ACCESS_public)
    7501              $C$DW$902       .dwtag  DW_TAG_member
    7502                      .dwattr $C$DW$902, DW_AT_type(*$C$DW$T$26)
    7503                      .dwattr $C$DW$902, DW_AT_name("resvd_1")
    7504                      .dwattr $C$DW$902, DW_AT_TI_symbol_name("_resvd_1")
    7505                      .dwattr $C$DW$902, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7506                      .dwattr $C$DW$902, DW_AT_accessibility(DW_ACCESS_public)
    7507              $C$DW$903       .dwtag  DW_TAG_member
    7508                      .dwattr $C$DW$903, DW_AT_type(*$C$DW$T$24)
    7509                      .dwattr $C$DW$903, DW_AT_name("ADCCTL1")
    7510                      .dwattr $C$DW$903, DW_AT_TI_symbol_name("_ADCCTL1")
    7511                      .dwattr $C$DW$903, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    7512                      .dwattr $C$DW$903, DW_AT_accessibility(DW_ACCESS_public)
    7513              $C$DW$904       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$904, DW_AT_type(*$C$DW$T$24)
    7515                      .dwattr $C$DW$904, DW_AT_name("ADCCTL2")
    7516                      .dwattr $C$DW$904, DW_AT_TI_symbol_name("_ADCCTL2")
    7517                      .dwattr $C$DW$904, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    7518                      .dwattr $C$DW$904, DW_AT_accessibility(DW_ACCESS_public)
    7519              $C$DW$905       .dwtag  DW_TAG_member
    7520                      .dwattr $C$DW$905, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  152

    7521                      .dwattr $C$DW$905, DW_AT_name("rsvd_2")
    7522                      .dwattr $C$DW$905, DW_AT_TI_symbol_name("_rsvd_2")
    7523                      .dwattr $C$DW$905, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    7524                      .dwattr $C$DW$905, DW_AT_accessibility(DW_ACCESS_public)
    7525              $C$DW$906       .dwtag  DW_TAG_member
    7526                      .dwattr $C$DW$906, DW_AT_type(*$C$DW$T$24)
    7527                      .dwattr $C$DW$906, DW_AT_name("ADCINTFLG")
    7528                      .dwattr $C$DW$906, DW_AT_TI_symbol_name("_ADCINTFLG")
    7529                      .dwattr $C$DW$906, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    7530                      .dwattr $C$DW$906, DW_AT_accessibility(DW_ACCESS_public)
    7531              $C$DW$907       .dwtag  DW_TAG_member
    7532                      .dwattr $C$DW$907, DW_AT_type(*$C$DW$T$24)
    7533                      .dwattr $C$DW$907, DW_AT_name("ADCINTFLGCLR")
    7534                      .dwattr $C$DW$907, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    7535                      .dwattr $C$DW$907, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    7536                      .dwattr $C$DW$907, DW_AT_accessibility(DW_ACCESS_public)
    7537              $C$DW$908       .dwtag  DW_TAG_member
    7538                      .dwattr $C$DW$908, DW_AT_type(*$C$DW$T$24)
    7539                      .dwattr $C$DW$908, DW_AT_name("ADCINTOVF")
    7540                      .dwattr $C$DW$908, DW_AT_TI_symbol_name("_ADCINTOVF")
    7541                      .dwattr $C$DW$908, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    7542                      .dwattr $C$DW$908, DW_AT_accessibility(DW_ACCESS_public)
    7543              $C$DW$909       .dwtag  DW_TAG_member
    7544                      .dwattr $C$DW$909, DW_AT_type(*$C$DW$T$24)
    7545                      .dwattr $C$DW$909, DW_AT_name("ADCINTOVFCLR")
    7546                      .dwattr $C$DW$909, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    7547                      .dwattr $C$DW$909, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    7548                      .dwattr $C$DW$909, DW_AT_accessibility(DW_ACCESS_public)
    7549              $C$DW$910       .dwtag  DW_TAG_member
    7550                      .dwattr $C$DW$910, DW_AT_type(*$C$DW$T$28)
    7551                      .dwattr $C$DW$910, DW_AT_name("INTSELxNy")
    7552                      .dwattr $C$DW$910, DW_AT_TI_symbol_name("_INTSELxNy")
    7553                      .dwattr $C$DW$910, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    7554                      .dwattr $C$DW$910, DW_AT_accessibility(DW_ACCESS_public)
    7555              $C$DW$911       .dwtag  DW_TAG_member
    7556                      .dwattr $C$DW$911, DW_AT_type(*$C$DW$T$29)
    7557                      .dwattr $C$DW$911, DW_AT_name("rsvd_3")
    7558                      .dwattr $C$DW$911, DW_AT_TI_symbol_name("_rsvd_3")
    7559                      .dwattr $C$DW$911, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    7560                      .dwattr $C$DW$911, DW_AT_accessibility(DW_ACCESS_public)
    7561              $C$DW$912       .dwtag  DW_TAG_member
    7562                      .dwattr $C$DW$912, DW_AT_type(*$C$DW$T$24)
    7563                      .dwattr $C$DW$912, DW_AT_name("SOCPRICTRL")
    7564                      .dwattr $C$DW$912, DW_AT_TI_symbol_name("_SOCPRICTRL")
    7565                      .dwattr $C$DW$912, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    7566                      .dwattr $C$DW$912, DW_AT_accessibility(DW_ACCESS_public)
    7567              $C$DW$913       .dwtag  DW_TAG_member
    7568                      .dwattr $C$DW$913, DW_AT_type(*$C$DW$T$24)
    7569                      .dwattr $C$DW$913, DW_AT_name("rsvd_4")
    7570                      .dwattr $C$DW$913, DW_AT_TI_symbol_name("_rsvd_4")
    7571                      .dwattr $C$DW$913, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    7572                      .dwattr $C$DW$913, DW_AT_accessibility(DW_ACCESS_public)
    7573              $C$DW$914       .dwtag  DW_TAG_member
    7574                      .dwattr $C$DW$914, DW_AT_type(*$C$DW$T$24)
    7575                      .dwattr $C$DW$914, DW_AT_name("ADCSAMPLEMODE")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  153

    7576                      .dwattr $C$DW$914, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    7577                      .dwattr $C$DW$914, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    7578                      .dwattr $C$DW$914, DW_AT_accessibility(DW_ACCESS_public)
    7579              $C$DW$915       .dwtag  DW_TAG_member
    7580                      .dwattr $C$DW$915, DW_AT_type(*$C$DW$T$24)
    7581                      .dwattr $C$DW$915, DW_AT_name("rsvd_5")
    7582                      .dwattr $C$DW$915, DW_AT_TI_symbol_name("_rsvd_5")
    7583                      .dwattr $C$DW$915, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    7584                      .dwattr $C$DW$915, DW_AT_accessibility(DW_ACCESS_public)
    7585              $C$DW$916       .dwtag  DW_TAG_member
    7586                      .dwattr $C$DW$916, DW_AT_type(*$C$DW$T$24)
    7587                      .dwattr $C$DW$916, DW_AT_name("ADCINTSOCSEL1")
    7588                      .dwattr $C$DW$916, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    7589                      .dwattr $C$DW$916, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    7590                      .dwattr $C$DW$916, DW_AT_accessibility(DW_ACCESS_public)
    7591              $C$DW$917       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$917, DW_AT_type(*$C$DW$T$24)
    7593                      .dwattr $C$DW$917, DW_AT_name("ADCINTSOCSEL2")
    7594                      .dwattr $C$DW$917, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    7595                      .dwattr $C$DW$917, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    7596                      .dwattr $C$DW$917, DW_AT_accessibility(DW_ACCESS_public)
    7597              $C$DW$918       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$918, DW_AT_type(*$C$DW$T$27)
    7599                      .dwattr $C$DW$918, DW_AT_name("rsvd_6")
    7600                      .dwattr $C$DW$918, DW_AT_TI_symbol_name("_rsvd_6")
    7601                      .dwattr $C$DW$918, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    7602                      .dwattr $C$DW$918, DW_AT_accessibility(DW_ACCESS_public)
    7603              $C$DW$919       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$919, DW_AT_type(*$C$DW$T$24)
    7605                      .dwattr $C$DW$919, DW_AT_name("ADCSOCFLG1")
    7606                      .dwattr $C$DW$919, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    7607                      .dwattr $C$DW$919, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    7608                      .dwattr $C$DW$919, DW_AT_accessibility(DW_ACCESS_public)
    7609              $C$DW$920       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$920, DW_AT_type(*$C$DW$T$24)
    7611                      .dwattr $C$DW$920, DW_AT_name("rsvd_7")
    7612                      .dwattr $C$DW$920, DW_AT_TI_symbol_name("_rsvd_7")
    7613                      .dwattr $C$DW$920, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    7614                      .dwattr $C$DW$920, DW_AT_accessibility(DW_ACCESS_public)
    7615              $C$DW$921       .dwtag  DW_TAG_member
    7616                      .dwattr $C$DW$921, DW_AT_type(*$C$DW$T$24)
    7617                      .dwattr $C$DW$921, DW_AT_name("ADCSOCFRC1")
    7618                      .dwattr $C$DW$921, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    7619                      .dwattr $C$DW$921, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    7620                      .dwattr $C$DW$921, DW_AT_accessibility(DW_ACCESS_public)
    7621              $C$DW$922       .dwtag  DW_TAG_member
    7622                      .dwattr $C$DW$922, DW_AT_type(*$C$DW$T$24)
    7623                      .dwattr $C$DW$922, DW_AT_name("rsvd_8")
    7624                      .dwattr $C$DW$922, DW_AT_TI_symbol_name("_rsvd_8")
    7625                      .dwattr $C$DW$922, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    7626                      .dwattr $C$DW$922, DW_AT_accessibility(DW_ACCESS_public)
    7627              $C$DW$923       .dwtag  DW_TAG_member
    7628                      .dwattr $C$DW$923, DW_AT_type(*$C$DW$T$24)
    7629                      .dwattr $C$DW$923, DW_AT_name("ADCSOCOVF1")
    7630                      .dwattr $C$DW$923, DW_AT_TI_symbol_name("_ADCSOCOVF1")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  154

    7631                      .dwattr $C$DW$923, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    7632                      .dwattr $C$DW$923, DW_AT_accessibility(DW_ACCESS_public)
    7633              $C$DW$924       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$924, DW_AT_type(*$C$DW$T$24)
    7635                      .dwattr $C$DW$924, DW_AT_name("rsvd_9")
    7636                      .dwattr $C$DW$924, DW_AT_TI_symbol_name("_rsvd_9")
    7637                      .dwattr $C$DW$924, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    7638                      .dwattr $C$DW$924, DW_AT_accessibility(DW_ACCESS_public)
    7639              $C$DW$925       .dwtag  DW_TAG_member
    7640                      .dwattr $C$DW$925, DW_AT_type(*$C$DW$T$24)
    7641                      .dwattr $C$DW$925, DW_AT_name("ADCSOCOVFCLR1")
    7642                      .dwattr $C$DW$925, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    7643                      .dwattr $C$DW$925, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    7644                      .dwattr $C$DW$925, DW_AT_accessibility(DW_ACCESS_public)
    7645              $C$DW$926       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$926, DW_AT_type(*$C$DW$T$24)
    7647                      .dwattr $C$DW$926, DW_AT_name("rsvd_10")
    7648                      .dwattr $C$DW$926, DW_AT_TI_symbol_name("_rsvd_10")
    7649                      .dwattr $C$DW$926, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    7650                      .dwattr $C$DW$926, DW_AT_accessibility(DW_ACCESS_public)
    7651              $C$DW$927       .dwtag  DW_TAG_member
    7652                      .dwattr $C$DW$927, DW_AT_type(*$C$DW$T$25)
    7653                      .dwattr $C$DW$927, DW_AT_name("ADCSOCxCTL")
    7654                      .dwattr $C$DW$927, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    7655                      .dwattr $C$DW$927, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    7656                      .dwattr $C$DW$927, DW_AT_accessibility(DW_ACCESS_public)
    7657              $C$DW$928       .dwtag  DW_TAG_member
    7658                      .dwattr $C$DW$928, DW_AT_type(*$C$DW$T$25)
    7659                      .dwattr $C$DW$928, DW_AT_name("rsvd_11")
    7660                      .dwattr $C$DW$928, DW_AT_TI_symbol_name("_rsvd_11")
    7661                      .dwattr $C$DW$928, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    7662                      .dwattr $C$DW$928, DW_AT_accessibility(DW_ACCESS_public)
    7663              $C$DW$929       .dwtag  DW_TAG_member
    7664                      .dwattr $C$DW$929, DW_AT_type(*$C$DW$T$24)
    7665                      .dwattr $C$DW$929, DW_AT_name("ADCREFTRIM")
    7666                      .dwattr $C$DW$929, DW_AT_TI_symbol_name("_ADCREFTRIM")
    7667                      .dwattr $C$DW$929, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    7668                      .dwattr $C$DW$929, DW_AT_accessibility(DW_ACCESS_public)
    7669              $C$DW$930       .dwtag  DW_TAG_member
    7670                      .dwattr $C$DW$930, DW_AT_type(*$C$DW$T$24)
    7671                      .dwattr $C$DW$930, DW_AT_name("ADCOFFTRIM")
    7672                      .dwattr $C$DW$930, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    7673                      .dwattr $C$DW$930, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    7674                      .dwattr $C$DW$930, DW_AT_accessibility(DW_ACCESS_public)
    7675              $C$DW$931       .dwtag  DW_TAG_member
    7676                      .dwattr $C$DW$931, DW_AT_type(*$C$DW$T$30)
    7677                      .dwattr $C$DW$931, DW_AT_name("resvd_12")
    7678                      .dwattr $C$DW$931, DW_AT_TI_symbol_name("_resvd_12")
    7679                      .dwattr $C$DW$931, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    7680                      .dwattr $C$DW$931, DW_AT_accessibility(DW_ACCESS_public)
    7681              $C$DW$932       .dwtag  DW_TAG_member
    7682                      .dwattr $C$DW$932, DW_AT_type(*$C$DW$T$24)
    7683                      .dwattr $C$DW$932, DW_AT_name("ADCREV")
    7684                      .dwattr $C$DW$932, DW_AT_TI_symbol_name("_ADCREV")
    7685                      .dwattr $C$DW$932, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  155

    7686                      .dwattr $C$DW$932, DW_AT_accessibility(DW_ACCESS_public)
    7687                      .dwendtag $C$DW$T$31
    7688              
    7689              $C$DW$T$210     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    7690                      .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$31)
    7691                      .dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
    7692              $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    7693                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$31)
    7694                      .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    7695              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    7696                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    7697                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    7698              
    7699              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7700                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    7701                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    7702              $C$DW$933       .dwtag  DW_TAG_member
    7703                      .dwattr $C$DW$933, DW_AT_type(*$C$DW$T$32)
    7704                      .dwattr $C$DW$933, DW_AT_name("alpha_sf")
    7705                      .dwattr $C$DW$933, DW_AT_TI_symbol_name("_alpha_sf")
    7706                      .dwattr $C$DW$933, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7707                      .dwattr $C$DW$933, DW_AT_accessibility(DW_ACCESS_public)
    7708              $C$DW$934       .dwtag  DW_TAG_member
    7709                      .dwattr $C$DW$934, DW_AT_type(*$C$DW$T$32)
    7710                      .dwattr $C$DW$934, DW_AT_name("beta_sf")
    7711                      .dwattr $C$DW$934, DW_AT_TI_symbol_name("_beta_sf")
    7712                      .dwattr $C$DW$934, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7713                      .dwattr $C$DW$934, DW_AT_accessibility(DW_ACCESS_public)
    7714              $C$DW$935       .dwtag  DW_TAG_member
    7715                      .dwattr $C$DW$935, DW_AT_type(*$C$DW$T$33)
    7716                      .dwattr $C$DW$935, DW_AT_name("numSensors")
    7717                      .dwattr $C$DW$935, DW_AT_TI_symbol_name("_numSensors")
    7718                      .dwattr $C$DW$935, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7719                      .dwattr $C$DW$935, DW_AT_accessibility(DW_ACCESS_public)
    7720                      .dwendtag $C$DW$T$34
    7721              
    7722              $C$DW$T$211     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    7723                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$34)
    7724                      .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    7725              $C$DW$T$212     .dwtag  DW_TAG_pointer_type
    7726                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$34)
    7727                      .dwattr $C$DW$T$212, DW_AT_address_class(0x20)
    7728              $C$DW$T$213     .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    7729                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$212)
    7730                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    7731              $C$DW$936       .dwtag  DW_TAG_TI_far_type
    7732                      .dwattr $C$DW$936, DW_AT_type(*$C$DW$T$213)
    7733              $C$DW$T$214     .dwtag  DW_TAG_const_type
    7734                      .dwattr $C$DW$T$214, DW_AT_type(*$C$DW$936)
    7735              
    7736              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7737                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    7738                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    7739              $C$DW$937       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$937, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  156

    7741                      .dwattr $C$DW$937, DW_AT_name("XCLK")
    7742                      .dwattr $C$DW$937, DW_AT_TI_symbol_name("_XCLK")
    7743                      .dwattr $C$DW$937, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7744                      .dwattr $C$DW$937, DW_AT_accessibility(DW_ACCESS_public)
    7745              $C$DW$938       .dwtag  DW_TAG_member
    7746                      .dwattr $C$DW$938, DW_AT_type(*$C$DW$T$24)
    7747                      .dwattr $C$DW$938, DW_AT_name("rsvd_1")
    7748                      .dwattr $C$DW$938, DW_AT_TI_symbol_name("_rsvd_1")
    7749                      .dwattr $C$DW$938, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7750                      .dwattr $C$DW$938, DW_AT_accessibility(DW_ACCESS_public)
    7751              $C$DW$939       .dwtag  DW_TAG_member
    7752                      .dwattr $C$DW$939, DW_AT_type(*$C$DW$T$24)
    7753                      .dwattr $C$DW$939, DW_AT_name("CLKCTL")
    7754                      .dwattr $C$DW$939, DW_AT_TI_symbol_name("_CLKCTL")
    7755                      .dwattr $C$DW$939, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7756                      .dwattr $C$DW$939, DW_AT_accessibility(DW_ACCESS_public)
    7757              $C$DW$940       .dwtag  DW_TAG_member
    7758                      .dwattr $C$DW$940, DW_AT_type(*$C$DW$T$35)
    7759                      .dwattr $C$DW$940, DW_AT_name("rsvd_2")
    7760                      .dwattr $C$DW$940, DW_AT_TI_symbol_name("_rsvd_2")
    7761                      .dwattr $C$DW$940, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7762                      .dwattr $C$DW$940, DW_AT_accessibility(DW_ACCESS_public)
    7763              $C$DW$941       .dwtag  DW_TAG_member
    7764                      .dwattr $C$DW$941, DW_AT_type(*$C$DW$T$24)
    7765                      .dwattr $C$DW$941, DW_AT_name("LOSPCP")
    7766                      .dwattr $C$DW$941, DW_AT_TI_symbol_name("_LOSPCP")
    7767                      .dwattr $C$DW$941, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7768                      .dwattr $C$DW$941, DW_AT_accessibility(DW_ACCESS_public)
    7769              $C$DW$942       .dwtag  DW_TAG_member
    7770                      .dwattr $C$DW$942, DW_AT_type(*$C$DW$T$24)
    7771                      .dwattr $C$DW$942, DW_AT_name("PCLKCR0")
    7772                      .dwattr $C$DW$942, DW_AT_TI_symbol_name("_PCLKCR0")
    7773                      .dwattr $C$DW$942, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7774                      .dwattr $C$DW$942, DW_AT_accessibility(DW_ACCESS_public)
    7775              $C$DW$943       .dwtag  DW_TAG_member
    7776                      .dwattr $C$DW$943, DW_AT_type(*$C$DW$T$24)
    7777                      .dwattr $C$DW$943, DW_AT_name("PCLKCR1")
    7778                      .dwattr $C$DW$943, DW_AT_TI_symbol_name("_PCLKCR1")
    7779                      .dwattr $C$DW$943, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7780                      .dwattr $C$DW$943, DW_AT_accessibility(DW_ACCESS_public)
    7781              $C$DW$944       .dwtag  DW_TAG_member
    7782                      .dwattr $C$DW$944, DW_AT_type(*$C$DW$T$27)
    7783                      .dwattr $C$DW$944, DW_AT_name("rsvd_3")
    7784                      .dwattr $C$DW$944, DW_AT_TI_symbol_name("_rsvd_3")
    7785                      .dwattr $C$DW$944, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7786                      .dwattr $C$DW$944, DW_AT_accessibility(DW_ACCESS_public)
    7787              $C$DW$945       .dwtag  DW_TAG_member
    7788                      .dwattr $C$DW$945, DW_AT_type(*$C$DW$T$24)
    7789                      .dwattr $C$DW$945, DW_AT_name("PCLKCR3")
    7790                      .dwattr $C$DW$945, DW_AT_TI_symbol_name("_PCLKCR3")
    7791                      .dwattr $C$DW$945, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7792                      .dwattr $C$DW$945, DW_AT_accessibility(DW_ACCESS_public)
    7793                      .dwendtag $C$DW$T$36
    7794              
    7795              $C$DW$T$89      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  157

    7796                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$36)
    7797                      .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    7798              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    7799                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    7800                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    7801              
    7802              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7803                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    7804                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    7805              $C$DW$946       .dwtag  DW_TAG_member
    7806                      .dwattr $C$DW$946, DW_AT_type(*$C$DW$T$33)
    7807                      .dwattr $C$DW$946, DW_AT_name("tmp")
    7808                      .dwattr $C$DW$946, DW_AT_TI_symbol_name("_tmp")
    7809                      .dwattr $C$DW$946, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7810                      .dwattr $C$DW$946, DW_AT_accessibility(DW_ACCESS_public)
    7811                      .dwendtag $C$DW$T$37
    7812              
    7813              $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    7814                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$37)
    7815                      .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    7816              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    7817                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    7818                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7819              
    7820              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7821                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_USAGE_Obj_")
    7822                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    7823              $C$DW$947       .dwtag  DW_TAG_member
    7824                      .dwattr $C$DW$947, DW_AT_type(*$C$DW$T$38)
    7825                      .dwattr $C$DW$947, DW_AT_name("timerPeriod_cnts")
    7826                      .dwattr $C$DW$947, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    7827                      .dwattr $C$DW$947, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7828                      .dwattr $C$DW$947, DW_AT_accessibility(DW_ACCESS_public)
    7829              $C$DW$948       .dwtag  DW_TAG_member
    7830                      .dwattr $C$DW$948, DW_AT_type(*$C$DW$T$38)
    7831                      .dwattr $C$DW$948, DW_AT_name("cnt_z0")
    7832                      .dwattr $C$DW$948, DW_AT_TI_symbol_name("_cnt_z0")
    7833                      .dwattr $C$DW$948, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7834                      .dwattr $C$DW$948, DW_AT_accessibility(DW_ACCESS_public)
    7835              $C$DW$949       .dwtag  DW_TAG_member
    7836                      .dwattr $C$DW$949, DW_AT_type(*$C$DW$T$38)
    7837                      .dwattr $C$DW$949, DW_AT_name("cnt_z1")
    7838                      .dwattr $C$DW$949, DW_AT_TI_symbol_name("_cnt_z1")
    7839                      .dwattr $C$DW$949, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7840                      .dwattr $C$DW$949, DW_AT_accessibility(DW_ACCESS_public)
    7841              $C$DW$950       .dwtag  DW_TAG_member
    7842                      .dwattr $C$DW$950, DW_AT_type(*$C$DW$T$38)
    7843                      .dwattr $C$DW$950, DW_AT_name("deltaCnt")
    7844                      .dwattr $C$DW$950, DW_AT_TI_symbol_name("_deltaCnt")
    7845                      .dwattr $C$DW$950, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7846                      .dwattr $C$DW$950, DW_AT_accessibility(DW_ACCESS_public)
    7847              $C$DW$951       .dwtag  DW_TAG_member
    7848                      .dwattr $C$DW$951, DW_AT_type(*$C$DW$T$38)
    7849                      .dwattr $C$DW$951, DW_AT_name("deltaCntAcc")
    7850                      .dwattr $C$DW$951, DW_AT_TI_symbol_name("_deltaCntAcc")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  158

    7851                      .dwattr $C$DW$951, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7852                      .dwattr $C$DW$951, DW_AT_accessibility(DW_ACCESS_public)
    7853              $C$DW$952       .dwtag  DW_TAG_member
    7854                      .dwattr $C$DW$952, DW_AT_type(*$C$DW$T$38)
    7855                      .dwattr $C$DW$952, DW_AT_name("deltaCntAccNum")
    7856                      .dwattr $C$DW$952, DW_AT_TI_symbol_name("_deltaCntAccNum")
    7857                      .dwattr $C$DW$952, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7858                      .dwattr $C$DW$952, DW_AT_accessibility(DW_ACCESS_public)
    7859              $C$DW$953       .dwtag  DW_TAG_member
    7860                      .dwattr $C$DW$953, DW_AT_type(*$C$DW$T$38)
    7861                      .dwattr $C$DW$953, DW_AT_name("deltaCntAccNumMax")
    7862                      .dwattr $C$DW$953, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    7863                      .dwattr $C$DW$953, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7864                      .dwattr $C$DW$953, DW_AT_accessibility(DW_ACCESS_public)
    7865              $C$DW$954       .dwtag  DW_TAG_member
    7866                      .dwattr $C$DW$954, DW_AT_type(*$C$DW$T$38)
    7867                      .dwattr $C$DW$954, DW_AT_name("minDeltaCntObserved")
    7868                      .dwattr $C$DW$954, DW_AT_TI_symbol_name("_minDeltaCntObserved")
    7869                      .dwattr $C$DW$954, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7870                      .dwattr $C$DW$954, DW_AT_accessibility(DW_ACCESS_public)
    7871              $C$DW$955       .dwtag  DW_TAG_member
    7872                      .dwattr $C$DW$955, DW_AT_type(*$C$DW$T$38)
    7873                      .dwattr $C$DW$955, DW_AT_name("avgDeltaCntObserved")
    7874                      .dwattr $C$DW$955, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    7875                      .dwattr $C$DW$955, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7876                      .dwattr $C$DW$955, DW_AT_accessibility(DW_ACCESS_public)
    7877              $C$DW$956       .dwtag  DW_TAG_member
    7878                      .dwattr $C$DW$956, DW_AT_type(*$C$DW$T$38)
    7879                      .dwattr $C$DW$956, DW_AT_name("maxDeltaCntObserved")
    7880                      .dwattr $C$DW$956, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    7881                      .dwattr $C$DW$956, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7882                      .dwattr $C$DW$956, DW_AT_accessibility(DW_ACCESS_public)
    7883              $C$DW$957       .dwtag  DW_TAG_member
    7884                      .dwattr $C$DW$957, DW_AT_type(*$C$DW$T$39)
    7885                      .dwattr $C$DW$957, DW_AT_name("flag_resetStats")
    7886                      .dwattr $C$DW$957, DW_AT_TI_symbol_name("_flag_resetStats")
    7887                      .dwattr $C$DW$957, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7888                      .dwattr $C$DW$957, DW_AT_accessibility(DW_ACCESS_public)
    7889                      .dwendtag $C$DW$T$40
    7890              
    7891              $C$DW$T$221     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    7892                      .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$40)
    7893                      .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    7894              $C$DW$T$222     .dwtag  DW_TAG_pointer_type
    7895                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$40)
    7896                      .dwattr $C$DW$T$222, DW_AT_address_class(0x20)
    7897              $C$DW$T$223     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    7898                      .dwattr $C$DW$T$223, DW_AT_type(*$C$DW$T$222)
    7899                      .dwattr $C$DW$T$223, DW_AT_language(DW_LANG_C)
    7900              
    7901              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7902                      .dwattr $C$DW$T$43, DW_AT_name("_CTRL_Version_")
    7903                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    7904              $C$DW$958       .dwtag  DW_TAG_member
    7905                      .dwattr $C$DW$958, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  159

    7906                      .dwattr $C$DW$958, DW_AT_name("rsvd")
    7907                      .dwattr $C$DW$958, DW_AT_TI_symbol_name("_rsvd")
    7908                      .dwattr $C$DW$958, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7909                      .dwattr $C$DW$958, DW_AT_accessibility(DW_ACCESS_public)
    7910              $C$DW$959       .dwtag  DW_TAG_member
    7911                      .dwattr $C$DW$959, DW_AT_type(*$C$DW$T$42)
    7912                      .dwattr $C$DW$959, DW_AT_name("targetProc")
    7913                      .dwattr $C$DW$959, DW_AT_TI_symbol_name("_targetProc")
    7914                      .dwattr $C$DW$959, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7915                      .dwattr $C$DW$959, DW_AT_accessibility(DW_ACCESS_public)
    7916              $C$DW$960       .dwtag  DW_TAG_member
    7917                      .dwattr $C$DW$960, DW_AT_type(*$C$DW$T$23)
    7918                      .dwattr $C$DW$960, DW_AT_name("major")
    7919                      .dwattr $C$DW$960, DW_AT_TI_symbol_name("_major")
    7920                      .dwattr $C$DW$960, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7921                      .dwattr $C$DW$960, DW_AT_accessibility(DW_ACCESS_public)
    7922              $C$DW$961       .dwtag  DW_TAG_member
    7923                      .dwattr $C$DW$961, DW_AT_type(*$C$DW$T$23)
    7924                      .dwattr $C$DW$961, DW_AT_name("minor")
    7925                      .dwattr $C$DW$961, DW_AT_TI_symbol_name("_minor")
    7926                      .dwattr $C$DW$961, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7927                      .dwattr $C$DW$961, DW_AT_accessibility(DW_ACCESS_public)
    7928                      .dwendtag $C$DW$T$43
    7929              
    7930              $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7931                      .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$43)
    7932                      .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    7933              
    7934              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7935                      .dwattr $C$DW$T$50, DW_AT_name("_DRV8301_Obj_")
    7936                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    7937              $C$DW$962       .dwtag  DW_TAG_member
    7938                      .dwattr $C$DW$962, DW_AT_type(*$C$DW$T$45)
    7939                      .dwattr $C$DW$962, DW_AT_name("spiHandle")
    7940                      .dwattr $C$DW$962, DW_AT_TI_symbol_name("_spiHandle")
    7941                      .dwattr $C$DW$962, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7942                      .dwattr $C$DW$962, DW_AT_accessibility(DW_ACCESS_public)
    7943              $C$DW$963       .dwtag  DW_TAG_member
    7944                      .dwattr $C$DW$963, DW_AT_type(*$C$DW$T$47)
    7945                      .dwattr $C$DW$963, DW_AT_name("gpioHandle")
    7946                      .dwattr $C$DW$963, DW_AT_TI_symbol_name("_gpioHandle")
    7947                      .dwattr $C$DW$963, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7948                      .dwattr $C$DW$963, DW_AT_accessibility(DW_ACCESS_public)
    7949              $C$DW$964       .dwtag  DW_TAG_member
    7950                      .dwattr $C$DW$964, DW_AT_type(*$C$DW$T$49)
    7951                      .dwattr $C$DW$964, DW_AT_name("gpioNumber")
    7952                      .dwattr $C$DW$964, DW_AT_TI_symbol_name("_gpioNumber")
    7953                      .dwattr $C$DW$964, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7954                      .dwattr $C$DW$964, DW_AT_accessibility(DW_ACCESS_public)
    7955              $C$DW$965       .dwtag  DW_TAG_member
    7956                      .dwattr $C$DW$965, DW_AT_type(*$C$DW$T$39)
    7957                      .dwattr $C$DW$965, DW_AT_name("RxTimeOut")
    7958                      .dwattr $C$DW$965, DW_AT_TI_symbol_name("_RxTimeOut")
    7959                      .dwattr $C$DW$965, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7960                      .dwattr $C$DW$965, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  160

    7961              $C$DW$966       .dwtag  DW_TAG_member
    7962                      .dwattr $C$DW$966, DW_AT_type(*$C$DW$T$39)
    7963                      .dwattr $C$DW$966, DW_AT_name("enableTimeOut")
    7964                      .dwattr $C$DW$966, DW_AT_TI_symbol_name("_enableTimeOut")
    7965                      .dwattr $C$DW$966, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7966                      .dwattr $C$DW$966, DW_AT_accessibility(DW_ACCESS_public)
    7967                      .dwendtag $C$DW$T$50
    7968              
    7969              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    7970                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$50)
    7971                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    7972              $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    7973                      .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$50)
    7974                      .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    7975              $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    7976                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    7977                      .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    7978              
    7979              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7980                      .dwattr $C$DW$T$61, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    7981                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x05)
    7982              $C$DW$967       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$967, DW_AT_type(*$C$DW$T$52)
    7984                      .dwattr $C$DW$967, DW_AT_name("DRV8301_CURRENT")
    7985                      .dwattr $C$DW$967, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    7986                      .dwattr $C$DW$967, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7987                      .dwattr $C$DW$967, DW_AT_accessibility(DW_ACCESS_public)
    7988              $C$DW$968       .dwtag  DW_TAG_member
    7989                      .dwattr $C$DW$968, DW_AT_type(*$C$DW$T$54)
    7990                      .dwattr $C$DW$968, DW_AT_name("DRV8301_RESET")
    7991                      .dwattr $C$DW$968, DW_AT_TI_symbol_name("_DRV8301_RESET")
    7992                      .dwattr $C$DW$968, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7993                      .dwattr $C$DW$968, DW_AT_accessibility(DW_ACCESS_public)
    7994              $C$DW$969       .dwtag  DW_TAG_member
    7995                      .dwattr $C$DW$969, DW_AT_type(*$C$DW$T$56)
    7996                      .dwattr $C$DW$969, DW_AT_name("PWM_MODE")
    7997                      .dwattr $C$DW$969, DW_AT_TI_symbol_name("_PWM_MODE")
    7998                      .dwattr $C$DW$969, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7999                      .dwattr $C$DW$969, DW_AT_accessibility(DW_ACCESS_public)
    8000              $C$DW$970       .dwtag  DW_TAG_member
    8001                      .dwattr $C$DW$970, DW_AT_type(*$C$DW$T$58)
    8002                      .dwattr $C$DW$970, DW_AT_name("OC_MODE")
    8003                      .dwattr $C$DW$970, DW_AT_TI_symbol_name("_OC_MODE")
    8004                      .dwattr $C$DW$970, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8005                      .dwattr $C$DW$970, DW_AT_accessibility(DW_ACCESS_public)
    8006              $C$DW$971       .dwtag  DW_TAG_member
    8007                      .dwattr $C$DW$971, DW_AT_type(*$C$DW$T$60)
    8008                      .dwattr $C$DW$971, DW_AT_name("OC_ADJ_SET")
    8009                      .dwattr $C$DW$971, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    8010                      .dwattr $C$DW$971, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8011                      .dwattr $C$DW$971, DW_AT_accessibility(DW_ACCESS_public)
    8012                      .dwendtag $C$DW$T$61
    8013              
    8014              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    8015                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  161

    8016                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    8017              
    8018              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8019                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    8020                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
    8021              $C$DW$972       .dwtag  DW_TAG_member
    8022                      .dwattr $C$DW$972, DW_AT_type(*$C$DW$T$63)
    8023                      .dwattr $C$DW$972, DW_AT_name("OCTW_SET")
    8024                      .dwattr $C$DW$972, DW_AT_TI_symbol_name("_OCTW_SET")
    8025                      .dwattr $C$DW$972, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8026                      .dwattr $C$DW$972, DW_AT_accessibility(DW_ACCESS_public)
    8027              $C$DW$973       .dwtag  DW_TAG_member
    8028                      .dwattr $C$DW$973, DW_AT_type(*$C$DW$T$65)
    8029                      .dwattr $C$DW$973, DW_AT_name("GAIN")
    8030                      .dwattr $C$DW$973, DW_AT_TI_symbol_name("_GAIN")
    8031                      .dwattr $C$DW$973, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8032                      .dwattr $C$DW$973, DW_AT_accessibility(DW_ACCESS_public)
    8033              $C$DW$974       .dwtag  DW_TAG_member
    8034                      .dwattr $C$DW$974, DW_AT_type(*$C$DW$T$67)
    8035                      .dwattr $C$DW$974, DW_AT_name("DC_CAL_CH1p2")
    8036                      .dwattr $C$DW$974, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    8037                      .dwattr $C$DW$974, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8038                      .dwattr $C$DW$974, DW_AT_accessibility(DW_ACCESS_public)
    8039              $C$DW$975       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$975, DW_AT_type(*$C$DW$T$69)
    8041                      .dwattr $C$DW$975, DW_AT_name("OC_TOFF")
    8042                      .dwattr $C$DW$975, DW_AT_TI_symbol_name("_OC_TOFF")
    8043                      .dwattr $C$DW$975, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8044                      .dwattr $C$DW$975, DW_AT_accessibility(DW_ACCESS_public)
    8045                      .dwendtag $C$DW$T$70
    8046              
    8047              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    8048                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$70)
    8049                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    8050              
    8051              $C$DW$T$71      .dwtag  DW_TAG_structure_type
    8052                      .dwattr $C$DW$T$71, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    8053                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x0b)
    8054              $C$DW$976       .dwtag  DW_TAG_member
    8055                      .dwattr $C$DW$976, DW_AT_type(*$C$DW$T$39)
    8056                      .dwattr $C$DW$976, DW_AT_name("FAULT")
    8057                      .dwattr $C$DW$976, DW_AT_TI_symbol_name("_FAULT")
    8058                      .dwattr $C$DW$976, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8059                      .dwattr $C$DW$976, DW_AT_accessibility(DW_ACCESS_public)
    8060              $C$DW$977       .dwtag  DW_TAG_member
    8061                      .dwattr $C$DW$977, DW_AT_type(*$C$DW$T$39)
    8062                      .dwattr $C$DW$977, DW_AT_name("GVDD_UV")
    8063                      .dwattr $C$DW$977, DW_AT_TI_symbol_name("_GVDD_UV")
    8064                      .dwattr $C$DW$977, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8065                      .dwattr $C$DW$977, DW_AT_accessibility(DW_ACCESS_public)
    8066              $C$DW$978       .dwtag  DW_TAG_member
    8067                      .dwattr $C$DW$978, DW_AT_type(*$C$DW$T$39)
    8068                      .dwattr $C$DW$978, DW_AT_name("PVDD_UV")
    8069                      .dwattr $C$DW$978, DW_AT_TI_symbol_name("_PVDD_UV")
    8070                      .dwattr $C$DW$978, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  162

    8071                      .dwattr $C$DW$978, DW_AT_accessibility(DW_ACCESS_public)
    8072              $C$DW$979       .dwtag  DW_TAG_member
    8073                      .dwattr $C$DW$979, DW_AT_type(*$C$DW$T$39)
    8074                      .dwattr $C$DW$979, DW_AT_name("OTSD")
    8075                      .dwattr $C$DW$979, DW_AT_TI_symbol_name("_OTSD")
    8076                      .dwattr $C$DW$979, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8077                      .dwattr $C$DW$979, DW_AT_accessibility(DW_ACCESS_public)
    8078              $C$DW$980       .dwtag  DW_TAG_member
    8079                      .dwattr $C$DW$980, DW_AT_type(*$C$DW$T$39)
    8080                      .dwattr $C$DW$980, DW_AT_name("OTW")
    8081                      .dwattr $C$DW$980, DW_AT_TI_symbol_name("_OTW")
    8082                      .dwattr $C$DW$980, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8083                      .dwattr $C$DW$980, DW_AT_accessibility(DW_ACCESS_public)
    8084              $C$DW$981       .dwtag  DW_TAG_member
    8085                      .dwattr $C$DW$981, DW_AT_type(*$C$DW$T$39)
    8086                      .dwattr $C$DW$981, DW_AT_name("FETHA_OC")
    8087                      .dwattr $C$DW$981, DW_AT_TI_symbol_name("_FETHA_OC")
    8088                      .dwattr $C$DW$981, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8089                      .dwattr $C$DW$981, DW_AT_accessibility(DW_ACCESS_public)
    8090              $C$DW$982       .dwtag  DW_TAG_member
    8091                      .dwattr $C$DW$982, DW_AT_type(*$C$DW$T$39)
    8092                      .dwattr $C$DW$982, DW_AT_name("FETLA_OC")
    8093                      .dwattr $C$DW$982, DW_AT_TI_symbol_name("_FETLA_OC")
    8094                      .dwattr $C$DW$982, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8095                      .dwattr $C$DW$982, DW_AT_accessibility(DW_ACCESS_public)
    8096              $C$DW$983       .dwtag  DW_TAG_member
    8097                      .dwattr $C$DW$983, DW_AT_type(*$C$DW$T$39)
    8098                      .dwattr $C$DW$983, DW_AT_name("FETHB_OC")
    8099                      .dwattr $C$DW$983, DW_AT_TI_symbol_name("_FETHB_OC")
    8100                      .dwattr $C$DW$983, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8101                      .dwattr $C$DW$983, DW_AT_accessibility(DW_ACCESS_public)
    8102              $C$DW$984       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$984, DW_AT_type(*$C$DW$T$39)
    8104                      .dwattr $C$DW$984, DW_AT_name("FETLB_OC")
    8105                      .dwattr $C$DW$984, DW_AT_TI_symbol_name("_FETLB_OC")
    8106                      .dwattr $C$DW$984, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8107                      .dwattr $C$DW$984, DW_AT_accessibility(DW_ACCESS_public)
    8108              $C$DW$985       .dwtag  DW_TAG_member
    8109                      .dwattr $C$DW$985, DW_AT_type(*$C$DW$T$39)
    8110                      .dwattr $C$DW$985, DW_AT_name("FETHC_OC")
    8111                      .dwattr $C$DW$985, DW_AT_TI_symbol_name("_FETHC_OC")
    8112                      .dwattr $C$DW$985, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8113                      .dwattr $C$DW$985, DW_AT_accessibility(DW_ACCESS_public)
    8114              $C$DW$986       .dwtag  DW_TAG_member
    8115                      .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$39)
    8116                      .dwattr $C$DW$986, DW_AT_name("FETLC_OC")
    8117                      .dwattr $C$DW$986, DW_AT_TI_symbol_name("_FETLC_OC")
    8118                      .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8119                      .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
    8120                      .dwendtag $C$DW$T$71
    8121              
    8122              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat1_t_")
    8123                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$71)
    8124                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    8125              
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  163

    8126              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    8127                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8301_Stat2_t_")
    8128                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x02)
    8129              $C$DW$987       .dwtag  DW_TAG_member
    8130                      .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$39)
    8131                      .dwattr $C$DW$987, DW_AT_name("GVDD_OV")
    8132                      .dwattr $C$DW$987, DW_AT_TI_symbol_name("_GVDD_OV")
    8133                      .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8134                      .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
    8135              $C$DW$988       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$23)
    8137                      .dwattr $C$DW$988, DW_AT_name("DeviceID")
    8138                      .dwattr $C$DW$988, DW_AT_TI_symbol_name("_DeviceID")
    8139                      .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8140                      .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
    8141                      .dwendtag $C$DW$T$72
    8142              
    8143              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Stat2_t_")
    8144                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$72)
    8145                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    8146              
    8147              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    8148                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8301_Vars_t_")
    8149                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x18)
    8150              $C$DW$989       .dwtag  DW_TAG_member
    8151                      .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$73)
    8152                      .dwattr $C$DW$989, DW_AT_name("Stat_Reg_1")
    8153                      .dwattr $C$DW$989, DW_AT_TI_symbol_name("_Stat_Reg_1")
    8154                      .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8155                      .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
    8156              $C$DW$990       .dwtag  DW_TAG_member
    8157                      .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$74)
    8158                      .dwattr $C$DW$990, DW_AT_name("Stat_Reg_2")
    8159                      .dwattr $C$DW$990, DW_AT_TI_symbol_name("_Stat_Reg_2")
    8160                      .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    8161                      .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
    8162              $C$DW$991       .dwtag  DW_TAG_member
    8163                      .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$75)
    8164                      .dwattr $C$DW$991, DW_AT_name("Ctrl_Reg_1")
    8165                      .dwattr $C$DW$991, DW_AT_TI_symbol_name("_Ctrl_Reg_1")
    8166                      .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8167                      .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
    8168              $C$DW$992       .dwtag  DW_TAG_member
    8169                      .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$76)
    8170                      .dwattr $C$DW$992, DW_AT_name("Ctrl_Reg_2")
    8171                      .dwattr $C$DW$992, DW_AT_TI_symbol_name("_Ctrl_Reg_2")
    8172                      .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8173                      .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
    8174              $C$DW$993       .dwtag  DW_TAG_member
    8175                      .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$39)
    8176                      .dwattr $C$DW$993, DW_AT_name("SndCmd")
    8177                      .dwattr $C$DW$993, DW_AT_TI_symbol_name("_SndCmd")
    8178                      .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8179                      .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
    8180              $C$DW$994       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  164

    8181                      .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$39)
    8182                      .dwattr $C$DW$994, DW_AT_name("RcvCmd")
    8183                      .dwattr $C$DW$994, DW_AT_TI_symbol_name("_RcvCmd")
    8184                      .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    8185                      .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
    8186                      .dwendtag $C$DW$T$77
    8187              
    8188              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_Vars_t")
    8189                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$77)
    8190                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    8191              $C$DW$T$228     .dwtag  DW_TAG_pointer_type
    8192                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
    8193                      .dwattr $C$DW$T$228, DW_AT_address_class(0x20)
    8194              
    8195              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    8196                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    8197                      .dwattr $C$DW$T$19, DW_AT_declaration
    8198                      .dwendtag $C$DW$T$19
    8199              
    8200              $C$DW$T$178     .dwtag  DW_TAG_pointer_type
    8201                      .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$19)
    8202                      .dwattr $C$DW$T$178, DW_AT_address_class(0x20)
    8203              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    8204                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    8205                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    8206              $C$DW$995       .dwtag  DW_TAG_TI_far_type
    8207                      .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$179)
    8208              $C$DW$T$230     .dwtag  DW_TAG_const_type
    8209                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$995)
    8210              
    8211              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    8212                      .dwattr $C$DW$T$78, DW_AT_name("_FILTER_FO_")
    8213                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0a)
    8214              $C$DW$996       .dwtag  DW_TAG_member
    8215                      .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$32)
    8216                      .dwattr $C$DW$996, DW_AT_name("a1")
    8217                      .dwattr $C$DW$996, DW_AT_TI_symbol_name("_a1")
    8218                      .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8219                      .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
    8220              $C$DW$997       .dwtag  DW_TAG_member
    8221                      .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$32)
    8222                      .dwattr $C$DW$997, DW_AT_name("b0")
    8223                      .dwattr $C$DW$997, DW_AT_TI_symbol_name("_b0")
    8224                      .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8225                      .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
    8226              $C$DW$998       .dwtag  DW_TAG_member
    8227                      .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$32)
    8228                      .dwattr $C$DW$998, DW_AT_name("b1")
    8229                      .dwattr $C$DW$998, DW_AT_TI_symbol_name("_b1")
    8230                      .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8231                      .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
    8232              $C$DW$999       .dwtag  DW_TAG_member
    8233                      .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$32)
    8234                      .dwattr $C$DW$999, DW_AT_name("x1")
    8235                      .dwattr $C$DW$999, DW_AT_TI_symbol_name("_x1")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  165

    8236                      .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8237                      .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
    8238              $C$DW$1000      .dwtag  DW_TAG_member
    8239                      .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$32)
    8240                      .dwattr $C$DW$1000, DW_AT_name("y1")
    8241                      .dwattr $C$DW$1000, DW_AT_TI_symbol_name("_y1")
    8242                      .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8243                      .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
    8244                      .dwendtag $C$DW$T$78
    8245              
    8246              $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    8247                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$78)
    8248                      .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    8249              
    8250              $C$DW$T$235     .dwtag  DW_TAG_array_type
    8251                      .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$139)
    8252                      .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    8253                      .dwattr $C$DW$T$235, DW_AT_byte_size(0x3c)
    8254              $C$DW$1001      .dwtag  DW_TAG_subrange_type
    8255                      .dwattr $C$DW$1001, DW_AT_upper_bound(0x05)
    8256                      .dwendtag $C$DW$T$235
    8257              
    8258              $C$DW$T$236     .dwtag  DW_TAG_pointer_type
    8259                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$139)
    8260                      .dwattr $C$DW$T$236, DW_AT_address_class(0x20)
    8261              
    8262              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    8263                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    8264                      .dwattr $C$DW$T$20, DW_AT_declaration
    8265                      .dwendtag $C$DW$T$20
    8266              
    8267              $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    8268                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$20)
    8269                      .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    8270              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    8271                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    8272                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    8273              
    8274              $C$DW$T$240     .dwtag  DW_TAG_array_type
    8275                      .dwattr $C$DW$T$240, DW_AT_type(*$C$DW$T$141)
    8276                      .dwattr $C$DW$T$240, DW_AT_language(DW_LANG_C)
    8277                      .dwattr $C$DW$T$240, DW_AT_byte_size(0x0c)
    8278              $C$DW$1002      .dwtag  DW_TAG_subrange_type
    8279                      .dwattr $C$DW$1002, DW_AT_upper_bound(0x05)
    8280                      .dwendtag $C$DW$T$240
    8281              
    8282              
    8283              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    8284                      .dwattr $C$DW$T$79, DW_AT_name("_FLASH_Obj_")
    8285                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x08)
    8286              $C$DW$1003      .dwtag  DW_TAG_member
    8287                      .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$24)
    8288                      .dwattr $C$DW$1003, DW_AT_name("FOPT")
    8289                      .dwattr $C$DW$1003, DW_AT_TI_symbol_name("_FOPT")
    8290                      .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  166

    8291                      .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
    8292              $C$DW$1004      .dwtag  DW_TAG_member
    8293                      .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$24)
    8294                      .dwattr $C$DW$1004, DW_AT_name("rsvd_1")
    8295                      .dwattr $C$DW$1004, DW_AT_TI_symbol_name("_rsvd_1")
    8296                      .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8297                      .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
    8298              $C$DW$1005      .dwtag  DW_TAG_member
    8299                      .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$24)
    8300                      .dwattr $C$DW$1005, DW_AT_name("FPWR")
    8301                      .dwattr $C$DW$1005, DW_AT_TI_symbol_name("_FPWR")
    8302                      .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8303                      .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
    8304              $C$DW$1006      .dwtag  DW_TAG_member
    8305                      .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$24)
    8306                      .dwattr $C$DW$1006, DW_AT_name("FSTATUS")
    8307                      .dwattr $C$DW$1006, DW_AT_TI_symbol_name("_FSTATUS")
    8308                      .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8309                      .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
    8310              $C$DW$1007      .dwtag  DW_TAG_member
    8311                      .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$24)
    8312                      .dwattr $C$DW$1007, DW_AT_name("FSTDBYWAIT")
    8313                      .dwattr $C$DW$1007, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    8314                      .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8315                      .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
    8316              $C$DW$1008      .dwtag  DW_TAG_member
    8317                      .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$24)
    8318                      .dwattr $C$DW$1008, DW_AT_name("FACTIVEWAIT")
    8319                      .dwattr $C$DW$1008, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    8320                      .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8321                      .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
    8322              $C$DW$1009      .dwtag  DW_TAG_member
    8323                      .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$24)
    8324                      .dwattr $C$DW$1009, DW_AT_name("FBANKWAIT")
    8325                      .dwattr $C$DW$1009, DW_AT_TI_symbol_name("_FBANKWAIT")
    8326                      .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8327                      .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
    8328              $C$DW$1010      .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$24)
    8330                      .dwattr $C$DW$1010, DW_AT_name("FOTPWAIT")
    8331                      .dwattr $C$DW$1010, DW_AT_TI_symbol_name("_FOTPWAIT")
    8332                      .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8333                      .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
    8334                      .dwendtag $C$DW$T$79
    8335              
    8336              $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    8337                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$79)
    8338                      .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    8339              $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    8340                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    8341                      .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    8342              
    8343              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    8344                      .dwattr $C$DW$T$80, DW_AT_name("_FW_Obj_")
    8345                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x14)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  167

    8346              $C$DW$1011      .dwtag  DW_TAG_member
    8347                      .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$38)
    8348                      .dwattr $C$DW$1011, DW_AT_name("numIsrTicksPerFwTick")
    8349                      .dwattr $C$DW$1011, DW_AT_TI_symbol_name("_numIsrTicksPerFwTick")
    8350                      .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8351                      .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
    8352              $C$DW$1012      .dwtag  DW_TAG_member
    8353                      .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$38)
    8354                      .dwattr $C$DW$1012, DW_AT_name("counter_fw")
    8355                      .dwattr $C$DW$1012, DW_AT_TI_symbol_name("_counter_fw")
    8356                      .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8357                      .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
    8358              $C$DW$1013      .dwtag  DW_TAG_member
    8359                      .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$32)
    8360                      .dwattr $C$DW$1013, DW_AT_name("delta_inc")
    8361                      .dwattr $C$DW$1013, DW_AT_TI_symbol_name("_delta_inc")
    8362                      .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8363                      .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
    8364              $C$DW$1014      .dwtag  DW_TAG_member
    8365                      .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$32)
    8366                      .dwattr $C$DW$1014, DW_AT_name("delta_dec")
    8367                      .dwattr $C$DW$1014, DW_AT_TI_symbol_name("_delta_dec")
    8368                      .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8369                      .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
    8370              $C$DW$1015      .dwtag  DW_TAG_member
    8371                      .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$32)
    8372                      .dwattr $C$DW$1015, DW_AT_name("refValue")
    8373                      .dwattr $C$DW$1015, DW_AT_TI_symbol_name("_refValue")
    8374                      .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8375                      .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
    8376              $C$DW$1016      .dwtag  DW_TAG_member
    8377                      .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$32)
    8378                      .dwattr $C$DW$1016, DW_AT_name("fbackValue")
    8379                      .dwattr $C$DW$1016, DW_AT_TI_symbol_name("_fbackValue")
    8380                      .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8381                      .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
    8382              $C$DW$1017      .dwtag  DW_TAG_member
    8383                      .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$32)
    8384                      .dwattr $C$DW$1017, DW_AT_name("output")
    8385                      .dwattr $C$DW$1017, DW_AT_TI_symbol_name("_output")
    8386                      .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8387                      .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
    8388              $C$DW$1018      .dwtag  DW_TAG_member
    8389                      .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$32)
    8390                      .dwattr $C$DW$1018, DW_AT_name("outMin")
    8391                      .dwattr $C$DW$1018, DW_AT_TI_symbol_name("_outMin")
    8392                      .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8393                      .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
    8394              $C$DW$1019      .dwtag  DW_TAG_member
    8395                      .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$32)
    8396                      .dwattr $C$DW$1019, DW_AT_name("outMax")
    8397                      .dwattr $C$DW$1019, DW_AT_TI_symbol_name("_outMax")
    8398                      .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8399                      .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
    8400              $C$DW$1020      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  168

    8401                      .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$39)
    8402                      .dwattr $C$DW$1020, DW_AT_name("flag_enableFw")
    8403                      .dwattr $C$DW$1020, DW_AT_TI_symbol_name("_flag_enableFw")
    8404                      .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8405                      .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
    8406                      .dwendtag $C$DW$T$80
    8407              
    8408              $C$DW$T$245     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Obj")
    8409                      .dwattr $C$DW$T$245, DW_AT_type(*$C$DW$T$80)
    8410                      .dwattr $C$DW$T$245, DW_AT_language(DW_LANG_C)
    8411              $C$DW$T$246     .dwtag  DW_TAG_pointer_type
    8412                      .dwattr $C$DW$T$246, DW_AT_type(*$C$DW$T$245)
    8413                      .dwattr $C$DW$T$246, DW_AT_address_class(0x20)
    8414              $C$DW$T$247     .dwtag  DW_TAG_pointer_type
    8415                      .dwattr $C$DW$T$247, DW_AT_type(*$C$DW$T$80)
    8416                      .dwattr $C$DW$T$247, DW_AT_address_class(0x20)
    8417              $C$DW$T$248     .dwtag  DW_TAG_typedef, DW_AT_name("FW_Handle")
    8418                      .dwattr $C$DW$T$248, DW_AT_type(*$C$DW$T$247)
    8419                      .dwattr $C$DW$T$248, DW_AT_language(DW_LANG_C)
    8420              
    8421              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    8422                      .dwattr $C$DW$T$84, DW_AT_name("_GPIO_Obj_")
    8423                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x6a)
    8424              $C$DW$1021      .dwtag  DW_TAG_member
    8425                      .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$81)
    8426                      .dwattr $C$DW$1021, DW_AT_name("GPACTRL")
    8427                      .dwattr $C$DW$1021, DW_AT_TI_symbol_name("_GPACTRL")
    8428                      .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8429                      .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
    8430              $C$DW$1022      .dwtag  DW_TAG_member
    8431                      .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$81)
    8432                      .dwattr $C$DW$1022, DW_AT_name("GPAQSEL1")
    8433                      .dwattr $C$DW$1022, DW_AT_TI_symbol_name("_GPAQSEL1")
    8434                      .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8435                      .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
    8436              $C$DW$1023      .dwtag  DW_TAG_member
    8437                      .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$81)
    8438                      .dwattr $C$DW$1023, DW_AT_name("GPAQSEL2")
    8439                      .dwattr $C$DW$1023, DW_AT_TI_symbol_name("_GPAQSEL2")
    8440                      .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8441                      .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
    8442              $C$DW$1024      .dwtag  DW_TAG_member
    8443                      .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$81)
    8444                      .dwattr $C$DW$1024, DW_AT_name("GPAMUX1")
    8445                      .dwattr $C$DW$1024, DW_AT_TI_symbol_name("_GPAMUX1")
    8446                      .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8447                      .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
    8448              $C$DW$1025      .dwtag  DW_TAG_member
    8449                      .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$81)
    8450                      .dwattr $C$DW$1025, DW_AT_name("GPAMUX2")
    8451                      .dwattr $C$DW$1025, DW_AT_TI_symbol_name("_GPAMUX2")
    8452                      .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8453                      .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
    8454              $C$DW$1026      .dwtag  DW_TAG_member
    8455                      .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  169

    8456                      .dwattr $C$DW$1026, DW_AT_name("GPADIR")
    8457                      .dwattr $C$DW$1026, DW_AT_TI_symbol_name("_GPADIR")
    8458                      .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8459                      .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
    8460              $C$DW$1027      .dwtag  DW_TAG_member
    8461                      .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$81)
    8462                      .dwattr $C$DW$1027, DW_AT_name("GPAPUD")
    8463                      .dwattr $C$DW$1027, DW_AT_TI_symbol_name("_GPAPUD")
    8464                      .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8465                      .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
    8466              $C$DW$1028      .dwtag  DW_TAG_member
    8467                      .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$27)
    8468                      .dwattr $C$DW$1028, DW_AT_name("rsvd_1")
    8469                      .dwattr $C$DW$1028, DW_AT_TI_symbol_name("_rsvd_1")
    8470                      .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8471                      .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
    8472              $C$DW$1029      .dwtag  DW_TAG_member
    8473                      .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$81)
    8474                      .dwattr $C$DW$1029, DW_AT_name("GPBCTRL")
    8475                      .dwattr $C$DW$1029, DW_AT_TI_symbol_name("_GPBCTRL")
    8476                      .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8477                      .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
    8478              $C$DW$1030      .dwtag  DW_TAG_member
    8479                      .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$81)
    8480                      .dwattr $C$DW$1030, DW_AT_name("GPBQSEL1")
    8481                      .dwattr $C$DW$1030, DW_AT_TI_symbol_name("_GPBQSEL1")
    8482                      .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8483                      .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
    8484              $C$DW$1031      .dwtag  DW_TAG_member
    8485                      .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$27)
    8486                      .dwattr $C$DW$1031, DW_AT_name("rsvd_2")
    8487                      .dwattr $C$DW$1031, DW_AT_TI_symbol_name("_rsvd_2")
    8488                      .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8489                      .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
    8490              $C$DW$1032      .dwtag  DW_TAG_member
    8491                      .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$81)
    8492                      .dwattr $C$DW$1032, DW_AT_name("GPBMUX1")
    8493                      .dwattr $C$DW$1032, DW_AT_TI_symbol_name("_GPBMUX1")
    8494                      .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8495                      .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
    8496              $C$DW$1033      .dwtag  DW_TAG_member
    8497                      .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$27)
    8498                      .dwattr $C$DW$1033, DW_AT_name("rsvd_3")
    8499                      .dwattr $C$DW$1033, DW_AT_TI_symbol_name("_rsvd_3")
    8500                      .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8501                      .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
    8502              $C$DW$1034      .dwtag  DW_TAG_member
    8503                      .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$81)
    8504                      .dwattr $C$DW$1034, DW_AT_name("GPBDIR")
    8505                      .dwattr $C$DW$1034, DW_AT_TI_symbol_name("_GPBDIR")
    8506                      .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8507                      .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
    8508              $C$DW$1035      .dwtag  DW_TAG_member
    8509                      .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$81)
    8510                      .dwattr $C$DW$1035, DW_AT_name("GPBPUD")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  170

    8511                      .dwattr $C$DW$1035, DW_AT_TI_symbol_name("_GPBPUD")
    8512                      .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8513                      .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
    8514              $C$DW$1036      .dwtag  DW_TAG_member
    8515                      .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$82)
    8516                      .dwattr $C$DW$1036, DW_AT_name("rsvd_4")
    8517                      .dwattr $C$DW$1036, DW_AT_TI_symbol_name("_rsvd_4")
    8518                      .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8519                      .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
    8520              $C$DW$1037      .dwtag  DW_TAG_member
    8521                      .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$81)
    8522                      .dwattr $C$DW$1037, DW_AT_name("AIOMUX1")
    8523                      .dwattr $C$DW$1037, DW_AT_TI_symbol_name("_AIOMUX1")
    8524                      .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    8525                      .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
    8526              $C$DW$1038      .dwtag  DW_TAG_member
    8527                      .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$27)
    8528                      .dwattr $C$DW$1038, DW_AT_name("rsvd_5")
    8529                      .dwattr $C$DW$1038, DW_AT_TI_symbol_name("_rsvd_5")
    8530                      .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8531                      .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
    8532              $C$DW$1039      .dwtag  DW_TAG_member
    8533                      .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$81)
    8534                      .dwattr $C$DW$1039, DW_AT_name("AIODIR")
    8535                      .dwattr $C$DW$1039, DW_AT_TI_symbol_name("_AIODIR")
    8536                      .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    8537                      .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
    8538              $C$DW$1040      .dwtag  DW_TAG_member
    8539                      .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$83)
    8540                      .dwattr $C$DW$1040, DW_AT_name("rsvd_6")
    8541                      .dwattr $C$DW$1040, DW_AT_TI_symbol_name("_rsvd_6")
    8542                      .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8543                      .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
    8544              $C$DW$1041      .dwtag  DW_TAG_member
    8545                      .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$81)
    8546                      .dwattr $C$DW$1041, DW_AT_name("GPADAT")
    8547                      .dwattr $C$DW$1041, DW_AT_TI_symbol_name("_GPADAT")
    8548                      .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8549                      .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
    8550              $C$DW$1042      .dwtag  DW_TAG_member
    8551                      .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$81)
    8552                      .dwattr $C$DW$1042, DW_AT_name("GPASET")
    8553                      .dwattr $C$DW$1042, DW_AT_TI_symbol_name("_GPASET")
    8554                      .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    8555                      .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
    8556              $C$DW$1043      .dwtag  DW_TAG_member
    8557                      .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$81)
    8558                      .dwattr $C$DW$1043, DW_AT_name("GPACLEAR")
    8559                      .dwattr $C$DW$1043, DW_AT_TI_symbol_name("_GPACLEAR")
    8560                      .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8561                      .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
    8562              $C$DW$1044      .dwtag  DW_TAG_member
    8563                      .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$81)
    8564                      .dwattr $C$DW$1044, DW_AT_name("GPATOGGLE")
    8565                      .dwattr $C$DW$1044, DW_AT_TI_symbol_name("_GPATOGGLE")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  171

    8566                      .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8567                      .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
    8568              $C$DW$1045      .dwtag  DW_TAG_member
    8569                      .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$81)
    8570                      .dwattr $C$DW$1045, DW_AT_name("GPBDAT")
    8571                      .dwattr $C$DW$1045, DW_AT_TI_symbol_name("_GPBDAT")
    8572                      .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8573                      .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
    8574              $C$DW$1046      .dwtag  DW_TAG_member
    8575                      .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$81)
    8576                      .dwattr $C$DW$1046, DW_AT_name("GPBSET")
    8577                      .dwattr $C$DW$1046, DW_AT_TI_symbol_name("_GPBSET")
    8578                      .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    8579                      .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
    8580              $C$DW$1047      .dwtag  DW_TAG_member
    8581                      .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$81)
    8582                      .dwattr $C$DW$1047, DW_AT_name("GPBCLEAR")
    8583                      .dwattr $C$DW$1047, DW_AT_TI_symbol_name("_GPBCLEAR")
    8584                      .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8585                      .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
    8586              $C$DW$1048      .dwtag  DW_TAG_member
    8587                      .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$81)
    8588                      .dwattr $C$DW$1048, DW_AT_name("GPBTOGGLE")
    8589                      .dwattr $C$DW$1048, DW_AT_TI_symbol_name("_GPBTOGGLE")
    8590                      .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    8591                      .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
    8592              $C$DW$1049      .dwtag  DW_TAG_member
    8593                      .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$35)
    8594                      .dwattr $C$DW$1049, DW_AT_name("rsvd_7")
    8595                      .dwattr $C$DW$1049, DW_AT_TI_symbol_name("_rsvd_7")
    8596                      .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8597                      .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
    8598              $C$DW$1050      .dwtag  DW_TAG_member
    8599                      .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$81)
    8600                      .dwattr $C$DW$1050, DW_AT_name("AIODAT")
    8601                      .dwattr $C$DW$1050, DW_AT_TI_symbol_name("_AIODAT")
    8602                      .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8603                      .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
    8604              $C$DW$1051      .dwtag  DW_TAG_member
    8605                      .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$81)
    8606                      .dwattr $C$DW$1051, DW_AT_name("AIOSET")
    8607                      .dwattr $C$DW$1051, DW_AT_TI_symbol_name("_AIOSET")
    8608                      .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8609                      .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
    8610              $C$DW$1052      .dwtag  DW_TAG_member
    8611                      .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$81)
    8612                      .dwattr $C$DW$1052, DW_AT_name("AIOCLEAR")
    8613                      .dwattr $C$DW$1052, DW_AT_TI_symbol_name("_AIOCLEAR")
    8614                      .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8615                      .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
    8616              $C$DW$1053      .dwtag  DW_TAG_member
    8617                      .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$81)
    8618                      .dwattr $C$DW$1053, DW_AT_name("AIOTOGGLE")
    8619                      .dwattr $C$DW$1053, DW_AT_TI_symbol_name("_AIOTOGGLE")
    8620                      .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\3505210                            PAGE  172

    8621                      .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
    8622              $C$DW$1054      .dwtag  DW_TAG_member
    8623                      .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$29)
    8624                      .dwattr $C$DW$1054, DW_AT_name("GPIOXINTnSEL")
    8625                      .dwattr $C$DW$1054, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    8626                      .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8627                      .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
    8628              $C$DW$1055      .dwtag  DW_TAG_member
    8629                      .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$28)
    8630                      .dwattr $C$DW$1055, DW_AT_name("rsvd_8")
    8631                      .dwattr $C$DW$1055, DW_AT_TI_symbol_name("_rsvd_8")
    8632                      .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    8633                      .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
    8634              $C$DW$1056      .dwtag  DW_TAG_member
    8635                      .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$81)
    8636                      .dwattr $C$DW$1056, DW_AT_name("GPIOLPMSEL")
    8637                      .dwattr $C$DW$1056, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    8638                      .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8639                      .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
    8640                      .dwendtag $C$DW$T$84
    8641              
    8642              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    8643                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$84)
    8644                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    8645              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    8646                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    8647                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    8648              
    8649              $C$DW$T$86      .dwtag  DW_TAG_structure_type
    8650                      .dwattr $C$DW$T$86, DW_AT_name("_HAL_AdcData_t_")
    8651                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x10)
    8652              $C$DW$1057      .dwtag  DW_TAG_member
    8653                      .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$85)
    8654                      .dwattr $C$DW$1057, DW_AT_name("I")
