TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Nov 21 21:48:13 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("EST_setLs_qFmt")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EST_setLs_qFmt")

    2524              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_d_Low"), DW_AT_const_value(0x4
    2525              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_High"), DW_AT_const_value(0x
    2526              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_motor_Ls_q_Low"), DW_AT_const_value(0x4
    2527              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_High"), DW_AT_const_value(0x
    2528              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_Low"), DW_AT_const_value(0x4
    2529              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_High"), DW_AT_const_v
    2530              $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_resEst_Low"), DW_AT_const_va
    2531              $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_High"), DW_AT_const_v
    2532              $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrent_indEst_Low"), DW_AT_const_va
    2533              $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    2534              $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    2535              $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    2536              $C$DW$290       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    2537              $C$DW$291       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    2538              $C$DW$292       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    2539              $C$DW$293       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    2540              $C$DW$294       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    2541              $C$DW$295       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    2542              $C$DW$296       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    2543              $C$DW$297       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    2544              $C$DW$298       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    2545              $C$DW$299       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    2546              $C$DW$300       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    2547              $C$DW$301       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    2548              $C$DW$302       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    2549              $C$DW$303       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    2550              $C$DW$304       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    2551              $C$DW$305       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    2552              $C$DW$306       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    2553              $C$DW$307       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    2554              $C$DW$308       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    2555              $C$DW$309       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    2556              $C$DW$310       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    2557              $C$DW$311       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    2558              $C$DW$312       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    2559              $C$DW$313       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    2560                      .dwendtag $C$DW$T$74
    2561              
    2562              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    2563                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2564                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2565              $C$DW$314       .dwtag  DW_TAG_TI_far_type
    2566                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$75)
    2567              $C$DW$T$77      .dwtag  DW_TAG_const_type
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   52

    2568                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$314)
    2569              
    2570              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2571                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    2572                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    2573              $C$DW$315       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$20)
    2575                      .dwattr $C$DW$315, DW_AT_name("alpha_sf")
    2576                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_alpha_sf")
    2577                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$316       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$20)
    2581                      .dwattr $C$DW$316, DW_AT_name("beta_sf")
    2582                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_beta_sf")
    2583                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2584                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2585              $C$DW$317       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$22)
    2587                      .dwattr $C$DW$317, DW_AT_name("numSensors")
    2588                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_numSensors")
    2589                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2590                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2591                      .dwendtag $C$DW$T$23
    2592              
    2593              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    2594                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
    2595                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2596              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2597                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    2598                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2599              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    2600                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2601                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2602              
    2603              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2604                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    2605                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    2606              $C$DW$318       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$24)
    2608                      .dwattr $C$DW$318, DW_AT_name("version")
    2609                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_version")
    2610                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2612              $C$DW$319       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$26)
    2614                      .dwattr $C$DW$319, DW_AT_name("state")
    2615                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_state")
    2616                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2617                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$320       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$26)
    2620                      .dwattr $C$DW$320, DW_AT_name("prevState")
    2621                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_prevState")
    2622                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   53

    2623                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$321       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$28)
    2626                      .dwattr $C$DW$321, DW_AT_name("errorCode")
    2627                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_errorCode")
    2628                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2629                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$322       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$30)
    2632                      .dwattr $C$DW$322, DW_AT_name("clarkeHandle_I")
    2633                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_clarkeHandle_I")
    2634                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2635                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$323       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$31)
    2638                      .dwattr $C$DW$323, DW_AT_name("clarke_I")
    2639                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_clarke_I")
    2640                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2641                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$324       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$30)
    2644                      .dwattr $C$DW$324, DW_AT_name("clarkeHandle_V")
    2645                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_clarkeHandle_V")
    2646                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2647                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$325       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$31)
    2650                      .dwattr $C$DW$325, DW_AT_name("clarke_V")
    2651                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_clarke_V")
    2652                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2653                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$326       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$33)
    2656                      .dwattr $C$DW$326, DW_AT_name("estHandle")
    2657                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_estHandle")
    2658                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2659                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$327       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$35)
    2662                      .dwattr $C$DW$327, DW_AT_name("parkHandle")
    2663                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_parkHandle")
    2664                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2665                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$328       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$36)
    2668                      .dwattr $C$DW$328, DW_AT_name("park")
    2669                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_park")
    2670                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2671                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$329       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$38)
    2674                      .dwattr $C$DW$329, DW_AT_name("pidHandle_Id")
    2675                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_pidHandle_Id")
    2676                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2677                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   54

    2678              $C$DW$330       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$39)
    2680                      .dwattr $C$DW$330, DW_AT_name("pid_Id")
    2681                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_pid_Id")
    2682                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2683                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$331       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$38)
    2686                      .dwattr $C$DW$331, DW_AT_name("pidHandle_Iq")
    2687                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_pidHandle_Iq")
    2688                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2689                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$332       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$39)
    2692                      .dwattr $C$DW$332, DW_AT_name("pid_Iq")
    2693                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_pid_Iq")
    2694                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2695                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$333       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$38)
    2698                      .dwattr $C$DW$333, DW_AT_name("pidHandle_spd")
    2699                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_pidHandle_spd")
    2700                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2701                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$334       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$39)
    2704                      .dwattr $C$DW$334, DW_AT_name("pid_spd")
    2705                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_pid_spd")
    2706                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2707                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$335       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$41)
    2710                      .dwattr $C$DW$335, DW_AT_name("iparkHandle")
    2711                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_iparkHandle")
    2712                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2713                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$336       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$42)
    2716                      .dwattr $C$DW$336, DW_AT_name("ipark")
    2717                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_ipark")
    2718                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2719                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$337       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$44)
    2722                      .dwattr $C$DW$337, DW_AT_name("svgenHandle")
    2723                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_svgenHandle")
    2724                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2725                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$338       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$45)
    2728                      .dwattr $C$DW$338, DW_AT_name("svgen")
    2729                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_svgen")
    2730                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2731                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$339       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   55

    2733                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$47)
    2734                      .dwattr $C$DW$339, DW_AT_name("trajHandle_Id")
    2735                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_trajHandle_Id")
    2736                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2737                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$340       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$48)
    2740                      .dwattr $C$DW$340, DW_AT_name("traj_Id")
    2741                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_traj_Id")
    2742                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2743                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$341       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$47)
    2746                      .dwattr $C$DW$341, DW_AT_name("trajHandle_spd")
    2747                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_trajHandle_spd")
    2748                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2749                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$342       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$48)
    2752                      .dwattr $C$DW$342, DW_AT_name("traj_spd")
    2753                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_traj_spd")
    2754                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2755                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$343       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$47)
    2758                      .dwattr $C$DW$343, DW_AT_name("trajHandle_spdMax")
    2759                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    2760                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2761                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$344       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$48)
    2764                      .dwattr $C$DW$344, DW_AT_name("traj_spdMax")
    2765                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_traj_spdMax")
    2766                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2767                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$345       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$49)
    2770                      .dwattr $C$DW$345, DW_AT_name("motorParams")
    2771                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_motorParams")
    2772                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2773                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$346       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$52)
    2776                      .dwattr $C$DW$346, DW_AT_name("waitTimes")
    2777                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_waitTimes")
    2778                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2779                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$347       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$51)
    2782                      .dwattr $C$DW$347, DW_AT_name("counter_state")
    2783                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_counter_state")
    2784                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2785                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$348       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$53)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   56

    2788                      .dwattr $C$DW$348, DW_AT_name("numIsrTicksPerCtrlTick")
    2789                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    2790                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2791                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$349       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$53)
    2794                      .dwattr $C$DW$349, DW_AT_name("numCtrlTicksPerCurrentTick")
    2795                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    2796                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    2797                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$350       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$53)
    2800                      .dwattr $C$DW$350, DW_AT_name("numCtrlTicksPerSpeedTick")
    2801                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    2802                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    2803                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$351       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$53)
    2806                      .dwattr $C$DW$351, DW_AT_name("numCtrlTicksPerTrajTick")
    2807                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    2808                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    2809                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$352       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$51)
    2812                      .dwattr $C$DW$352, DW_AT_name("ctrlFreq_Hz")
    2813                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    2814                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2815                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$353       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$51)
    2818                      .dwattr $C$DW$353, DW_AT_name("trajFreq_Hz")
    2819                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_trajFreq_Hz")
    2820                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2821                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$354       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$20)
    2824                      .dwattr $C$DW$354, DW_AT_name("trajPeriod_sec")
    2825                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_trajPeriod_sec")
    2826                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2827                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2828              $C$DW$355       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$54)
    2830                      .dwattr $C$DW$355, DW_AT_name("ctrlPeriod_sec")
    2831                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    2832                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2833                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$356       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2836                      .dwattr $C$DW$356, DW_AT_name("maxVsMag_pu")
    2837                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_maxVsMag_pu")
    2838                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2839                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$357       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$55)
    2842                      .dwattr $C$DW$357, DW_AT_name("Iab_in")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   57

    2843                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Iab_in")
    2844                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2845                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$358       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$55)
    2848                      .dwattr $C$DW$358, DW_AT_name("Iab_filt")
    2849                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Iab_filt")
    2850                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2851                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2852              $C$DW$359       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$55)
    2854                      .dwattr $C$DW$359, DW_AT_name("Idq_in")
    2855                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Idq_in")
    2856                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2857                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$360       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$55)
    2860                      .dwattr $C$DW$360, DW_AT_name("Vab_in")
    2861                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Vab_in")
    2862                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2863                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$361       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    2866                      .dwattr $C$DW$361, DW_AT_name("spd_out")
    2867                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_spd_out")
    2868                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2869                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$362       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$55)
    2872                      .dwattr $C$DW$362, DW_AT_name("Vab_out")
    2873                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Vab_out")
    2874                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2875                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$363       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$55)
    2878                      .dwattr $C$DW$363, DW_AT_name("Vdq_out")
    2879                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Vdq_out")
    2880                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2881                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$364       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$54)
    2884                      .dwattr $C$DW$364, DW_AT_name("Rhf")
    2885                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Rhf")
    2886                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2887                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$365       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$54)
    2890                      .dwattr $C$DW$365, DW_AT_name("Lhf")
    2891                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Lhf")
    2892                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2893                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$366       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$54)
    2896                      .dwattr $C$DW$366, DW_AT_name("RoverL")
    2897                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_RoverL")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   58

    2898                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2899                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$367       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2902                      .dwattr $C$DW$367, DW_AT_name("Kp_Id")
    2903                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Kp_Id")
    2904                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2905                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$368       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2908                      .dwattr $C$DW$368, DW_AT_name("Kp_Iq")
    2909                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Kp_Iq")
    2910                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2911                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$369       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2914                      .dwattr $C$DW$369, DW_AT_name("Kp_spd")
    2915                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Kp_spd")
    2916                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2917                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$370       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2920                      .dwattr $C$DW$370, DW_AT_name("Ki_Id")
    2921                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Ki_Id")
    2922                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2923                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$371       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    2926                      .dwattr $C$DW$371, DW_AT_name("Ki_Iq")
    2927                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Ki_Iq")
    2928                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2929                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2930              $C$DW$372       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2932                      .dwattr $C$DW$372, DW_AT_name("Ki_spd")
    2933                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Ki_spd")
    2934                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2935                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$373       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2938                      .dwattr $C$DW$373, DW_AT_name("Kd_Id")
    2939                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Kd_Id")
    2940                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2941                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$374       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2944                      .dwattr $C$DW$374, DW_AT_name("Kd_Iq")
    2945                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Kd_Iq")
    2946                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2947                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$375       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2950                      .dwattr $C$DW$375, DW_AT_name("Kd_spd")
    2951                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Kd_spd")
    2952                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   59

    2953                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$376       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2956                      .dwattr $C$DW$376, DW_AT_name("Ui_Id")
    2957                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Ui_Id")
    2958                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2959                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$377       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2962                      .dwattr $C$DW$377, DW_AT_name("Ui_Iq")
    2963                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Ui_Iq")
    2964                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2965                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$378       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    2968                      .dwattr $C$DW$378, DW_AT_name("Ui_spd")
    2969                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Ui_spd")
    2970                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2971                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$379       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$55)
    2974                      .dwattr $C$DW$379, DW_AT_name("Idq_ref")
    2975                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_Idq_ref")
    2976                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2977                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$380       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$20)
    2980                      .dwattr $C$DW$380, DW_AT_name("IdRated")
    2981                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_IdRated")
    2982                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2983                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$381       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$20)
    2986                      .dwattr $C$DW$381, DW_AT_name("spd_ref")
    2987                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_spd_ref")
    2988                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2989                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2990              $C$DW$382       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2992                      .dwattr $C$DW$382, DW_AT_name("spd_max")
    2993                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_spd_max")
    2994                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2995                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2996              $C$DW$383       .dwtag  DW_TAG_member
    2997                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$53)
    2998                      .dwattr $C$DW$383, DW_AT_name("counter_current")
    2999                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_counter_current")
    3000                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3001                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3002              $C$DW$384       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$53)
    3004                      .dwattr $C$DW$384, DW_AT_name("counter_isr")
    3005                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_counter_isr")
    3006                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3007                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   60

    3008              $C$DW$385       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$53)
    3010                      .dwattr $C$DW$385, DW_AT_name("counter_speed")
    3011                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_counter_speed")
    3012                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3013                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3014              $C$DW$386       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$53)
    3016                      .dwattr $C$DW$386, DW_AT_name("counter_traj")
    3017                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_counter_traj")
    3018                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3019                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3020              $C$DW$387       .dwtag  DW_TAG_member
    3021                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$56)
    3022                      .dwattr $C$DW$387, DW_AT_name("flag_enableCtrl")
    3023                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3024                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3025                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$388       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$56)
    3028                      .dwattr $C$DW$388, DW_AT_name("flag_enableDcBusComp")
    3029                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3030                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3031                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3032              $C$DW$389       .dwtag  DW_TAG_member
    3033                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$56)
    3034                      .dwattr $C$DW$389, DW_AT_name("flag_enablePowerWarp")
    3035                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3036                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3037                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3038              $C$DW$390       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$56)
    3040                      .dwattr $C$DW$390, DW_AT_name("flag_enableOffset")
    3041                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_flag_enableOffset")
    3042                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3043                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3044              $C$DW$391       .dwtag  DW_TAG_member
    3045                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$56)
    3046                      .dwattr $C$DW$391, DW_AT_name("flag_enableSpeedCtrl")
    3047                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3048                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3049                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3050              $C$DW$392       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$56)
    3052                      .dwattr $C$DW$392, DW_AT_name("flag_enableUserMotorParams")
    3053                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3054                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3055                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3056              $C$DW$393       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$55)
    3058                      .dwattr $C$DW$393, DW_AT_name("Idq_offset_pu")
    3059                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3060                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3061                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3062              $C$DW$394       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   61

    3063                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$55)
    3064                      .dwattr $C$DW$394, DW_AT_name("Vdq_offset_pu")
    3065                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3066                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3067                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3068              $C$DW$395       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$20)
    3070                      .dwattr $C$DW$395, DW_AT_name("angle_pu")
    3071                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_angle_pu")
    3072                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3073                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3074              $C$DW$396       .dwtag  DW_TAG_member
    3075                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$20)
    3076                      .dwattr $C$DW$396, DW_AT_name("speed_ref_pu")
    3077                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_speed_ref_pu")
    3078                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3079                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3080              $C$DW$397       .dwtag  DW_TAG_member
    3081                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$20)
    3082                      .dwattr $C$DW$397, DW_AT_name("speed_fb_pu")
    3083                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_speed_fb_pu")
    3084                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3085                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3086              $C$DW$398       .dwtag  DW_TAG_member
    3087                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    3088                      .dwattr $C$DW$398, DW_AT_name("speed_outMax_pu")
    3089                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_speed_outMax_pu")
    3090                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3091                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3092              $C$DW$399       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$56)
    3094                      .dwattr $C$DW$399, DW_AT_name("flag_enableCurrentCtrl")
    3095                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3096                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3097                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3098                      .dwendtag $C$DW$T$57
    3099              
    3100              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3101                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$57)
    3102                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3103              $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3104                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$57)
    3105                      .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3106              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3107                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3108                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3109              $C$DW$400       .dwtag  DW_TAG_TI_far_type
    3110                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$84)
    3111              $C$DW$T$85      .dwtag  DW_TAG_const_type
    3112                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$400)
    3113              
    3114              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3115                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3116                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3117              $C$DW$401       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   62

    3118                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$21)
    3119                      .dwattr $C$DW$401, DW_AT_name("rsvd")
    3120                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_rsvd")
    3121                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$402       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$59)
    3125                      .dwattr $C$DW$402, DW_AT_name("targetProc")
    3126                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_targetProc")
    3127                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3128                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$403       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$21)
    3131                      .dwattr $C$DW$403, DW_AT_name("major")
    3132                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_major")
    3133                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3134                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$404       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$21)
    3137                      .dwattr $C$DW$404, DW_AT_name("minor")
    3138                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_minor")
    3139                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3140                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3141                      .dwendtag $C$DW$T$60
    3142              
    3143              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3144                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
    3145                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3146              
    3147              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3148                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3149                      .dwattr $C$DW$T$19, DW_AT_declaration
    3150                      .dwendtag $C$DW$T$19
    3151              
    3152              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3153                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3154                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3155              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3156                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3157                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3158              
    3159              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3160                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3161                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3162              $C$DW$405       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$20)
    3164                      .dwattr $C$DW$405, DW_AT_name("sinTh")
    3165                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_sinTh")
    3166                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3167                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$406       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$20)
    3170                      .dwattr $C$DW$406, DW_AT_name("cosTh")
    3171                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_cosTh")
    3172                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   63

    3173                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3174                      .dwendtag $C$DW$T$61
    3175              
    3176              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3177                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3178                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3179              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3180                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3181                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3182              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3183                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3184                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3185              
    3186              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3187                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3188                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3189              $C$DW$407       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$62)
    3191                      .dwattr $C$DW$407, DW_AT_name("value")
    3192                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_value")
    3193                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3194                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3195                      .dwendtag $C$DW$T$63
    3196              
    3197              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3198                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3199                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3200              
    3201              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3202                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3203                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3204              $C$DW$408       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$65)
    3206                      .dwattr $C$DW$408, DW_AT_name("type")
    3207                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_type")
    3208                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3209                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$409       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$53)
    3212                      .dwattr $C$DW$409, DW_AT_name("numPolePairs")
    3213                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_numPolePairs")
    3214                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3215                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$410       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$54)
    3218                      .dwattr $C$DW$410, DW_AT_name("Lr_H")
    3219                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_Lr_H")
    3220                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3221                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$411       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$54)
    3224                      .dwattr $C$DW$411, DW_AT_name("Ls_d_H")
    3225                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Ls_d_H")
    3226                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3227                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   64

    3228              $C$DW$412       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$54)
    3230                      .dwattr $C$DW$412, DW_AT_name("Ls_q_H")
    3231                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ls_q_H")
    3232                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3233                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3234              $C$DW$413       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$54)
    3236                      .dwattr $C$DW$413, DW_AT_name("Rr_Ohm")
    3237                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Rr_Ohm")
    3238                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3239                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3240              $C$DW$414       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$54)
    3242                      .dwattr $C$DW$414, DW_AT_name("Rs_Ohm")
    3243                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Rs_Ohm")
    3244                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3245                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$415       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$54)
    3248                      .dwattr $C$DW$415, DW_AT_name("ratedFlux_VpHz")
    3249                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3250                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3251                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3252                      .dwendtag $C$DW$T$66
    3253              
    3254              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
    3255                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3256                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3257              
    3258              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3259                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3260                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3261              $C$DW$416       .dwtag  DW_TAG_member
    3262                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$20)
    3263                      .dwattr $C$DW$416, DW_AT_name("sinTh")
    3264                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_sinTh")
    3265                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3266                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$417       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3269                      .dwattr $C$DW$417, DW_AT_name("cosTh")
    3270                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_cosTh")
    3271                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3272                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    3273                      .dwendtag $C$DW$T$67
    3274              
    3275              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3276                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3277                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3278              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3279                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3280                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3281              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3282                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   65

    3283                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3284              
    3285              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3286                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3287                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3288              $C$DW$418       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$20)
    3290                      .dwattr $C$DW$418, DW_AT_name("Kp")
    3291                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp")
    3292                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3293                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$419       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$20)
    3296                      .dwattr $C$DW$419, DW_AT_name("Ki")
    3297                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ki")
    3298                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3299                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$420       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$20)
    3302                      .dwattr $C$DW$420, DW_AT_name("Kd")
    3303                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kd")
    3304                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3305                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$421       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$20)
    3308                      .dwattr $C$DW$421, DW_AT_name("Ui")
    3309                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Ui")
    3310                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3311                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$422       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$20)
    3314                      .dwattr $C$DW$422, DW_AT_name("refValue")
    3315                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_refValue")
    3316                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3317                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3318              $C$DW$423       .dwtag  DW_TAG_member
    3319                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3320                      .dwattr $C$DW$423, DW_AT_name("fbackValue")
    3321                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_fbackValue")
    3322                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3323                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3324              $C$DW$424       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3326                      .dwattr $C$DW$424, DW_AT_name("outMin")
    3327                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_outMin")
    3328                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3329                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$425       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3332                      .dwattr $C$DW$425, DW_AT_name("outMax")
    3333                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_outMax")
    3334                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3335                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3336                      .dwendtag $C$DW$T$68
    3337              
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   66

    3338              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3339                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3340                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3341              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3342                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3343                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3344              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3345                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3346                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3347              
    3348              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3349                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3350                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3351              $C$DW$426       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3353                      .dwattr $C$DW$426, DW_AT_name("maxModulation")
    3354                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_maxModulation")
    3355                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3356                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3357                      .dwendtag $C$DW$T$69
    3358              
    3359              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3360                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3361                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3362              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3363                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3364                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3365              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3366                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3367                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3368              
    3369              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3370                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3371                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3372              $C$DW$427       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3374                      .dwattr $C$DW$427, DW_AT_name("targetValue")
    3375                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_targetValue")
    3376                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3377                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3378              $C$DW$428       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3380                      .dwattr $C$DW$428, DW_AT_name("intValue")
    3381                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_intValue")
    3382                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3383                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3384              $C$DW$429       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3386                      .dwattr $C$DW$429, DW_AT_name("minValue")
    3387                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_minValue")
    3388                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3389                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3390              $C$DW$430       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3392                      .dwattr $C$DW$430, DW_AT_name("maxValue")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   67

    3393                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_maxValue")
    3394                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3395                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3396              $C$DW$431       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3398                      .dwattr $C$DW$431, DW_AT_name("maxDelta")
    3399                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_maxDelta")
    3400                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3401                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3402                      .dwendtag $C$DW$T$70
    3403              
    3404              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3405                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3406                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3407              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3408                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3409                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3410              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3411                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3412                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3413              
    3414              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3415                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3416                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3417              $C$DW$432       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$54)
    3419                      .dwattr $C$DW$432, DW_AT_name("iqFullScaleCurrent_A")
    3420                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3421                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3422                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3423              $C$DW$433       .dwtag  DW_TAG_member
    3424                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$54)
    3425                      .dwattr $C$DW$433, DW_AT_name("iqFullScaleVoltage_V")
    3426                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3427                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3428                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$434       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$54)
    3431                      .dwattr $C$DW$434, DW_AT_name("iqFullScaleFreq_Hz")
    3432                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3433                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3434                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3435              $C$DW$435       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$53)
    3437                      .dwattr $C$DW$435, DW_AT_name("numIsrTicksPerCtrlTick")
    3438                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3439                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3440                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3441              $C$DW$436       .dwtag  DW_TAG_member
    3442                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$53)
    3443                      .dwattr $C$DW$436, DW_AT_name("numCtrlTicksPerCurrentTick")
    3444                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3445                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3446                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$437       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   68

    3448                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$53)
    3449                      .dwattr $C$DW$437, DW_AT_name("numCtrlTicksPerEstTick")
    3450                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3451                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3452                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3453              $C$DW$438       .dwtag  DW_TAG_member
    3454                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$53)
    3455                      .dwattr $C$DW$438, DW_AT_name("numCtrlTicksPerSpeedTick")
    3456                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3457                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3458                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3459              $C$DW$439       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    3461                      .dwattr $C$DW$439, DW_AT_name("numCtrlTicksPerTrajTick")
    3462                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3463                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3464                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3465              $C$DW$440       .dwtag  DW_TAG_member
    3466                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    3467                      .dwattr $C$DW$440, DW_AT_name("numCurrentSensors")
    3468                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_numCurrentSensors")
    3469                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3470                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3471              $C$DW$441       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    3473                      .dwattr $C$DW$441, DW_AT_name("numVoltageSensors")
    3474                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_numVoltageSensors")
    3475                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3476                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3477              $C$DW$442       .dwtag  DW_TAG_member
    3478                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$54)
    3479                      .dwattr $C$DW$442, DW_AT_name("offsetPole_rps")
    3480                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_offsetPole_rps")
    3481                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3482                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3483              $C$DW$443       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$54)
    3485                      .dwattr $C$DW$443, DW_AT_name("fluxPole_rps")
    3486                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_fluxPole_rps")
    3487                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3488                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$444       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$54)
    3491                      .dwattr $C$DW$444, DW_AT_name("zeroSpeedLimit")
    3492                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3493                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3494                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3495              $C$DW$445       .dwtag  DW_TAG_member
    3496                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    3497                      .dwattr $C$DW$445, DW_AT_name("forceAngleFreq_Hz")
    3498                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3499                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3500                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3501              $C$DW$446       .dwtag  DW_TAG_member
    3502                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   69

    3503                      .dwattr $C$DW$446, DW_AT_name("maxAccel_Hzps")
    3504                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3505                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3506                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3507              $C$DW$447       .dwtag  DW_TAG_member
    3508                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$54)
    3509                      .dwattr $C$DW$447, DW_AT_name("maxAccel_est_Hzps")
    3510                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3511                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3512                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3513              $C$DW$448       .dwtag  DW_TAG_member
    3514                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    3515                      .dwattr $C$DW$448, DW_AT_name("directionPole_rps")
    3516                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_directionPole_rps")
    3517                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3518                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3519              $C$DW$449       .dwtag  DW_TAG_member
    3520                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$54)
    3521                      .dwattr $C$DW$449, DW_AT_name("speedPole_rps")
    3522                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_speedPole_rps")
    3523                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3524                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$450       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$54)
    3527                      .dwattr $C$DW$450, DW_AT_name("dcBusPole_rps")
    3528                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_dcBusPole_rps")
    3529                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3530                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3531              $C$DW$451       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
    3533                      .dwattr $C$DW$451, DW_AT_name("fluxFraction")
    3534                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_fluxFraction")
    3535                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3536                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3537              $C$DW$452       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$54)
    3539                      .dwattr $C$DW$452, DW_AT_name("indEst_speedMaxFraction")
    3540                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    3541                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3542                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3543              $C$DW$453       .dwtag  DW_TAG_member
    3544                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$54)
    3545                      .dwattr $C$DW$453, DW_AT_name("powerWarpGain")
    3546                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_powerWarpGain")
    3547                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3548                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3549              $C$DW$454       .dwtag  DW_TAG_member
    3550                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$53)
    3551                      .dwattr $C$DW$454, DW_AT_name("systemFreq_MHz")
    3552                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_systemFreq_MHz")
    3553                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3554                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3555              $C$DW$455       .dwtag  DW_TAG_member
    3556                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$54)
    3557                      .dwattr $C$DW$455, DW_AT_name("pwmPeriod_usec")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   70

    3558                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    3559                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3560                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$456       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$54)
    3563                      .dwattr $C$DW$456, DW_AT_name("voltage_sf")
    3564                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_voltage_sf")
    3565                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3566                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$457       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$54)
    3569                      .dwattr $C$DW$457, DW_AT_name("current_sf")
    3570                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_current_sf")
    3571                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3572                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$458       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$54)
    3575                      .dwattr $C$DW$458, DW_AT_name("voltageFilterPole_rps")
    3576                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    3577                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3578                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$459       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$54)
    3581                      .dwattr $C$DW$459, DW_AT_name("maxVsMag_pu")
    3582                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3583                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3584                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3585              $C$DW$460       .dwtag  DW_TAG_member
    3586                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$54)
    3587                      .dwattr $C$DW$460, DW_AT_name("estKappa")
    3588                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_estKappa")
    3589                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3590                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3591              $C$DW$461       .dwtag  DW_TAG_member
    3592                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$65)
    3593                      .dwattr $C$DW$461, DW_AT_name("motor_type")
    3594                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_motor_type")
    3595                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3596                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3597              $C$DW$462       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$53)
    3599                      .dwattr $C$DW$462, DW_AT_name("motor_numPolePairs")
    3600                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_motor_numPolePairs")
    3601                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    3602                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$463       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$54)
    3605                      .dwattr $C$DW$463, DW_AT_name("motor_ratedFlux")
    3606                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_motor_ratedFlux")
    3607                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3608                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3609              $C$DW$464       .dwtag  DW_TAG_member
    3610                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$54)
    3611                      .dwattr $C$DW$464, DW_AT_name("motor_Rr")
    3612                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_motor_Rr")
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   71

    3613                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3614                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3615              $C$DW$465       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$54)
    3617                      .dwattr $C$DW$465, DW_AT_name("motor_Rs")
    3618                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_motor_Rs")
    3619                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3620                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3621              $C$DW$466       .dwtag  DW_TAG_member
    3622                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3623                      .dwattr $C$DW$466, DW_AT_name("motor_Ls_d")
    3624                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_motor_Ls_d")
    3625                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3626                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$467       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3629                      .dwattr $C$DW$467, DW_AT_name("motor_Ls_q")
    3630                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_motor_Ls_q")
    3631                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3632                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3633              $C$DW$468       .dwtag  DW_TAG_member
    3634                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3635                      .dwattr $C$DW$468, DW_AT_name("maxCurrent")
    3636                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_maxCurrent")
    3637                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3638                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3639              $C$DW$469       .dwtag  DW_TAG_member
    3640                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3641                      .dwattr $C$DW$469, DW_AT_name("maxCurrent_resEst")
    3642                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    3643                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3644                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3645              $C$DW$470       .dwtag  DW_TAG_member
    3646                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3647                      .dwattr $C$DW$470, DW_AT_name("maxCurrent_indEst")
    3648                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    3649                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3650                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3651              $C$DW$471       .dwtag  DW_TAG_member
    3652                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3653                      .dwattr $C$DW$471, DW_AT_name("maxCurrentSlope")
    3654                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_maxCurrentSlope")
    3655                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3656                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3657              $C$DW$472       .dwtag  DW_TAG_member
    3658                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$54)
    3659                      .dwattr $C$DW$472, DW_AT_name("maxCurrentSlope_powerWarp")
    3660                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    3661                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3662                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3663              $C$DW$473       .dwtag  DW_TAG_member
    3664                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$54)
    3665                      .dwattr $C$DW$473, DW_AT_name("IdRated")
    3666                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_IdRated")
    3667                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
TMS320C2000 Assembler PC v6.4.11 Mon Nov 21 21:48:13 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1312010                            PAGE   72

    3668                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3669              $C$DW$474       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$54)
    3671                      .dwattr $C$DW$474, DW_AT_name("IdRatedFraction_indEst")
    3672                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    3673                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3674                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3675              $C$DW$475       .dwtag  DW_TAG_member
    3676                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$54)
    3677                      .dwattr $C$DW$475, DW_AT_name("IdRatedFraction_ratedFlux")
    3678                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    3679                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    3680                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$476       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$54)
    3683                      .dwattr $C$DW$476, DW_AT_name("IdRated_delta")
    3684                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_IdRated_delta")
    3685                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3686                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3687              $C$DW$477       .dwtag  DW_TAG_member
    3688                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    3689                      .dwattr $C$DW$477, DW_AT_name("fluxEstFreq_Hz")
    3690                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    3691                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    3692                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$478       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$52)
    3695                      .dwattr $C$DW$478, DW_AT_name("ctrlWaitTime")
    3696                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_ctrlWaitTime")
    3697                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3698                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3699              $C$DW$479       .dwtag  DW_TAG_member
    3700                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$71)
    3701                      .dwattr $C$DW$479, DW_AT_name("estWaitTime")
    3702                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_estWaitTime")
    3703                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3704                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3705              $C$DW$480       .dwtag  DW_TAG_member
    3706                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$72)
