TMS320C2000 Assembler PC v6.4.11 Mon Aug 29 16:45:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1288810                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Aug 29 16:45:09 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/drivers/i2c/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;       C:\ti\ccsv6\tools\compiler\c2000_6.4.11\bin\opt2000.exe C:\\Users\\bee25\\AppData\\Local\\Temp\\12888

    1761              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Tx_Rdy"), DW_AT_const_value(0x05)
    1762              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Stop"), DW_AT_const_value(0x06)
    1763              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_IntSrc_Slave_Addr"), DW_AT_const_value(0x07)
    1764                      .dwendtag $C$DW$T$27
    1765              
    1766              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_IntSource_e")
    1767                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1768                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1769              
    1770              $C$DW$T$33      .dwtag  DW_TAG_enumeration_type
    1771                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1772              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_None"), DW_AT_const_value(0x00)
    1773              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Arb_Lost"), DW_AT_const_value(0x01)
    1774              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK"), DW_AT_const_value(0x02)
    1775              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Reg_Rdy"), DW_AT_const_value(0x04)
    1776              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Rdy"), DW_AT_const_value(0x08)
    1777              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Rdy"), DW_AT_const_value(0x10)
    1778              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Stop"), DW_AT_const_value(0x20)
    1779              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_AD0"), DW_AT_const_value(0x100)
    1780              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Addr"), DW_AT_const_value(0x200)
    1781              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Tx_Empty"), DW_AT_const_value(0x400)
    1782              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Rx_Full"), DW_AT_const_value(0x800)
    1783              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Busy"), DW_AT_const_value(0x1000)
    1784              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_NACK_Sent"), DW_AT_const_value(0x2000)
    1785              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Status_Slave_Dir"), DW_AT_const_value(0x4000)
    1786                      .dwendtag $C$DW$T$33
    1787              
    1788              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Status_e")
    1789                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1790                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1791              
    1792              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.11 Mon Aug 29 16:45:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1288810                            PAGE   34

    1793                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1794              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Stop"), DW_AT_const_value(0xc00)
    1795              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_TX"), DW_AT_const_value(0x2e00)
    1796              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Single_RX"), DW_AT_const_value(0x2c00)
    1797              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Start"), DW_AT_const_value(0x2600
    1798              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_TX_Stop"), DW_AT_const_value(0xe00)
    1799              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Start"), DW_AT_const_value(0x2400
    1800              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("I2C_Control_Burst_RX_Stop"), DW_AT_const_value(0xc00)
    1801                      .dwendtag $C$DW$T$37
    1802              
    1803              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Control_e")
    1804                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1805                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1806              
    1807              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1808                      .dwattr $C$DW$T$19, DW_AT_name("_I2C_Handle_")
    1809                      .dwattr $C$DW$T$19, DW_AT_declaration
    1810                      .dwendtag $C$DW$T$19
    1811              
    1812              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1813                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    1815              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle")
    1816                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1817                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1818              $C$DW$175       .dwtag  DW_TAG_TI_far_type
    1819                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$30)
    1820              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1821                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$175)
    1822              
    1823              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1824                      .dwattr $C$DW$T$23, DW_AT_name("_I2C_Obj_")
    1825                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x22)
    1826              $C$DW$176       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    1828                      .dwattr $C$DW$176, DW_AT_name("I2COAR")
    1829                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_I2COAR")
    1830                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1832              $C$DW$177       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    1834                      .dwattr $C$DW$177, DW_AT_name("I2CIER")
    1835                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_I2CIER")
    1836                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1837                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1838              $C$DW$178       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1840                      .dwattr $C$DW$178, DW_AT_name("I2CSTR")
    1841                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_I2CSTR")
    1842                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1843                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1844              $C$DW$179       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    1846                      .dwattr $C$DW$179, DW_AT_name("I2CCLKL")
    1847                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_I2CCLKL")
TMS320C2000 Assembler PC v6.4.11 Mon Aug 29 16:45:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1288810                            PAGE   35

    1848                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1849                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1850              $C$DW$180       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1852                      .dwattr $C$DW$180, DW_AT_name("I2CCLKH")
    1853                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_I2CCLKH")
    1854                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1855                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$181       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    1858                      .dwattr $C$DW$181, DW_AT_name("I2CCNT")
    1859                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_I2CCNT")
    1860                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1861                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1862              $C$DW$182       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1864                      .dwattr $C$DW$182, DW_AT_name("I2CDRR")
    1865                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_I2CDRR")
    1866                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1867                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1868              $C$DW$183       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1870                      .dwattr $C$DW$183, DW_AT_name("I2CSAR")
    1871                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_I2CSAR")
    1872                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1873                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$184       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    1876                      .dwattr $C$DW$184, DW_AT_name("I2CDXR")
    1877                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_I2CDXR")
    1878                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1879                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$185       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    1882                      .dwattr $C$DW$185, DW_AT_name("I2CMDR")
    1883                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_I2CMDR")
    1884                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1885                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1886              $C$DW$186       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    1888                      .dwattr $C$DW$186, DW_AT_name("I2CISRC")
    1889                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_I2CISRC")
    1890                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1891                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$187       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    1894                      .dwattr $C$DW$187, DW_AT_name("I2CEMDR")
    1895                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_I2CEMDR")
    1896                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1897                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$188       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    1900                      .dwattr $C$DW$188, DW_AT_name("I2CPSC")
    1901                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_I2CPSC")
    1902                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.4.11 Mon Aug 29 16:45:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1288810                            PAGE   36

    1903                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1904              $C$DW$189       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    1906                      .dwattr $C$DW$189, DW_AT_name("rsvd2")
    1907                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd2")
    1908                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1909                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$190       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1912                      .dwattr $C$DW$190, DW_AT_name("I2CFFTX")
    1913                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_I2CFFTX")
    1914                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1915                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$191       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    1918                      .dwattr $C$DW$191, DW_AT_name("I2CFFRX")
    1919                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_I2CFFRX")
    1920                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1921                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1922                      .dwendtag $C$DW$T$23
    1923              
    1924              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Obj")
    1925                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
    1926                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1927              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1928                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1929              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1930                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1931                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1932              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1933                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1934                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1935                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1936              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1937                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1938                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1939                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1940              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1941                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1942                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1943                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1944              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1945                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1946                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1947                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1948              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1949                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1950                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1951                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1952              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1953                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1954                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1955                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1956              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1957                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
TMS320C2000 Assembler PC v6.4.11 Mon Aug 29 16:45:09 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1288810                            PAGE   37

    1958                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1959                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1960              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1961                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1962                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1963                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1964              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1965                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$11)
    1966                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1967              $C$DW$192       .dwtag  DW_TAG_TI_far_type
    1968                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$20)
    1969              $C$DW$T$21      .dwtag  DW_TAG_volatile_type
    1970                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$192)
    1971              
    1972              $C$DW$T$22      .dwtag  DW_TAG_array_type
    1973                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
