TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                        PC v6.4.11 *
       3              ;* Date/Time created: Mon Oct 03 13:48:44 2016                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_16/sw/solutions/instaspin_foc/src/pro
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.11 Copyright (c) 1996-2015 Tex
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\motorware\motorware_1_01_00_16\sw\solutions\instaspin_foc\boa
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    3937              $C$DW$570       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_5"), DW_AT_const_value(0x05)
    3938              $C$DW$571       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_6"), DW_AT_const_value(0x06)
    3939              $C$DW$572       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_7"), DW_AT_const_value(0x07)
    3940              $C$DW$573       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_8"), DW_AT_const_value(0x08)
    3941              $C$DW$574       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_9"), DW_AT_const_value(0x09)
    3942              $C$DW$575       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_10"), DW_AT_const_value(0x0a)
    3943              $C$DW$576       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_11"), DW_AT_const_value(0x0b)
    3944              $C$DW$577       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_12"), DW_AT_const_value(0x0c)
    3945              $C$DW$578       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_13"), DW_AT_const_value(0x0d)
    3946              $C$DW$579       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_14"), DW_AT_const_value(0x0e)
    3947              $C$DW$580       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_ResultNumber_15"), DW_AT_const_value(0x0f)
    3948                      .dwendtag $C$DW$T$215
    3949              
    3950              $C$DW$T$216     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_ResultNumber_e")
    3951                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    3952                      .dwattr $C$DW$T$216, DW_AT_language(DW_LANG_C)
    3953              
    3954              $C$DW$T$218     .dwtag  DW_TAG_enumeration_type
    3955                      .dwattr $C$DW$T$218, DW_AT_byte_size(0x01)
    3956              $C$DW$581       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3957              $C$DW$582       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3958              $C$DW$583       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3959              $C$DW$584       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3960              $C$DW$585       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3961              $C$DW$586       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3962              $C$DW$587       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3963              $C$DW$588       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3964              $C$DW$589       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3965              $C$DW$590       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3966              $C$DW$591       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
    3967              $C$DW$592       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3968                      .dwendtag $C$DW$T$218
    3969              
    3970              $C$DW$T$219     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3971                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$218)
    3972                      .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    3973              
    3974              $C$DW$T$221     .dwtag  DW_TAG_enumeration_type
    3975                      .dwattr $C$DW$T$221, DW_AT_byte_size(0x01)
    3976              $C$DW$593       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3977              $C$DW$594       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3978                      .dwendtag $C$DW$T$221
    3979              
    3980              $C$DW$T$222     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3981                      .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$221)
    3982                      .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    3983              
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   80

    3984              $C$DW$T$224     .dwtag  DW_TAG_enumeration_type
    3985                      .dwattr $C$DW$T$224, DW_AT_byte_size(0x01)
    3986              $C$DW$595       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_1"), DW_AT_const_value(0x00)
    3987              $C$DW$596       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_2"), DW_AT_const_value(0x01)
    3988              $C$DW$597       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_3"), DW_AT_const_value(0x02)
    3989              $C$DW$598       .dwtag  DW_TAG_enumerator, DW_AT_name("PWM_Number_4"), DW_AT_const_value(0x03)
    3990                      .dwendtag $C$DW$T$224
    3991              
    3992              $C$DW$T$225     .dwtag  DW_TAG_typedef, DW_AT_name("PWM_Number_e")
    3993                      .dwattr $C$DW$T$225, DW_AT_type(*$C$DW$T$224)
    3994                      .dwattr $C$DW$T$225, DW_AT_language(DW_LANG_C)
    3995              
    3996              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3997                      .dwattr $C$DW$T$31, DW_AT_name("_ADC_Obj_")
    3998                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x6650)
    3999              $C$DW$599       .dwtag  DW_TAG_member
    4000                      .dwattr $C$DW$599, DW_AT_type(*$C$DW$T$25)
    4001                      .dwattr $C$DW$599, DW_AT_name("ADCRESULT")
    4002                      .dwattr $C$DW$599, DW_AT_TI_symbol_name("_ADCRESULT")
    4003                      .dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4004                      .dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
    4005              $C$DW$600       .dwtag  DW_TAG_member
    4006                      .dwattr $C$DW$600, DW_AT_type(*$C$DW$T$26)
    4007                      .dwattr $C$DW$600, DW_AT_name("resvd_1")
    4008                      .dwattr $C$DW$600, DW_AT_TI_symbol_name("_resvd_1")
    4009                      .dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4010                      .dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
    4011              $C$DW$601       .dwtag  DW_TAG_member
    4012                      .dwattr $C$DW$601, DW_AT_type(*$C$DW$T$24)
    4013                      .dwattr $C$DW$601, DW_AT_name("ADCCTL1")
    4014                      .dwattr $C$DW$601, DW_AT_TI_symbol_name("_ADCCTL1")
    4015                      .dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    4016                      .dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
    4017              $C$DW$602       .dwtag  DW_TAG_member
    4018                      .dwattr $C$DW$602, DW_AT_type(*$C$DW$T$24)
    4019                      .dwattr $C$DW$602, DW_AT_name("ADCCTL2")
    4020                      .dwattr $C$DW$602, DW_AT_TI_symbol_name("_ADCCTL2")
    4021                      .dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    4022                      .dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$603       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$603, DW_AT_type(*$C$DW$T$27)
    4025                      .dwattr $C$DW$603, DW_AT_name("rsvd_2")
    4026                      .dwattr $C$DW$603, DW_AT_TI_symbol_name("_rsvd_2")
    4027                      .dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4028                      .dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
    4029              $C$DW$604       .dwtag  DW_TAG_member
    4030                      .dwattr $C$DW$604, DW_AT_type(*$C$DW$T$24)
    4031                      .dwattr $C$DW$604, DW_AT_name("ADCINTFLG")
    4032                      .dwattr $C$DW$604, DW_AT_TI_symbol_name("_ADCINTFLG")
    4033                      .dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4034                      .dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
    4035              $C$DW$605       .dwtag  DW_TAG_member
    4036                      .dwattr $C$DW$605, DW_AT_type(*$C$DW$T$24)
    4037                      .dwattr $C$DW$605, DW_AT_name("ADCINTFLGCLR")
    4038                      .dwattr $C$DW$605, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   81

    4039                      .dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4040                      .dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
    4041              $C$DW$606       .dwtag  DW_TAG_member
    4042                      .dwattr $C$DW$606, DW_AT_type(*$C$DW$T$24)
    4043                      .dwattr $C$DW$606, DW_AT_name("ADCINTOVF")
    4044                      .dwattr $C$DW$606, DW_AT_TI_symbol_name("_ADCINTOVF")
    4045                      .dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4046                      .dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
    4047              $C$DW$607       .dwtag  DW_TAG_member
    4048                      .dwattr $C$DW$607, DW_AT_type(*$C$DW$T$24)
    4049                      .dwattr $C$DW$607, DW_AT_name("ADCINTOVFCLR")
    4050                      .dwattr $C$DW$607, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4051                      .dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4052                      .dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
    4053              $C$DW$608       .dwtag  DW_TAG_member
    4054                      .dwattr $C$DW$608, DW_AT_type(*$C$DW$T$28)
    4055                      .dwattr $C$DW$608, DW_AT_name("INTSELxNy")
    4056                      .dwattr $C$DW$608, DW_AT_TI_symbol_name("_INTSELxNy")
    4057                      .dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4058                      .dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
    4059              $C$DW$609       .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$609, DW_AT_type(*$C$DW$T$29)
    4061                      .dwattr $C$DW$609, DW_AT_name("rsvd_3")
    4062                      .dwattr $C$DW$609, DW_AT_TI_symbol_name("_rsvd_3")
    4063                      .dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4064                      .dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$610       .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$610, DW_AT_type(*$C$DW$T$24)
    4067                      .dwattr $C$DW$610, DW_AT_name("SOCPRICTRL")
    4068                      .dwattr $C$DW$610, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4069                      .dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4070                      .dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$611       .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$611, DW_AT_type(*$C$DW$T$24)
    4073                      .dwattr $C$DW$611, DW_AT_name("rsvd_4")
    4074                      .dwattr $C$DW$611, DW_AT_TI_symbol_name("_rsvd_4")
    4075                      .dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4076                      .dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$612       .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$612, DW_AT_type(*$C$DW$T$24)
    4079                      .dwattr $C$DW$612, DW_AT_name("ADCSAMPLEMODE")
    4080                      .dwattr $C$DW$612, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4081                      .dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4082                      .dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$613       .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$613, DW_AT_type(*$C$DW$T$24)
    4085                      .dwattr $C$DW$613, DW_AT_name("rsvd_5")
    4086                      .dwattr $C$DW$613, DW_AT_TI_symbol_name("_rsvd_5")
    4087                      .dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4088                      .dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$614       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$614, DW_AT_type(*$C$DW$T$24)
    4091                      .dwattr $C$DW$614, DW_AT_name("ADCINTSOCSEL1")
    4092                      .dwattr $C$DW$614, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4093                      .dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   82

    4094                      .dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$615       .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$24)
    4097                      .dwattr $C$DW$615, DW_AT_name("ADCINTSOCSEL2")
    4098                      .dwattr $C$DW$615, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4099                      .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4100                      .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    4101              $C$DW$616       .dwtag  DW_TAG_member
    4102                      .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$27)
    4103                      .dwattr $C$DW$616, DW_AT_name("rsvd_6")
    4104                      .dwattr $C$DW$616, DW_AT_TI_symbol_name("_rsvd_6")
    4105                      .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4106                      .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    4107              $C$DW$617       .dwtag  DW_TAG_member
    4108                      .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    4109                      .dwattr $C$DW$617, DW_AT_name("ADCSOCFLG1")
    4110                      .dwattr $C$DW$617, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4111                      .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4112                      .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    4113              $C$DW$618       .dwtag  DW_TAG_member
    4114                      .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$24)
    4115                      .dwattr $C$DW$618, DW_AT_name("rsvd_7")
    4116                      .dwattr $C$DW$618, DW_AT_TI_symbol_name("_rsvd_7")
    4117                      .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4118                      .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    4119              $C$DW$619       .dwtag  DW_TAG_member
    4120                      .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$24)
    4121                      .dwattr $C$DW$619, DW_AT_name("ADCSOCFRC1")
    4122                      .dwattr $C$DW$619, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4123                      .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4124                      .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    4125              $C$DW$620       .dwtag  DW_TAG_member
    4126                      .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$24)
    4127                      .dwattr $C$DW$620, DW_AT_name("rsvd_8")
    4128                      .dwattr $C$DW$620, DW_AT_TI_symbol_name("_rsvd_8")
    4129                      .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4130                      .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$621       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    4133                      .dwattr $C$DW$621, DW_AT_name("ADCSOCOVF1")
    4134                      .dwattr $C$DW$621, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4135                      .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4136                      .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    4137              $C$DW$622       .dwtag  DW_TAG_member
    4138                      .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$24)
    4139                      .dwattr $C$DW$622, DW_AT_name("rsvd_9")
    4140                      .dwattr $C$DW$622, DW_AT_TI_symbol_name("_rsvd_9")
    4141                      .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4142                      .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    4143              $C$DW$623       .dwtag  DW_TAG_member
    4144                      .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    4145                      .dwattr $C$DW$623, DW_AT_name("ADCSOCOVFCLR1")
    4146                      .dwattr $C$DW$623, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4147                      .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4148                      .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   83

    4149              $C$DW$624       .dwtag  DW_TAG_member
    4150                      .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$24)
    4151                      .dwattr $C$DW$624, DW_AT_name("rsvd_10")
    4152                      .dwattr $C$DW$624, DW_AT_TI_symbol_name("_rsvd_10")
    4153                      .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4154                      .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    4155              $C$DW$625       .dwtag  DW_TAG_member
    4156                      .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$25)
    4157                      .dwattr $C$DW$625, DW_AT_name("ADCSOCxCTL")
    4158                      .dwattr $C$DW$625, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4159                      .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4160                      .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    4161              $C$DW$626       .dwtag  DW_TAG_member
    4162                      .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$25)
    4163                      .dwattr $C$DW$626, DW_AT_name("rsvd_11")
    4164                      .dwattr $C$DW$626, DW_AT_TI_symbol_name("_rsvd_11")
    4165                      .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4166                      .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    4167              $C$DW$627       .dwtag  DW_TAG_member
    4168                      .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$24)
    4169                      .dwattr $C$DW$627, DW_AT_name("ADCREFTRIM")
    4170                      .dwattr $C$DW$627, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4171                      .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4172                      .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$628       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$24)
    4175                      .dwattr $C$DW$628, DW_AT_name("ADCOFFTRIM")
    4176                      .dwattr $C$DW$628, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4177                      .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4178                      .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    4179              $C$DW$629       .dwtag  DW_TAG_member
    4180                      .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$30)
    4181                      .dwattr $C$DW$629, DW_AT_name("resvd_12")
    4182                      .dwattr $C$DW$629, DW_AT_TI_symbol_name("_resvd_12")
    4183                      .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    4184                      .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    4185              $C$DW$630       .dwtag  DW_TAG_member
    4186                      .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$24)
    4187                      .dwattr $C$DW$630, DW_AT_name("ADCREV")
    4188                      .dwattr $C$DW$630, DW_AT_TI_symbol_name("_ADCREV")
    4189                      .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4190                      .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    4191                      .dwendtag $C$DW$T$31
    4192              
    4193              $C$DW$T$227     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4194                      .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$31)
    4195                      .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4196              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    4197                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$31)
    4198                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    4199              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4200                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4201                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4202              
    4203              $C$DW$T$34      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   84

    4204                      .dwattr $C$DW$T$34, DW_AT_name("_CLARKE_Obj_")
    4205                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x06)
    4206              $C$DW$631       .dwtag  DW_TAG_member
    4207                      .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$32)
    4208                      .dwattr $C$DW$631, DW_AT_name("alpha_sf")
    4209                      .dwattr $C$DW$631, DW_AT_TI_symbol_name("_alpha_sf")
    4210                      .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4211                      .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    4212              $C$DW$632       .dwtag  DW_TAG_member
    4213                      .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$32)
    4214                      .dwattr $C$DW$632, DW_AT_name("beta_sf")
    4215                      .dwattr $C$DW$632, DW_AT_TI_symbol_name("_beta_sf")
    4216                      .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4217                      .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    4218              $C$DW$633       .dwtag  DW_TAG_member
    4219                      .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$33)
    4220                      .dwattr $C$DW$633, DW_AT_name("numSensors")
    4221                      .dwattr $C$DW$633, DW_AT_TI_symbol_name("_numSensors")
    4222                      .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4223                      .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    4224                      .dwendtag $C$DW$T$34
    4225              
    4226              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4227                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$34)
    4228                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4229              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4230                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$34)
    4231                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4232              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4233                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4234                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4235              
    4236              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4237                      .dwattr $C$DW$T$36, DW_AT_name("_CLK_Obj_")
    4238                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x11)
    4239              $C$DW$634       .dwtag  DW_TAG_member
    4240                      .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$24)
    4241                      .dwattr $C$DW$634, DW_AT_name("XCLK")
    4242                      .dwattr $C$DW$634, DW_AT_TI_symbol_name("_XCLK")
    4243                      .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4244                      .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    4245              $C$DW$635       .dwtag  DW_TAG_member
    4246                      .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$24)
    4247                      .dwattr $C$DW$635, DW_AT_name("rsvd_1")
    4248                      .dwattr $C$DW$635, DW_AT_TI_symbol_name("_rsvd_1")
    4249                      .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4250                      .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    4251              $C$DW$636       .dwtag  DW_TAG_member
    4252                      .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$24)
    4253                      .dwattr $C$DW$636, DW_AT_name("CLKCTL")
    4254                      .dwattr $C$DW$636, DW_AT_TI_symbol_name("_CLKCTL")
    4255                      .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4256                      .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$637       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   85

    4259                      .dwattr $C$DW$637, DW_AT_name("rsvd_2")
    4260                      .dwattr $C$DW$637, DW_AT_TI_symbol_name("_rsvd_2")
    4261                      .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4262                      .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    4263              $C$DW$638       .dwtag  DW_TAG_member
    4264                      .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$24)
    4265                      .dwattr $C$DW$638, DW_AT_name("LOSPCP")
    4266                      .dwattr $C$DW$638, DW_AT_TI_symbol_name("_LOSPCP")
    4267                      .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4268                      .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    4269              $C$DW$639       .dwtag  DW_TAG_member
    4270                      .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$24)
    4271                      .dwattr $C$DW$639, DW_AT_name("PCLKCR0")
    4272                      .dwattr $C$DW$639, DW_AT_TI_symbol_name("_PCLKCR0")
    4273                      .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4274                      .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    4275              $C$DW$640       .dwtag  DW_TAG_member
    4276                      .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$24)
    4277                      .dwattr $C$DW$640, DW_AT_name("PCLKCR1")
    4278                      .dwattr $C$DW$640, DW_AT_TI_symbol_name("_PCLKCR1")
    4279                      .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4280                      .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    4281              $C$DW$641       .dwtag  DW_TAG_member
    4282                      .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$27)
    4283                      .dwattr $C$DW$641, DW_AT_name("rsvd_3")
    4284                      .dwattr $C$DW$641, DW_AT_TI_symbol_name("_rsvd_3")
    4285                      .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4286                      .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    4287              $C$DW$642       .dwtag  DW_TAG_member
    4288                      .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$24)
    4289                      .dwattr $C$DW$642, DW_AT_name("PCLKCR3")
    4290                      .dwattr $C$DW$642, DW_AT_TI_symbol_name("_PCLKCR3")
    4291                      .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4292                      .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    4293                      .dwendtag $C$DW$T$36
    4294              
    4295              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    4296                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$36)
    4297                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    4298              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4299                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    4300                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    4301              
    4302              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4303                      .dwattr $C$DW$T$37, DW_AT_name("_CPU_Obj_")
    4304                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4305              $C$DW$643       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$33)
    4307                      .dwattr $C$DW$643, DW_AT_name("tmp")
    4308                      .dwattr $C$DW$643, DW_AT_TI_symbol_name("_tmp")
    4309                      .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4310                      .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    4311                      .dwendtag $C$DW$T$37
    4312              
    4313              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   86

    4314                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$37)
    4315                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    4316              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4317                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    4318                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    4319              
    4320              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4321                      .dwattr $C$DW$T$40, DW_AT_name("_CPU_USAGE_Obj_")
    4322                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x16)
    4323              $C$DW$644       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$38)
    4325                      .dwattr $C$DW$644, DW_AT_name("timerPeriod_cnts")
    4326                      .dwattr $C$DW$644, DW_AT_TI_symbol_name("_timerPeriod_cnts")
    4327                      .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4328                      .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    4329              $C$DW$645       .dwtag  DW_TAG_member
    4330                      .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$38)
    4331                      .dwattr $C$DW$645, DW_AT_name("cnt_z0")
    4332                      .dwattr $C$DW$645, DW_AT_TI_symbol_name("_cnt_z0")
    4333                      .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4334                      .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    4335              $C$DW$646       .dwtag  DW_TAG_member
    4336                      .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$38)
    4337                      .dwattr $C$DW$646, DW_AT_name("cnt_z1")
    4338                      .dwattr $C$DW$646, DW_AT_TI_symbol_name("_cnt_z1")
    4339                      .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4340                      .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    4341              $C$DW$647       .dwtag  DW_TAG_member
    4342                      .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$38)
    4343                      .dwattr $C$DW$647, DW_AT_name("deltaCnt")
    4344                      .dwattr $C$DW$647, DW_AT_TI_symbol_name("_deltaCnt")
    4345                      .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4346                      .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$648       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$38)
    4349                      .dwattr $C$DW$648, DW_AT_name("deltaCntAcc")
    4350                      .dwattr $C$DW$648, DW_AT_TI_symbol_name("_deltaCntAcc")
    4351                      .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4352                      .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    4353              $C$DW$649       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$38)
    4355                      .dwattr $C$DW$649, DW_AT_name("deltaCntAccNum")
    4356                      .dwattr $C$DW$649, DW_AT_TI_symbol_name("_deltaCntAccNum")
    4357                      .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4358                      .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    4359              $C$DW$650       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$38)
    4361                      .dwattr $C$DW$650, DW_AT_name("deltaCntAccNumMax")
    4362                      .dwattr $C$DW$650, DW_AT_TI_symbol_name("_deltaCntAccNumMax")
    4363                      .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4364                      .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    4365              $C$DW$651       .dwtag  DW_TAG_member
    4366                      .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$38)
    4367                      .dwattr $C$DW$651, DW_AT_name("minDeltaCntObserved")
    4368                      .dwattr $C$DW$651, DW_AT_TI_symbol_name("_minDeltaCntObserved")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   87

    4369                      .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4370                      .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$652       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$38)
    4373                      .dwattr $C$DW$652, DW_AT_name("avgDeltaCntObserved")
    4374                      .dwattr $C$DW$652, DW_AT_TI_symbol_name("_avgDeltaCntObserved")
    4375                      .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4376                      .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    4377              $C$DW$653       .dwtag  DW_TAG_member
    4378                      .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$38)
    4379                      .dwattr $C$DW$653, DW_AT_name("maxDeltaCntObserved")
    4380                      .dwattr $C$DW$653, DW_AT_TI_symbol_name("_maxDeltaCntObserved")
    4381                      .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4382                      .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    4383              $C$DW$654       .dwtag  DW_TAG_member
    4384                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$39)
    4385                      .dwattr $C$DW$654, DW_AT_name("flag_resetStats")
    4386                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_flag_resetStats")
    4387                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4388                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    4389                      .dwendtag $C$DW$T$40
    4390              
    4391              $C$DW$T$228     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Obj")
    4392                      .dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$40)
    4393                      .dwattr $C$DW$T$228, DW_AT_language(DW_LANG_C)
    4394              $C$DW$T$229     .dwtag  DW_TAG_pointer_type
    4395                      .dwattr $C$DW$T$229, DW_AT_type(*$C$DW$T$40)
    4396                      .dwattr $C$DW$T$229, DW_AT_address_class(0x20)
    4397              $C$DW$T$230     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_USAGE_Handle")
    4398                      .dwattr $C$DW$T$230, DW_AT_type(*$C$DW$T$229)
    4399                      .dwattr $C$DW$T$230, DW_AT_language(DW_LANG_C)
    4400              
    4401              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4402                      .dwattr $C$DW$T$72, DW_AT_name("_CTRL_Obj_")
    4403                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x108)
    4404              $C$DW$655       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$41)
    4406                      .dwattr $C$DW$655, DW_AT_name("version")
    4407                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_version")
    4408                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4409                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$656       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$43)
    4412                      .dwattr $C$DW$656, DW_AT_name("state")
    4413                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_state")
    4414                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4415                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$657       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$43)
    4418                      .dwattr $C$DW$657, DW_AT_name("prevState")
    4419                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_prevState")
    4420                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4421                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$658       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$45)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   88

    4424                      .dwattr $C$DW$658, DW_AT_name("errorCode")
    4425                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_errorCode")
    4426                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4427                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$659       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$47)
    4430                      .dwattr $C$DW$659, DW_AT_name("clarkeHandle_I")
    4431                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4432                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4433                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$660       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$48)
    4436                      .dwattr $C$DW$660, DW_AT_name("clarke_I")
    4437                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_clarke_I")
    4438                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4439                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$661       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$47)
    4442                      .dwattr $C$DW$661, DW_AT_name("clarkeHandle_V")
    4443                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4444                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4445                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$662       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$48)
    4448                      .dwattr $C$DW$662, DW_AT_name("clarke_V")
    4449                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_clarke_V")
    4450                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4451                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$663       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$50)
    4454                      .dwattr $C$DW$663, DW_AT_name("estHandle")
    4455                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_estHandle")
    4456                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4457                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$664       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$52)
    4460                      .dwattr $C$DW$664, DW_AT_name("parkHandle")
    4461                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_parkHandle")
    4462                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4463                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$665       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$53)
    4466                      .dwattr $C$DW$665, DW_AT_name("park")
    4467                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_park")
    4468                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4469                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$666       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$55)
    4472                      .dwattr $C$DW$666, DW_AT_name("pidHandle_Id")
    4473                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_pidHandle_Id")
    4474                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4475                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$667       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$56)
    4478                      .dwattr $C$DW$667, DW_AT_name("pid_Id")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   89

    4479                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_pid_Id")
    4480                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4481                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$668       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$55)
    4484                      .dwattr $C$DW$668, DW_AT_name("pidHandle_Iq")
    4485                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4486                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4487                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$669       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$56)
    4490                      .dwattr $C$DW$669, DW_AT_name("pid_Iq")
    4491                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_pid_Iq")
    4492                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4493                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4494              $C$DW$670       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$55)
    4496                      .dwattr $C$DW$670, DW_AT_name("pidHandle_spd")
    4497                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_pidHandle_spd")
    4498                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4499                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$671       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$56)
    4502                      .dwattr $C$DW$671, DW_AT_name("pid_spd")
    4503                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_pid_spd")
    4504                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4505                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$672       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$58)
    4508                      .dwattr $C$DW$672, DW_AT_name("iparkHandle")
    4509                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_iparkHandle")
    4510                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4511                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$673       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$59)
    4514                      .dwattr $C$DW$673, DW_AT_name("ipark")
    4515                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_ipark")
    4516                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4517                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$674       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$61)
    4520                      .dwattr $C$DW$674, DW_AT_name("svgenHandle")
    4521                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_svgenHandle")
    4522                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4523                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$675       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$62)
    4526                      .dwattr $C$DW$675, DW_AT_name("svgen")
    4527                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_svgen")
    4528                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4529                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$676       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$64)
    4532                      .dwattr $C$DW$676, DW_AT_name("trajHandle_Id")
    4533                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_trajHandle_Id")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   90

    4534                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4535                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$677       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$65)
    4538                      .dwattr $C$DW$677, DW_AT_name("traj_Id")
    4539                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_traj_Id")
    4540                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4541                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$678       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$64)
    4544                      .dwattr $C$DW$678, DW_AT_name("trajHandle_spd")
    4545                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_trajHandle_spd")
    4546                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4547                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$679       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$65)
    4550                      .dwattr $C$DW$679, DW_AT_name("traj_spd")
    4551                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_traj_spd")
    4552                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4553                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$680       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$64)
    4556                      .dwattr $C$DW$680, DW_AT_name("trajHandle_spdMax")
    4557                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4558                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4559                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4560              $C$DW$681       .dwtag  DW_TAG_member
    4561                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$65)
    4562                      .dwattr $C$DW$681, DW_AT_name("traj_spdMax")
    4563                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_traj_spdMax")
    4564                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4565                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$682       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$66)
    4568                      .dwattr $C$DW$682, DW_AT_name("motorParams")
    4569                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_motorParams")
    4570                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4571                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4572              $C$DW$683       .dwtag  DW_TAG_member
    4573                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$68)
    4574                      .dwattr $C$DW$683, DW_AT_name("waitTimes")
    4575                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_waitTimes")
    4576                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4577                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4578              $C$DW$684       .dwtag  DW_TAG_member
    4579                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$67)
    4580                      .dwattr $C$DW$684, DW_AT_name("counter_state")
    4581                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_counter_state")
    4582                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4583                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$685       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$69)
    4586                      .dwattr $C$DW$685, DW_AT_name("numIsrTicksPerCtrlTick")
    4587                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4588                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   91

    4589                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4590              $C$DW$686       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$69)
    4592                      .dwattr $C$DW$686, DW_AT_name("numCtrlTicksPerCurrentTick")
    4593                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4594                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4595                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4596              $C$DW$687       .dwtag  DW_TAG_member
    4597                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$69)
    4598                      .dwattr $C$DW$687, DW_AT_name("numCtrlTicksPerSpeedTick")
    4599                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4600                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4601                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4602              $C$DW$688       .dwtag  DW_TAG_member
    4603                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$69)
    4604                      .dwattr $C$DW$688, DW_AT_name("numCtrlTicksPerTrajTick")
    4605                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4606                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4607                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4608              $C$DW$689       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$67)
    4610                      .dwattr $C$DW$689, DW_AT_name("ctrlFreq_Hz")
    4611                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    4612                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4613                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4614              $C$DW$690       .dwtag  DW_TAG_member
    4615                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$67)
    4616                      .dwattr $C$DW$690, DW_AT_name("trajFreq_Hz")
    4617                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4618                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4619                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4620              $C$DW$691       .dwtag  DW_TAG_member
    4621                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$32)
    4622                      .dwattr $C$DW$691, DW_AT_name("trajPeriod_sec")
    4623                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4624                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4625                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4626              $C$DW$692       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$70)
    4628                      .dwattr $C$DW$692, DW_AT_name("ctrlPeriod_sec")
    4629                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4630                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4631                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4632              $C$DW$693       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$32)
    4634                      .dwattr $C$DW$693, DW_AT_name("maxVsMag_pu")
    4635                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4636                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4637                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4638              $C$DW$694       .dwtag  DW_TAG_member
    4639                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$71)
    4640                      .dwattr $C$DW$694, DW_AT_name("Iab_in")
    4641                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_Iab_in")
    4642                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4643                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   92

    4644              $C$DW$695       .dwtag  DW_TAG_member
    4645                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$71)
    4646                      .dwattr $C$DW$695, DW_AT_name("Iab_filt")
    4647                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_Iab_filt")
    4648                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4649                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4650              $C$DW$696       .dwtag  DW_TAG_member
    4651                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$71)
    4652                      .dwattr $C$DW$696, DW_AT_name("Idq_in")
    4653                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_Idq_in")
    4654                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4655                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4656              $C$DW$697       .dwtag  DW_TAG_member
    4657                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$71)
    4658                      .dwattr $C$DW$697, DW_AT_name("Vab_in")
    4659                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_Vab_in")
    4660                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4661                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4662              $C$DW$698       .dwtag  DW_TAG_member
    4663                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$32)
    4664                      .dwattr $C$DW$698, DW_AT_name("spd_out")
    4665                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_spd_out")
    4666                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    4667                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4668              $C$DW$699       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$71)
    4670                      .dwattr $C$DW$699, DW_AT_name("Vab_out")
    4671                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_Vab_out")
    4672                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4673                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4674              $C$DW$700       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$71)
    4676                      .dwattr $C$DW$700, DW_AT_name("Vdq_out")
    4677                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_Vdq_out")
    4678                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4679                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4680              $C$DW$701       .dwtag  DW_TAG_member
    4681                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$70)
    4682                      .dwattr $C$DW$701, DW_AT_name("Rhf")
    4683                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_Rhf")
    4684                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4685                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4686              $C$DW$702       .dwtag  DW_TAG_member
    4687                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$70)
    4688                      .dwattr $C$DW$702, DW_AT_name("Lhf")
    4689                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_Lhf")
    4690                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4691                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4692              $C$DW$703       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$70)
    4694                      .dwattr $C$DW$703, DW_AT_name("RoverL")
    4695                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_RoverL")
    4696                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4697                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4698              $C$DW$704       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   93

    4699                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$32)
    4700                      .dwattr $C$DW$704, DW_AT_name("Kp_Id")
    4701                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_Kp_Id")
    4702                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4703                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4704              $C$DW$705       .dwtag  DW_TAG_member
    4705                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$32)
    4706                      .dwattr $C$DW$705, DW_AT_name("Kp_Iq")
    4707                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_Kp_Iq")
    4708                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4709                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4710              $C$DW$706       .dwtag  DW_TAG_member
    4711                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$32)
    4712                      .dwattr $C$DW$706, DW_AT_name("Kp_spd")
    4713                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_Kp_spd")
    4714                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4715                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4716              $C$DW$707       .dwtag  DW_TAG_member
    4717                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$32)
    4718                      .dwattr $C$DW$707, DW_AT_name("Ki_Id")
    4719                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_Ki_Id")
    4720                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4721                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4722              $C$DW$708       .dwtag  DW_TAG_member
    4723                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$32)
    4724                      .dwattr $C$DW$708, DW_AT_name("Ki_Iq")
    4725                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_Ki_Iq")
    4726                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4727                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4728              $C$DW$709       .dwtag  DW_TAG_member
    4729                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$32)
    4730                      .dwattr $C$DW$709, DW_AT_name("Ki_spd")
    4731                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_Ki_spd")
    4732                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4733                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4734              $C$DW$710       .dwtag  DW_TAG_member
    4735                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$32)
    4736                      .dwattr $C$DW$710, DW_AT_name("Kd_Id")
    4737                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_Kd_Id")
    4738                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4739                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4740              $C$DW$711       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$32)
    4742                      .dwattr $C$DW$711, DW_AT_name("Kd_Iq")
    4743                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_Kd_Iq")
    4744                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4745                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    4746              $C$DW$712       .dwtag  DW_TAG_member
    4747                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$32)
    4748                      .dwattr $C$DW$712, DW_AT_name("Kd_spd")
    4749                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_Kd_spd")
    4750                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4751                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4752              $C$DW$713       .dwtag  DW_TAG_member
    4753                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   94

    4754                      .dwattr $C$DW$713, DW_AT_name("Ui_Id")
    4755                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_Ui_Id")
    4756                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4757                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4758              $C$DW$714       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    4760                      .dwattr $C$DW$714, DW_AT_name("Ui_Iq")
    4761                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_Ui_Iq")
    4762                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4763                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4764              $C$DW$715       .dwtag  DW_TAG_member
    4765                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$32)
    4766                      .dwattr $C$DW$715, DW_AT_name("Ui_spd")
    4767                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_Ui_spd")
    4768                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4769                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4770              $C$DW$716       .dwtag  DW_TAG_member
    4771                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$71)
    4772                      .dwattr $C$DW$716, DW_AT_name("Idq_ref")
    4773                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_Idq_ref")
    4774                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4775                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4776              $C$DW$717       .dwtag  DW_TAG_member
    4777                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$32)
    4778                      .dwattr $C$DW$717, DW_AT_name("IdRated")
    4779                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_IdRated")
    4780                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4781                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4782              $C$DW$718       .dwtag  DW_TAG_member
    4783                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$32)
    4784                      .dwattr $C$DW$718, DW_AT_name("spd_ref")
    4785                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_spd_ref")
    4786                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4787                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4788              $C$DW$719       .dwtag  DW_TAG_member
    4789                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$32)
    4790                      .dwattr $C$DW$719, DW_AT_name("spd_max")
    4791                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_spd_max")
    4792                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4793                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4794              $C$DW$720       .dwtag  DW_TAG_member
    4795                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$69)
    4796                      .dwattr $C$DW$720, DW_AT_name("counter_current")
    4797                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_counter_current")
    4798                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4799                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4800              $C$DW$721       .dwtag  DW_TAG_member
    4801                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$69)
    4802                      .dwattr $C$DW$721, DW_AT_name("counter_isr")
    4803                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_counter_isr")
    4804                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4805                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4806              $C$DW$722       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$69)
    4808                      .dwattr $C$DW$722, DW_AT_name("counter_speed")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   95

    4809                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_counter_speed")
    4810                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4811                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4812              $C$DW$723       .dwtag  DW_TAG_member
    4813                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$69)
    4814                      .dwattr $C$DW$723, DW_AT_name("counter_traj")
    4815                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_counter_traj")
    4816                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4817                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4818              $C$DW$724       .dwtag  DW_TAG_member
    4819                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$39)
    4820                      .dwattr $C$DW$724, DW_AT_name("flag_enableCtrl")
    4821                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4822                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4823                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4824              $C$DW$725       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$39)
    4826                      .dwattr $C$DW$725, DW_AT_name("flag_enableDcBusComp")
    4827                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4828                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4829                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4830              $C$DW$726       .dwtag  DW_TAG_member
    4831                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$39)
    4832                      .dwattr $C$DW$726, DW_AT_name("flag_enablePowerWarp")
    4833                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4834                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4835                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4836              $C$DW$727       .dwtag  DW_TAG_member
    4837                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$39)
    4838                      .dwattr $C$DW$727, DW_AT_name("flag_enableOffset")
    4839                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_flag_enableOffset")
    4840                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4841                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4842              $C$DW$728       .dwtag  DW_TAG_member
    4843                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$39)
    4844                      .dwattr $C$DW$728, DW_AT_name("flag_enableSpeedCtrl")
    4845                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4846                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4847                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4848              $C$DW$729       .dwtag  DW_TAG_member
    4849                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$39)
    4850                      .dwattr $C$DW$729, DW_AT_name("flag_enableUserMotorParams")
    4851                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4852                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4853                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4854              $C$DW$730       .dwtag  DW_TAG_member
    4855                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$71)
    4856                      .dwattr $C$DW$730, DW_AT_name("Idq_offset_pu")
    4857                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4858                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4859                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4860              $C$DW$731       .dwtag  DW_TAG_member
    4861                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$71)
    4862                      .dwattr $C$DW$731, DW_AT_name("Vdq_offset_pu")
    4863                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_Vdq_offset_pu")
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   96

    4864                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4865                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4866              $C$DW$732       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$32)
    4868                      .dwattr $C$DW$732, DW_AT_name("angle_pu")
    4869                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_angle_pu")
    4870                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4871                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4872              $C$DW$733       .dwtag  DW_TAG_member
    4873                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$32)
    4874                      .dwattr $C$DW$733, DW_AT_name("speed_ref_pu")
    4875                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_speed_ref_pu")
    4876                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4877                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4878              $C$DW$734       .dwtag  DW_TAG_member
    4879                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$32)
    4880                      .dwattr $C$DW$734, DW_AT_name("speed_fb_pu")
    4881                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_speed_fb_pu")
    4882                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4883                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4884              $C$DW$735       .dwtag  DW_TAG_member
    4885                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$32)
    4886                      .dwattr $C$DW$735, DW_AT_name("speed_outMax_pu")
    4887                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4888                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4889                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4890              $C$DW$736       .dwtag  DW_TAG_member
    4891                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$39)
    4892                      .dwattr $C$DW$736, DW_AT_name("flag_enableCurrentCtrl")
    4893                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4894                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4895                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4896                      .dwendtag $C$DW$T$72
    4897              
    4898              $C$DW$T$236     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4899                      .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$72)
    4900                      .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    4901              $C$DW$T$237     .dwtag  DW_TAG_pointer_type
    4902                      .dwattr $C$DW$T$237, DW_AT_type(*$C$DW$T$236)
    4903                      .dwattr $C$DW$T$237, DW_AT_address_class(0x20)
    4904              $C$DW$T$201     .dwtag  DW_TAG_pointer_type
    4905                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$72)
    4906                      .dwattr $C$DW$T$201, DW_AT_address_class(0x20)
    4907              $C$DW$T$202     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4908                      .dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$201)
    4909                      .dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
    4910              $C$DW$737       .dwtag  DW_TAG_TI_far_type
    4911                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$202)
    4912              $C$DW$T$238     .dwtag  DW_TAG_const_type
    4913                      .dwattr $C$DW$T$238, DW_AT_type(*$C$DW$737)
    4914              
    4915              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4916                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Version_")
    4917                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
    4918              $C$DW$738       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   97

    4919                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$23)
    4920                      .dwattr $C$DW$738, DW_AT_name("rsvd")
    4921                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_rsvd")
    4922                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4923                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4924              $C$DW$739       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$74)
    4926                      .dwattr $C$DW$739, DW_AT_name("targetProc")
    4927                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_targetProc")
    4928                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4929                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4930              $C$DW$740       .dwtag  DW_TAG_member
    4931                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$23)
    4932                      .dwattr $C$DW$740, DW_AT_name("major")
    4933                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_major")
    4934                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4935                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4936              $C$DW$741       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$23)
    4938                      .dwattr $C$DW$741, DW_AT_name("minor")
    4939                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_minor")
    4940                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4941                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4942                      .dwendtag $C$DW$T$75
    4943              
    4944              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4945                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$75)
    4946                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4947              $C$DW$T$244     .dwtag  DW_TAG_pointer_type
    4948                      .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$41)
    4949                      .dwattr $C$DW$T$244, DW_AT_address_class(0x20)
    4950              
    4951              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    4952                      .dwattr $C$DW$T$82, DW_AT_name("_DRV8301_Obj_")
    4953                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    4954              $C$DW$742       .dwtag  DW_TAG_member
    4955                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$77)
    4956                      .dwattr $C$DW$742, DW_AT_name("spiHandle")
    4957                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_spiHandle")
    4958                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4959                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4960              $C$DW$743       .dwtag  DW_TAG_member
    4961                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$79)
    4962                      .dwattr $C$DW$743, DW_AT_name("gpioHandle")
    4963                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_gpioHandle")
    4964                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4965                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4966              $C$DW$744       .dwtag  DW_TAG_member
    4967                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$81)
    4968                      .dwattr $C$DW$744, DW_AT_name("gpioNumber")
    4969                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_gpioNumber")
    4970                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4971                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4972              $C$DW$745       .dwtag  DW_TAG_member
    4973                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   98

    4974                      .dwattr $C$DW$745, DW_AT_name("RxTimeOut")
    4975                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_RxTimeOut")
    4976                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4977                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4978              $C$DW$746       .dwtag  DW_TAG_member
    4979                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$39)
    4980                      .dwattr $C$DW$746, DW_AT_name("enableTimeOut")
    4981                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_enableTimeOut")
    4982                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4983                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4984                      .dwendtag $C$DW$T$82
    4985              
    4986              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Obj")
    4987                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$82)
    4988                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    4989              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    4990                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$82)
    4991                      .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
    4992              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Handle")
    4993                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    4994                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4995              
    4996              $C$DW$T$93      .dwtag  DW_TAG_structure_type
    4997                      .dwattr $C$DW$T$93, DW_AT_name("_DRV_SPI_8301_CTRL1_t_")
    4998                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x05)
    4999              $C$DW$747       .dwtag  DW_TAG_member
    5000                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$84)
    5001                      .dwattr $C$DW$747, DW_AT_name("DRV8301_CURRENT")
    5002                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_DRV8301_CURRENT")
    5003                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5004                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    5005              $C$DW$748       .dwtag  DW_TAG_member
    5006                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$86)
    5007                      .dwattr $C$DW$748, DW_AT_name("DRV8301_RESET")
    5008                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_DRV8301_RESET")
    5009                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5010                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$749       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$88)
    5013                      .dwattr $C$DW$749, DW_AT_name("PWM_MODE")
    5014                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_PWM_MODE")
    5015                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5016                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    5017              $C$DW$750       .dwtag  DW_TAG_member
    5018                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$90)
    5019                      .dwattr $C$DW$750, DW_AT_name("OC_MODE")
    5020                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_OC_MODE")
    5021                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5022                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    5023              $C$DW$751       .dwtag  DW_TAG_member
    5024                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$92)
    5025                      .dwattr $C$DW$751, DW_AT_name("OC_ADJ_SET")
    5026                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_OC_ADJ_SET")
    5027                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5028                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE   99

    5029                      .dwendtag $C$DW$T$93
    5030              
    5031              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL1_t_")
    5032                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$93)
    5033                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    5034              
    5035              $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5036                      .dwattr $C$DW$T$102, DW_AT_name("_DRV_SPI_8301_CTRL2_t_")
    5037                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x04)
    5038              $C$DW$752       .dwtag  DW_TAG_member
    5039                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$95)
    5040                      .dwattr $C$DW$752, DW_AT_name("OCTW_SET")
    5041                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_OCTW_SET")
    5042                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5043                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    5044              $C$DW$753       .dwtag  DW_TAG_member
    5045                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$97)
    5046                      .dwattr $C$DW$753, DW_AT_name("GAIN")
    5047                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_GAIN")
    5048                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5049                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    5050              $C$DW$754       .dwtag  DW_TAG_member
    5051                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$99)
    5052                      .dwattr $C$DW$754, DW_AT_name("DC_CAL_CH1p2")
    5053                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_DC_CAL_CH1p2")
    5054                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5055                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    5056              $C$DW$755       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$101)
    5058                      .dwattr $C$DW$755, DW_AT_name("OC_TOFF")
    5059                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_OC_TOFF")
    5060                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5061                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    5062                      .dwendtag $C$DW$T$102
    5063              
    5064              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8301_CTRL2_t_")
    5065                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$102)
    5066                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    5067              
    5068              $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5069                      .dwattr $C$DW$T$103, DW_AT_name("_DRV_SPI_8301_Stat1_t_")
    5070                      .dwattr $C$DW$T$103, DW_AT_byte_size(0x0b)
    5071              $C$DW$756       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$39)
    5073                      .dwattr $C$DW$756, DW_AT_name("FAULT")
    5074                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_FAULT")
    5075                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5076                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    5077              $C$DW$757       .dwtag  DW_TAG_member
    5078                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$39)
    5079                      .dwattr $C$DW$757, DW_AT_name("GVDD_UV")
    5080                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_GVDD_UV")
    5081                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5082                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    5083              $C$DW$758       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.11 Mon Oct 03 13:48:45 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\bee25\AppData\Local\Temp\1032410                            PAGE  100

    5084                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$39)
    5085                      .dwattr $C$DW$758, DW_AT_name("PVDD_UV")
    5086                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_PVDD_UV")
    5087                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5088                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    5089              $C$DW$759       .dwtag  DW_TAG_member
    5090                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$39)
    5091                      .dwattr $C$DW$759, DW_AT_name("OTSD")
    5092                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_OTSD")
    5093                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5094                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    5095              $C$DW$760       .dwtag  DW_TAG_member
    5096                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$39)
    5097                      .dwattr $C$DW$760, DW_AT_name("OTW")
    5098                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_OTW")
    5099                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5100                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    5101              $C$DW$761       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$39)
    5103                      .dwattr $C$DW$761, DW_AT_name("FETHA_OC")
    5104                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_FETHA_OC")
    5105                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5106                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    5107              $C$DW$762       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$39)
    5109                      .dwattr $C$DW$762, DW_AT_name("FETLA_OC")
    5110                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_FETLA_OC")
    5111                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5112                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    5113              $C$DW$763       .dwtag  DW_TAG_member
    5114                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$39)
    5115                      .dwattr $C$DW$763, DW_AT_name("FETHB_OC")
    5116                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_FETHB_OC")
    5117                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    5118                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    5119              $C$DW$764       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$39)
    5121                      .dwattr $C$DW$764, DW_AT_name("FETLB_OC")
    5122                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_FETLB_OC")
    5123                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5124                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$765       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$39)
    5127                      .dwattr $C$DW$765, DW_AT_name("FETHC_OC")
    5128                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_FETHC_OC")
    5129                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5130                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    5131              $C$DW$766       .dwtag  DW_TAG_member
    5132                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$39)
    5133                      .dwattr $C$DW$766, DW_AT_name("FETLC_OC")
    5134                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_FETLC_OC")
